export const data = [
    [
        "payer_name",
        "اربابیان",
        29
    ],
    [
        "payer_name",
        "رادپور",
        29
    ],
    [
        "payer_name",
        "احمدی",
        102
    ],
    [
        "payer_name",
        "ترابی",
        77
    ],
    [
        "payer_name",
        "رنجبر",
        73
    ],
    [
        "payer_name",
        "مرادی",
        75
    ],
    [
        "payer_name",
        "پورعظیمی",
        76
    ],
    [
        "payer_name",
        "زنوزین",
        73
    ],
    [
        "payer_name",
        "عرب",
        73
    ],
    [
        "payer_name",
        "سراج",
        73
    ],
    [
        "payer_name",
        "رشیدیان",
        73
    ],
    [
        "payer_name",
        "بهاروند",
        73
    ],
    [
        "payer_name",
        "کیانی",
        52
    ],
    [
        "payer_name",
        "سیف",
        14
    ],
    [
        "payer_name",
        "چنبری",
        5
    ],
    [
        "payer_name",
        "کریمی",
        8
    ],
    [
        "payer_name",
        "سازنده",
        30
    ],
    [
        "payer_name",
        "پولایی",
        4
    ],
    [
        "payer_name",
        "الماسی",
        3
    ],
    [
        "payer_name",
        "نوریان",
        13
    ],
    [
        "payer_name",
        "به منش",
        7
    ],
    [
        "payer_name",
        "ذوالقدر",
        9
    ],
    [
        "payer_name",
        "اینانلو",
        52
    ],
    [
        "payer_name",
        "توبکی",
        53
    ],
    [
        "payer_name",
        "روحی",
        53
    ],
    [
        "payer_name",
        "قهرمانی",
        1
    ],
    [
        "payer_name",
        "محمودی",
        3
    ],
    [
        "payer_name",
        "جانثار",
        9
    ],
    [
        "payer_name",
        "گودرزی",
        69
    ],
    [
        "payer_name",
        "امیری",
        69
    ],
    [
        "payer_name",
        "نصیرایی",
        15
    ],
    [
        "payer_name",
        "روزبهانی",
        10
    ],
    [
        "payer_name",
        "سیدمحسنی",
        3
    ],
    [
        "payer_name",
        "دولتی",
        1
    ],
    [
        "payer_name",
        "عرفان",
        2
    ],
    [
        "payer_name",
        "فرحی پور",
        2
    ],
    [
        "payer_name",
        "رحیمی",
        45
    ],
    [
        "payer_name",
        "جلالوند",
        12
    ],
    [
        "payer_name",
        "عاوجیان",
        28
    ],
    [
        "payer_name",
        "کمال نژاد",
        28
    ],
    [
        "payer_name",
        "رمضان پور",
        28
    ],
    [
        "payer_name",
        "خالدزاده",
        28
    ],
    [
        "payer_name",
        "شکری",
        28
    ],
    [
        "payer_name",
        "امیرحسین کوچکی",
        1
    ],
    [
        "payer_name",
        "زهرا حامدی",
        1
    ],
    [
        "payer_name",
        "مریم بیگانه",
        1
    ],
    [
        "payer_name",
        "اکبری",
        1
    ],
    [
        "payer_name",
        "شعبان زاده",
        1
    ],
    [
        "payer_name",
        "نوروزی",
        1
    ],
    [
        "payer_name",
        "عارف کاشانی",
        1
    ],
    [
        "payer_name",
        "کربلایی",
        1
    ],
    [
        "payer_name",
        "قریب",
        1
    ],
    [
        "payer_name",
        "پورغفاری",
        1
    ],
    [
        "payer_name",
        "محمدی",
        17
    ],
    [
        "payer_name",
        "طامه",
        1
    ],
    [
        "payer_name",
        "حمیدیان فر",
        4
    ],
    [
        "payer_name",
        "همایون",
        1
    ],
    [
        "payer_name",
        "مهدی اسماعیل زاده",
        1
    ],
    [
        "payer_name",
        "مخلص آبادی",
        1
    ],
    [
        "payer_name",
        "نوراله نــوری",
        1
    ],
    [
        "payer",
        "خضراء",
        4
    ],
    [
        "payer",
        "شرکت فروشگاه ها",
        57
    ],
    [
        "payer",
        "فروشگاه شهدای انقلاب",
        1
    ],
    [
        "payer",
        "پشتیبانی سازمان اتکا",
        731
    ],
    [
        "payer",
        "اداره کل بازنشستگی ن.م استان تهران",
        87
    ],
    [
        "payer",
        "اداره کل کارپردازی بانک ملی",
        17
    ],
    [
        "payer",
        "ایران گارمنت",
        15
    ],
    [
        "payer",
        "روغن کشی خرمشهر",
        6
    ],
    [
        "payer",
        "توسعه ساختمانی",
        8
    ],
    [
        "payer",
        "طراحی قدوسی",
        30
    ],
    [
        "payer",
        "صنایع دریایی",
        4
    ],
    [
        "payer",
        "سفیر نور جنت",
        8
    ],
    [
        "payer",
        "بهین گستر",
        3
    ],
    [
        "payer",
        "سمارت الکترونیک (صنام)",
        13
    ],
    [
        "payer",
        "بنی هاشم درود",
        7
    ],
    [
        "payer",
        "قند پانیذ فام",
        9
    ],
    [
        "payer",
        "فخر ایران",
        2
    ],
    [
        "payer",
        "صنایع تسلیحاتی حدید",
        52
    ],
    [
        "payer",
        "شرکت صنایع هوایی قدس",
        106
    ],
    [
        "payer",
        "عقیدتی سیاسی سازمان اتکا",
        4
    ],
    [
        "payer",
        "سازمان صنایع هوایی",
        37
    ],
    [
        "payer",
        "بیمارستان چمران",
        4
    ],
    [
        "payer",
        "بانک ملی",
        1
    ],
    [
        "payer",
        "عقیدتی سیاسی شرکت فروشگاهها",
        3
    ],
    [
        "payer",
        "مزارع نوین ایرانیان",
        9
    ],
    [
        "payer",
        "فروشگاه چمران",
        3
    ],
    [
        "payer",
        "توانمند سازی بازنشستگان نیروهای مسلح",
        138
    ],
    [
        "payer",
        "طراحی و ساخت موتورهای هوایی",
        7
    ],
    [
        "payer",
        "وزارت دفاع",
        17
    ],
    [
        "payer",
        "صنایع جنگ افزارسازی",
        10
    ],
    [
        "payer",
        "بی همتا",
        6
    ],
    [
        "payer",
        "شرکت فردوس برتر",
        1
    ],
    [
        "payer",
        "مزرعه نمونه گرگان",
        6
    ],
    [
        "payer",
        "تشریفات سازمان اتکا",
        4
    ],
    [
        "payer",
        "مدیریت طرح های صنعتی ایران",
        45
    ],
    [
        "payer",
        "جنگل شفارود",
        2
    ],
    [
        "payer",
        "آوای گردشگران یاس",
        12
    ],
    [
        "payer",
        "موسسه نواب صفوی",
        4
    ],
    [
        "payer",
        "ساختمانی بتن پاش",
        5
    ],
    [
        "payer",
        "صنایع شهید شوشتری",
        140
    ],
    [
        "payer",
        "فروشگاه اتکا مرکزی - بوشهر",
        2
    ],
    [
        "payer",
        "فروشگاه اتکا فارس - مرکزی شیراز",
        1
    ],
    [
        "payer",
        "اتکا کهکیلویه و بویر احمد -مرکزی یاسوج",
        2
    ],
    [
        "payer",
        "اتکا شهید رجایی",
        1
    ],
    [
        "payer",
        "اتکاگران امیر",
        2
    ],
    [
        "payer",
        "صنایع هوایی قدس",
        2
    ],
    [
        "payer",
        "پشتیبانی وزارت دفاع",
        2
    ],
    [
        "payer",
        "سازمان",
        6
    ],
    [
        "payer",
        "سال 97",
        1
    ],
    [
        "payer",
        "صنایع جنگ افزارسازی همدانی",
        1
    ],
    [
        "payer",
        "هدهد",
        1
    ],
    [
        "payer",
        "عقیدتی سیاسی اتکا-استان تهران",
        2
    ],
    [
        "payer",
        "سازمان ثبت احوال",
        17
    ],
    [
        "payer",
        "شرکت ساتا",
        1
    ],
    [
        "payer",
        "عقیدتی سیاسی توسعه منابع انرژی (توان)",
        2
    ],
    [
        "payer",
        "ارغوان گوشت چابهار",
        3
    ],
    [
        "payer",
        "نیروی انسانی ناجــا",
        1
    ],
    [
        "payer",
        "صنام",
        1
    ],
    [
        "agency",
        "هواپیمایی کیش",
        10
    ],
    [
        "agency",
        "هواپیمایی قشم",
        10
    ],
    [
        "agency",
        "هواپیمایی آتا",
        10
    ],
    [
        "agency",
        "هواپیمایی جمهوری اسلامی ایران",
        10
    ],
    [
        "agency",
        "خدمات هوایی کشور آسمان",
        10
    ],
    [
        "agency",
        "هواپیمایی ماهان",
        10
    ],
    [
        "agency",
        "سفیر ریل آسیا",
        10
    ],
    [
        "agency",
        "حمل و نقل ریلی رجا",
        10
    ],
    [
        "agency",
        "ریل پرداز نو آفرین",
        10
    ],
    [
        "agency",
        "هواپیمایی معراج",
        10
    ],
    [
        "agency",
        "هواپیمایی زاگرس",
        10
    ],
    [
        "agency",
        "هواپیمایی نفت ایران",
        10
    ],
    [
        "agency",
        "هواپیمایی اترک",
        10
    ],
    [
        "agency",
        "خدمات هواپیمایی کاسپین",
        10
    ],
    [
        "agency",
        "شرکت پرواز هدهد",
        10
    ],
    [
        "agency",
        "هواپیمایی تابان کیش",
        10
    ],
    [
        "agency",
        "هواپیمایی سپهران",
        10
    ],
    [
        "agency",
        "هواپیمایی ایران ایرتور",
        10
    ],
    [
        "agency",
        "هواپیمایی ساها",
        10
    ],
    [
        "agency",
        "هواپیمایی کارون",
        10
    ],
    [
        "agency",
        "هواپیمایی پرشین گلف",
        10
    ],
    [
        "agency",
        "هواپیمایی آذربایجان",
        10
    ],
    [
        "agency",
        "هواپیمایی ترکیه(ترکیش)",
        10
    ],
    [
        "agency",
        "شرکت لوفت هانزا هواپیمایی آلمان",
        10
    ],
    [
        "agency",
        "هواپیمایی امارات",
        10
    ],
    [
        "agency",
        "هواپیمایی ایر فرانس",
        10
    ],
    [
        "agency",
        "هواپیمایی اکراین",
        10
    ],
    [
        "agency",
        "هواپیمایی ویولینگ",
        10
    ],
    [
        "agency",
        "بیمه پارسیان",
        10
    ],
    [
        "agency",
        "هواپیمایی پویا",
        10
    ],
    [
        "airline",
        "آتا",
        10
    ],
    [
        "airline",
        "آسمان",
        10
    ],
    [
        "airline",
        "اترک",
        10
    ],
    [
        "airline",
        "ایران ایر",
        10
    ],
    [
        "airline",
        "ایرتور",
        10
    ],
    [
        "airline",
        "پویا",
        10
    ],
    [
        "airline",
        "تابان",
        10
    ],
    [
        "airline",
        "تفتان",
        10
    ],
    [
        "airline",
        "زاگرس",
        10
    ],
    [
        "airline",
        "ساها",
        10
    ],
    [
        "airline",
        "سپهران",
        10
    ],
    [
        "airline",
        "قشم ایر",
        10
    ],
    [
        "airline",
        "ماهان",
        10
    ],
    [
        "airline",
        "معراج",
        10
    ],
    [
        "airline",
        "نفت",
        10
    ],
    [
        "airline",
        "کاسپین",
        10
    ],
    [
        "airline",
        "کیش ایر",
        10
    ],
    [
        "airline",
        "آذربایجان",
        10
    ],
    [
        "airline",
        "آلیتالیا",
        10
    ],
    [
        "airline",
        "اتحاد",
        10
    ],
    [
        "airline",
        "اتریشی",
        10
    ],
    [
        "airline",
        "اطلس گلوبال",
        10
    ],
    [
        "airline",
        "امارات",
        10
    ],
    [
        "airline",
        "اکراین",
        10
    ],
    [
        "airline",
        "ایر آستانا",
        10
    ],
    [
        "airline",
        "ایرفرانس",
        10
    ],
    [
        "airline",
        "ایژین",
        10
    ],
    [
        "airline",
        "بریتیش ایرویز",
        10
    ],
    [
        "airline",
        "تای ایرویز",
        10
    ],
    [
        "airline",
        "ترکیش",
        10
    ],
    [
        "airline",
        "چاینا سادرن",
        10
    ],
    [
        "airline",
        "عمان ایر",
        10
    ],
    [
        "airline",
        "فلای دبی",
        10
    ],
    [
        "airline",
        "قطر",
        10
    ],
    [
        "airline",
        "گلف ایر",
        10
    ],
    [
        "airline",
        "لوفت هانزا",
        10
    ],
    [
        "airline",
        "کویت",
        10
    ],
    [
        "airline",
        "کی ال ام",
        10
    ]
];
