export const data = [
  { names: ["تورهال"], country: "TR", lng: 36.09, lat: 40.39 },
  {
    names: ["لامبرشت (فالتز)"],
    country: "DE",
    lng: 8.086111111111112,
    lat: 49.38027777777778
  },
  {
    names: ["ارموسییو، سونورا", "ارموسییو", "Hermosillo"],
    country: "MX",
    lng: -110.95416666666667,
    lat: 29.098888888888887
  },
  {
    names: ["منزلینسک", "Мензелинск"],
    country: "RU",
    lng: 53.11666666666667,
    lat: 55.733333333333334
  },
  {
    names: ["هاناو", "Hanau"],
    country: "DE",
    lng: 8.916666666666666,
    lat: 50.13333333333333
  },
  { names: ["کارلسهامن"], country: "SE", lng: 14.85, lat: 56.166666666666664 },
  {
    names: ["پریشتینا", "Priština", "Prishtinë"],
    country: "",
    lng: 21.166666666666668,
    lat: 42.666666666666664
  },
  {
    names: ["پامباک، گغارکونیک", "پامباک", "Փամբակ"],
    country: "AM",
    lng: 45.53194444444444,
    lat: 40.38611111111111
  },
  { names: ["ابشوای"], country: "EG", lng: 30.710678, lat: 29.44474 },
  { names: ["ریشتنبرگ"], country: "DE", lng: 12.866666666666667, lat: 54.2 },
  {
    names: ["فاتسا", "Fatsa"],
    country: "TR",
    lng: 37.5,
    lat: 41.03333333333333
  },
  {
    names: ["موشین", "Morshyn"],
    country: "UA",
    lng: 23.866666666666667,
    lat: 49.15
  },
  {
    names: ["کینشاسا", "Kinshas"],
    country: "CD",
    lng: 15.322222222222223,
    lat: -4.325
  },
  { names: ["استرهوفن"], country: "DE", lng: 13.016666666666667, lat: 48.7 },
  {
    names: ["هالیوود، فلوریدا", "City of Hollywood"],
    country: "US",
    lng: -80.17500000000001,
    lat: 26.02138888888889
  },
  {
    names: ["فریدریشرودا"],
    country: "DE",
    lng: 10.566666666666666,
    lat: 50.86666666666667
  },
  {
    names: ["دیتنهایم"],
    country: "DE",
    lng: 10.073333333333332,
    lat: 48.21194444444445
  },
  {
    names: ["ممفیس، تنسی", "Memphis, Tennessee"],
    country: "US",
    lng: -89.97111111111111,
    lat: 35.1175
  },
  { names: ["سبش", "Sebeș"], country: "RO", lng: 23.57, lat: 45.96 },
  {
    names: ["بیشکک", "بیشکک (فرونزه)", "Бишкек"],
    country: "KG",
    lng: 74.61222222222221,
    lat: 42.874722222222225
  },
  {
    names: ["باگاران", "Բագարան"],
    country: "AM",
    lng: 43.69277777777778,
    lat: 40.14944444444444
  },
  {
    names: ["کارتاخنا، کلمبیا", "کارتاخنا"],
    country: "CO",
    lng: -75.5,
    lat: 10.4
  },
  {
    names: ["شیکاگو", "City of Chicago"],
    country: "US",
    lng: -87.62777777777777,
    lat: 41.88194444444444
  },
  {
    names: ["آرماویر (روستا)", "آرماویر", "Արմավիր"],
    country: "AM",
    lng: 44.04833333333333,
    lat: 40.08972222222222
  },
  {
    names: ["سن پترزبورگ، فلوریدا", "City of St. Petersburg, Florida"],
    country: "US",
    lng: -82.64,
    lat: 27.773055555555555
  },
  {
    names: ["اورلندو، فلوریدا", "City of Orlando"],
    country: "US",
    lng: -81.29888888888888,
    lat: 28.41583333333333
  },
  {
    names: ["بوام‌هلدر", "Baumholder"],
    country: "DE",
    lng: 7.333333333333333,
    lat: 49.6
  },
  {
    names: ["ارانینباوم-وورلیتس"],
    country: "DE",
    lng: 12.406944444444445,
    lat: 51.799166666666665
  },
  {
    names: ["ایریند", "Իրինդ"],
    country: "AM",
    lng: 43.983333333333334,
    lat: 40.38333333333333
  },
  {
    names: ["ویلیتا", "Villeta"],
    country: "PY",
    lng: -57.559999999999995,
    lat: -25.51
  },
  {
    names: ["اشمه", "Eşme"],
    country: "TR",
    lng: 28.966666666666665,
    lat: 38.4
  },
  {
    names: ["راینفلد، هول‌اشتاین", "Reinfeld"],
    country: "DE",
    lng: 10.483333333333333,
    lat: 53.833333333333336
  },
  {
    names: ["فرست (لاوسیتز)", "Forst (Lausitz)"],
    country: "DE",
    lng: 14.633333333333333,
    lat: 51.733333333333334
  },
  {
    names: ["گریبادوف، ارمنستان", "گریبادوف", "Գրիբոյեդով"],
    country: "AM",
    lng: 44.27166666666667,
    lat: 40.113055555555555
  },
  {
    names: ["پالرمو، اویلا", "Palermo", "Guagua"],
    country: "CO",
    lng: -75.4375,
    lat: 2.8916666666666666
  },
  {
    names: ["بلگراد", "Београд", "Beograd"],
    country: "RS",
    lng: 20.46222222222222,
    lat: 44.82055555555556
  },
  {
    names: ["فری‌تاون"],
    country: "SL",
    lng: -13.234444444444444,
    lat: 8.484444444444444
  },
  {
    names: ["ساری‌قمیش (شهر)", "ساری‌قمیش"],
    country: "TR",
    lng: 42.573055555555555,
    lat: 40.338055555555556
  },
  {
    names: ["نرکین شورژا", "Ներքին Շորժա"],
    country: "AM",
    lng: 45.836111111111116,
    lat: 40.11
  },
  { names: ["کفر سعد"], country: "EG", lng: 31.686452, lat: 31.359427 },
  {
    names: ["نرکین خندزورسک", "Ներքին Խնձորեսկ"],
    country: "AM",
    lng: 46.49611111111111,
    lat: 39.50611111111111
  },
  {
    names: ["باتورین", "Baturyn", "Батурин"],
    country: "UA",
    lng: 32.88333333333333,
    lat: 51.35
  },
  {
    names: ["پنوم‌پن", "پنوم پن", "Phnom-Penh", "ភ្នំពេញ"],
    country: "KH",
    lng: 104.91666666666667,
    lat: 11.55
  },
  {
    names: ["تورکا", "Turka", "Турка"],
    country: "UA",
    lng: 23.022499999999997,
    lat: 49.1575
  },
  {
    names: ["بیتونتو", "Bitonto"],
    country: "IT",
    lng: 16.683333333333334,
    lat: 41.11666666666667
  },
  {
    names: ["پاسادینا، کالیفرنیا", "پاسادینا", "City of Pasadena"],
    country: "US",
    lng: -118.13194444444444,
    lat: 34.15611111111111
  },
  {
    names: ["هوفهایم، بایرن"],
    country: "DE",
    lng: 10.183333333333334,
    lat: 50.13333333333333
  },
  {
    names: ["زامورا، میچوآکان"],
    country: "MX",
    lng: -102.28333333333333,
    lat: 19.983333333333334
  },
  {
    names: ["اورتسادزور", "Ուրցաձոր"],
    country: "AM",
    lng: 44.8175,
    lat: 39.9125
  },
  {
    names: ["مولهایم آن در دانوب"],
    country: "DE",
    lng: 8.885833333333332,
    lat: 48.03055555555555
  },
  {
    names: ["کارنوت، ارمنستان", "کارنوت", "Կառնուտ"],
    country: "AM",
    lng: 43.95416666666667,
    lat: 40.78361111111111
  },
  {
    names: ["ارویکا", "Arvika"],
    country: "SE",
    lng: 12.59138888888889,
    lat: 59.65416666666667
  },
  {
    names: ["کودله (رومانی)", "Codlea"],
    country: "RO",
    lng: 25.44388888888889,
    lat: 45.69694444444444
  },
  {
    names: ["اشلایتس"],
    country: "DE",
    lng: 11.816666666666666,
    lat: 50.583333333333336
  },
  {
    names: ["مستغانم"],
    country: "DZ",
    lng: 0.08333333333333333,
    lat: 35.93333333333333
  },
  { names: ["برزیل"], lng: -47.95, lat: -15.75 },
  {
    names: ["هایفونگ", "Haiphong", "Hải Phòng"],
    country: "VN",
    lng: 106.68333333333334,
    lat: 20.85
  },
  {
    names: ["اشتاینباخ-هالنبرگ"],
    country: "DE",
    lng: 10.566666666666666,
    lat: 50.70055555555556
  },
  {
    names: ["فرانتسبورگ"],
    country: "DE",
    lng: 12.866666666666667,
    lat: 54.166666666666664
  },
  {
    names: ["اوزیورسک، اوبلاست چلیابینسک", "Озёрск"],
    country: "RU",
    lng: 60.71666666666667,
    lat: 55.75
  },
  {
    names: ["هانی (شهر)"],
    country: "TR",
    lng: 40.3925,
    lat: 38.41361111111111
  },
  {
    names: ["خاشتاراک", "Խաշթառակ"],
    country: "AM",
    lng: 45.17972222222222,
    lat: 40.93861111111111
  },
  { names: ["دقی"], country: "EG", lng: 31, lat: 29 },
  {
    names: ["غازانچی", "Ղազանչի"],
    country: "AM",
    lng: 43.82166666666667,
    lat: 41.07888888888889
  },
  {
    names: ["مارهانتس", "Марганець"],
    country: "UA",
    lng: 34.60416666666667,
    lat: 47.64472222222222
  },
  {
    names: ["کومودورو ریواداویا", "Comodoro Rivadavia"],
    country: "AR",
    lng: -67.48083333333334,
    lat: -45.86472222222223
  },
  {
    names: ["باد نوین‌آر-آروایلار", "Bad Neuenahr-Ahrweiler"],
    country: "DE",
    lng: 7.113333333333333,
    lat: 50.54472222222222
  },
  {
    names: ["پارما", "Parma"],
    country: "IT",
    lng: 10.333333333333334,
    lat: 44.8
  },
  {
    names: ["الور ستار", "Alor Setar"],
    country: "MY",
    lng: 100.36666666666666,
    lat: 6.116666666666666
  },
  {
    names: ["لاتینا", "Latina"],
    country: "IT",
    lng: 12.9,
    lat: 41.46666666666667
  },
  {
    names: ["استنونگسوند"],
    country: "SE",
    lng: 11.816666666666666,
    lat: 58.083333333333336
  },
  {
    names: ["براتیسلاوا", "Bratislava"],
    country: "SK",
    lng: 48.14388888888889,
    lat: 17.109722222222224
  },
  {
    names: ["ادینبرا", "Edinburgh", "Dùn Èideann"],
    country: "GB",
    lng: -3.2,
    lat: 55.95
  },
  {
    names: ["هورنباخ"],
    country: "DE",
    lng: 7.369166666666667,
    lat: 49.18805555555555
  },
  {
    names: ["سنت بلازین"],
    country: "DE",
    lng: 8.128333333333334,
    lat: 47.761944444444445
  },
  {
    names: [
      "کورسون-شفچنکیفسکیی",
      "Korsun’-Shevchenkivs’kyi",
      "Корсунь-Шевченківський"
    ],
    country: "UA",
    lng: 31.283333333333335,
    lat: 49.483333333333334
  },
  { names: ["تربت حیدریه"], lng: 59.13, lat: 35.16 },
  {
    names: ["گنیف"],
    country: "PL",
    lng: 18.833333333333332,
    lat: 53.833333333333336
  },
  {
    names: ["کرونوستهایم", "Kornwestheim"],
    country: "DE",
    lng: 9.1852,
    lat: 48.8598
  },
  {
    names: ["مایسن", "Meissen"],
    country: "DE",
    lng: 13.477500000000001,
    lat: 51.16361111111111
  },
  {
    names: ["ریوگالگوس", "Río Gallegos"],
    country: "AR",
    lng: -69.21666666666667,
    lat: -51.63333333333333
  },
  {
    names: ["بیله اولانشت", "Băile Olănești"],
    country: "RO",
    lng: 24.233333333333334,
    lat: 45.2
  },
  {
    names: ["ساکرامنتو، کالیفرنیا", "ساکرامنتو"],
    country: "US",
    lng: -121.46888888888888,
    lat: 38.55555555555555
  },
  {
    names: ["اوسبی"],
    country: "SE",
    lng: 13.983333333333333,
    lat: 56.36666666666667
  },
  {
    names: ["اومان", "Uman", "Умань"],
    country: "UA",
    lng: 30.216666666666665,
    lat: 48.75
  },
  {
    names: ["نووی ساد", "Нови Сад", "Újvidék"],
    country: "RS",
    lng: 19.85,
    lat: 45.25
  },
  { names: ["مبارکه"], lng: 51.5144, lat: 32.3444 },
  {
    names: ["اشتاسفورت"],
    country: "DE",
    lng: 11.566666666666666,
    lat: 51.86666666666667
  },
  { names: ["اولودره"], country: "TR", lng: 42.9, lat: 37.416666666666664 },
  { names: ["پالماس", "Palmas"], country: "BR", lng: -48.35, lat: -10.2 },
  {
    names: ["اسلاووتا", "Slavuta", "Славута"],
    country: "UA",
    lng: 26.868333333333332,
    lat: 50.30277777777778
  },
  {
    names: ["گغاماوان", "Գեղամավան"],
    country: "AM",
    lng: 44.8875,
    lat: 40.56194444444444
  },
  {
    names: ["دزفول", "دسفیل، دزپیل، دسویل، دزفیل"],
    lng: 48.3974,
    lat: 32.3811
  },
  { names: ["تویسرکان"], lng: 48.44, lat: 34.55 },
  {
    names: ["کتی", "Քեթի"],
    country: "AM",
    lng: 43.848888888888894,
    lat: 40.884166666666665
  },
  { names: ["سبزوار"], lng: 57.43, lat: 36.12 },
  {
    names: ["تاندزاتاپ", "Տանձատափ"],
    country: "AM",
    lng: 46.271388888888886,
    lat: 39.36055555555556
  },
  {
    names: ["اومراشتات"],
    country: "DE",
    lng: 10.827777777777778,
    lat: 50.25833333333333
  },
  {
    names: ["پادووا", "Padova"],
    country: "IT",
    lng: 11.866666666666667,
    lat: 45.416666666666664
  },
  {
    names: ["چینچین", "Չինչին"],
    country: "AM",
    lng: 45.35416666666667,
    lat: 40.91166666666666
  },
  {
    names: ["پوپایان", "Popayán"],
    country: "CO",
    lng: -76.60916666666667,
    lat: 2.454166666666667
  },
  {
    names: ["بارویر سواگ، ارمنستان", "بارویرْ سِواگ"],
    country: "AM",
    lng: 44.93333333333333,
    lat: 39.766666666666666
  },
  {
    names: ["پریپیات"],
    country: "UA",
    lng: 30.056944444444444,
    lat: 51.40555555555555
  },
  {
    names: ["ورخیفتسفه", "Верхівцеве"],
    country: "UA",
    lng: 34.25388888888889,
    lat: 48.48527777777778
  },
  {
    names: ["ملریش‌اشتات"],
    country: "DE",
    lng: 10.316666666666666,
    lat: 50.416666666666664
  },
  {
    names: ["سن فرناندو د آپوره", "San Fernando de Apure"],
    country: "VE",
    lng: -67.46666666666667,
    lat: 7.9
  },
  {
    names: ["حکیم‌خان"],
    country: "TR",
    lng: 37.93277777777777,
    lat: 38.81638888888889
  },
  {
    names: ["باد زالزونگن"],
    country: "DE",
    lng: 10.233333333333333,
    lat: 50.81166666666666
  },
  {
    names: ["دنتون، تگزاس", "City of Denton"],
    country: "US",
    lng: -97.12916666666666,
    lat: 33.21638888888889
  },
  {
    names: ["اوکسرزلبن (بده)"],
    country: "DE",
    lng: 11.25,
    lat: 52.016666666666666
  },
  {
    names: ["سیوداد لوپز متیوس"],
    country: "MX",
    lng: -99.24694444444445,
    lat: 19.561111111111114
  },
  {
    names: ["انینا", "Anina"],
    country: "RO",
    lng: 21.853333333333335,
    lat: 45.09166666666667
  },
  {
    names: ["بوزایو", "Buzău"],
    country: "RO",
    lng: 26.816666666666666,
    lat: 45.166666666666664
  },
  {
    names: ["ماله (مالدیو)", "ماله", "Male", "މާލެ"],
    country: "MV",
    lng: 73.50888888888889,
    lat: 4.175000000000001
  },
  {
    names: ["اشاتوتن‌زی"],
    country: "DE",
    lng: 8.471666666666668,
    lat: 49.06472222222222
  },
  {
    names: ["طما", "Tima"],
    country: "EG",
    lng: 31.433333333333334,
    lat: 26.916666666666668
  },
  {
    names: ["نیو گلاسگو"],
    country: "CA",
    lng: -62.63333333333333,
    lat: 45.583333333333336
  },
  {
    names: ["آستانه (قزاقستان)", "آستانه", "Астана"],
    country: "KZ",
    lng: 71.43333333333334,
    lat: 51.166666666666664
  },
  {
    names: ["کارارا", "Carrara"],
    country: "IT",
    lng: 10.1,
    lat: 44.079166666666666
  },
  {
    names: ["کلسکرونا", "Karlskrona"],
    country: "SE",
    lng: 15.586111111111112,
    lat: 56.16083333333333
  },
  {
    names: ["رجاینا", "Regina"],
    country: "CA",
    lng: -104.60666666666665,
    lat: 50.45472222222222
  },
  {
    names: ["سینایا", "Sinaia"],
    country: "RO",
    lng: 25.55138888888889,
    lat: 45.35
  },
  {
    names: ["چکالوو، ارمنستان", "چکالوو", "Չկալով"],
    country: "AM",
    lng: 44.65333333333333,
    lat: 40.93444444444444
  },
  {
    names: ["واغاشن", "Վաղաշեն"],
    country: "AM",
    lng: 45.32888888888889,
    lat: 40.135
  },
  { names: ["خاوران (ترکیه)", "Havran"], country: "TR", lng: 27.1, lat: 39.55 },
  {
    names: ["هوهوت", "Hohhot", "ᠬᠥᠬᠡᠬᠣᠲᠠ", "呼和浩特"],
    country: "CN",
    lng: 111.65,
    lat: 40.81666666666667
  },
  {
    names: ["میتویدا"],
    country: "DE",
    lng: 12.981111111111112,
    lat: 50.98555555555556
  },
  {
    names: ["تالسا، اکلاهما", "Tulsa, Oklahoma"],
    country: "US",
    lng: -95.93722222222223,
    lat: 36.13138888888889
  },
  { names: ["عیاط"], country: "EG", lng: 31.2580453, lat: 29.6205681 },
  {
    names: ["اوورلند پارک، کانزاس", "Overland Park, Kansas"],
    country: "US",
    lng: -94.67083333333333,
    lat: 38.98222222222223
  },
  {
    names: ["هوتون، ارمنستان", "هوتون", "Հովտուն"],
    country: "AM",
    lng: 43.81666666666667,
    lat: 40.96666666666667
  },
  {
    names: ["پام دیل، کالیفرنیا", "پام دیل"],
    country: "US",
    lng: -118.10055555555554,
    lat: 34.58111111111111
  },
  {
    names: ["باد کنیگسهوفن ایم گرابفلد"],
    country: "DE",
    lng: 10.416666666666666,
    lat: 50.3
  },
  {
    names: ["واردادزور", "Վարդաձոր"],
    country: "AM",
    lng: 45.1875,
    lat: 40.19166666666666
  },
  {
    names: ["رژیشچیف", "Ржищів"],
    country: "UA",
    lng: 31.04361111111111,
    lat: 49.961111111111116
  },
  {
    names: ["گغادزور", "Գեղաձոր"],
    country: "AM",
    lng: 44.17305555555555,
    lat: 40.632777777777775
  },
  {
    names: ["شانتو", "汕头市"],
    country: "CN",
    lng: 116.66666666666667,
    lat: 23.35
  },
  {
    names: ["گرانادا (متا)", "Granada, Meta"],
    country: "CO",
    lng: -73.71000000000001,
    lat: 3.5469444444444442
  },
  {
    names: ["کامنتس", "Kamenz"],
    country: "DE",
    lng: 14.1,
    lat: 51.266666666666666
  },
  {
    names: ["کاندلاریا (واییه دل کایوکا)", "Candelaria"],
    country: "CO",
    lng: -76.38333333333334,
    lat: 3.4
  },
  {
    names: ["شریوپورت، لوییزیانا", "شریوپورت", "Shreveport"],
    country: "US",
    lng: -93.92111111111112,
    lat: 32.46805555555556
  },
  {
    names: ["زاستاونا", "Zastavna", "Заставна"],
    country: "UA",
    lng: 25.845,
    lat: 48.52027777777778
  },
  {
    names: ["یرکوی", "Yerköy"],
    country: "TR",
    lng: 34.46666666666667,
    lat: 39.63333333333333
  },
  {
    names: ["حیدرآباد (پاکستان)", "حیدر آباد"],
    country: "PK",
    lng: 68.36833333333333,
    lat: 25.379166666666666
  },
  {
    names: ["مادرید", "(به اسپانیایی: Madrid)"],
    country: "ES",
    lng: -3.716666666666667,
    lat: 40.38333333333333
  },
  {
    names: ["پودگوریتسا", "Подгорица"],
    country: "ME",
    lng: 19.266666666666666,
    lat: 42.46666666666667
  },
  {
    names: ["نور کیانک، آرارات", "نور کیانک", "Նոր Կյանք"],
    country: "AM",
    lng: 44.61638888888889,
    lat: 39.900277777777774
  },
  {
    names: ["باستر", "Basseterre"],
    country: "KN",
    lng: -62.733333333333334,
    lat: 17.3
  },
  {
    names: ["تیمفو", "ཐིམ་ཕུག།", "Thimphu"],
    country: "BT",
    lng: 89.64166666666668,
    lat: 27.466666666666665
  },
  {
    names: ["یوربرو", "Jordbro"],
    country: "SE",
    lng: 18.133333333333333,
    lat: 59.15
  },
  {
    names: ["سن پدرو چولولا"],
    country: "MX",
    lng: -98.30638888888889,
    lat: 19.063333333333333
  },
  {
    names: ["بیروت", "Beyrouth"],
    country: "LB",
    lng: 35.51305555555555,
    lat: 33.886944444444445
  },
  {
    names: ["نوی‌اشتات آن در آیش", "Neustadt an der Aisch"],
    country: "DE",
    lng: 10.608888888888888,
    lat: 49.59666666666667
  },
  {
    names: ["سنبلاوین", "El Senbellawein"],
    country: "EG",
    lng: 31.46944444444444,
    lat: 30.879722222222224
  },
  {
    names: ["دیلی", "Dili"],
    country: "TL",
    lng: 125.58333333333333,
    lat: -8.55
  },
  {
    names: ["استرلینگ هایتس، میشیگان", "City of Sterling Heights"],
    country: "US",
    lng: -83.02805555555555,
    lat: 42.57972222222222
  },
  {
    names: ["لاگوس د مورنو"],
    country: "MX",
    lng: -101.91666666666667,
    lat: 21.35
  },
  {
    names: ["سطیف، الجزایر", "سطیف", "سطیف‌"],
    country: "DZ",
    lng: 5.4,
    lat: 36.18333333333333
  },
  {
    names: ["استکهلم"],
    country: "SE",
    lng: 18.06861111111111,
    lat: 59.32944444444445
  },
  {
    names: ["لودویگسشتات"],
    country: "DE",
    lng: 11.3875,
    lat: 50.48583333333333
  },
  {
    names: ["سوکره", "Sucre", "Charcas, La Plata"],
    country: "BO",
    lng: -65.25,
    lat: -19.033333333333335
  },
  {
    names: ["اربعه (شهر)", "اربعه"],
    country: "TR",
    lng: 36.5666667,
    lat: 40.6666667
  },
  {
    names: ["یلپین", "Ելփին"],
    country: "AM",
    lng: 45.11027777777778,
    lat: 39.80583333333333
  },
  {
    names: ["وینزر، انتاریو", "وینزر", "Windsor"],
    country: "CA",
    lng: -83,
    lat: 42.28333333333333
  },
  {
    names: ["ترسینا", "Teresina, Piaui"],
    country: "BR",
    lng: -42.80166666666666,
    lat: -5.089166666666666
  },
  {
    names: ["بیه ده ارم", "Baia de Aramă"],
    country: "RO",
    lng: 22.81138888888889,
    lat: 45
  },
  { names: ["امیرکلا"], lng: 52.47, lat: 36.11 },
  {
    names: ["فلینت، میشیگان", "Flint, Michigan"],
    country: "US",
    lng: -83.69,
    lat: 43.01
  },
  {
    names: ["باد گاندرسهایم"],
    country: "DE",
    lng: 10.025277777777779,
    lat: 51.871944444444445
  },
  {
    names: ["ایسفلد"],
    country: "DE",
    lng: 10.916666666666666,
    lat: 50.416666666666664
  },
  {
    names: ["موسی‌لر", "موسی‌لِر", "Մուսալեռ"],
    country: "AM",
    lng: 44.37777777777778,
    lat: 40.154444444444444
  },
  {
    names: ["کوردوبا، آرژانتین", "کوردوبا", "Córdoba"],
    country: "AR",
    lng: -64.18333333333334,
    lat: -31.416666666666668
  },
  {
    names: ["هایرنیاتس", "Հայրենյաց"],
    country: "AM",
    lng: 43.870555555555555,
    lat: 40.632777777777775
  },
  {
    names: ["تاراتومب", "Թառաթումբ"],
    country: "AM",
    lng: 45.25083333333333,
    lat: 39.89138888888889
  },
  {
    names: ["فرانکفورت", "Frankfurt am Main"],
    country: "DE",
    lng: 8.685944444444445,
    lat: 50.111805555555556
  },
  {
    names: ["اوییتا", "Ōita", "大分"],
    country: "JP",
    lng: 131.60666666666665,
    lat: 33.233333333333334
  },
  { names: ["فورت", "Fürth"], country: "DE", lng: 11, lat: 49.46666666666667 },
  {
    names: ["باد دورک‌هایم"],
    country: "DE",
    lng: 8.168055555555554,
    lat: 49.45944444444445
  },
  {
    names: ["اسمیلا، اوکراین", "Smila", "Сміла"],
    country: "UA",
    lng: 31.873055555555556,
    lat: 49.211666666666666
  },
  {
    names: ["روساریو، سانتا فه", "روساریو", "Rosario"],
    country: "AR",
    lng: -60.666666666666664,
    lat: -32.95
  },
  {
    names: ["هالیچ", "Галич", "Halicz"],
    country: "UA",
    lng: 24.72861111111111,
    lat: 49.124722222222225
  },
  {
    names: ["پروومایسک، استان لوهانسک", "Pervomaisk", "Первомайськ"],
    country: "UA",
    lng: 38.56194444444444,
    lat: 48.62972222222222
  },
  {
    names: ["برند-اربیسدورف"],
    country: "DE",
    lng: 13.321944444444444,
    lat: 50.86888888888889
  },
  { names: ["گیوه (شهر)", "Geyve"], country: "TR", lng: 30.3, lat: 40.5 },
  {
    names: ["فرسنو (تولیما)", "Fresno, Tolima"],
    country: "CO",
    lng: -75.04027777777777,
    lat: 5.155555555555556
  },
  {
    names: ["گوراویماق"],
    country: "TR",
    lng: 42.02111111111111,
    lat: 38.57694444444445
  },
  { names: ["کرمان", "نام محلی:کِرمون"], lng: 57.06, lat: 30.29 },
  {
    names: ["یاموسوکرو", "Yamoussoukro"],
    country: "CI",
    lng: -5.283333333333333,
    lat: 6.816666666666666
  },
  {
    names: ["هراکلیون", "Heraklion", "Ηράκλειο"],
    country: "GR",
    lng: 25.133333333333333,
    lat: 35.333333333333336
  },
  {
    names: ["دویسبورگ", "Duisburg"],
    country: "DE",
    lng: 6.762691666666667,
    lat: 51.43514722222222
  },
  {
    names: ["دمبورگ-کامبورگ"],
    country: "DE",
    lng: 11.7075,
    lat: 51.053888888888885
  },
  {
    names: ["گویان فرانسه", "French Guiana", "Région Guyane"],
    country: "FR",
    lng: -53,
    lat: 4
  },
  { names: ["وایرترودینگن"], country: "DE", lng: 10.6, lat: 49.03333333333333 },
  { names: ["ملایر"], lng: 48.82, lat: 34.2942 },
  {
    names: ["تیسمانا", "Tismana"],
    lng: 22.948888888888888,
    lat: 45.050555555555555
  },
  {
    names: ["پاسادینا، کالیفرنیا", "پاسادینا", "City of Pasadena"],
    country: "US",
    lng: -118.13194444444444,
    lat: 34.15611111111111
  },
  {
    names: ["آلاپارس", "Ալափարս"],
    country: "AM",
    lng: 44.63472222222222,
    lat: 40.421388888888885
  },
  {
    names: ["پوتی"],
    country: "GE",
    lng: 41.67638888888889,
    lat: 42.14194444444444
  },
  {
    names: ["بوروس", "Borås"],
    country: "SE",
    lng: 12.940277777777778,
    lat: 57.721111111111114
  },
  {
    names: ["ویتسن‌هاوزن", "Witzenhausen, Germany"],
    country: "DE",
    lng: 9.857777777777777,
    lat: 51.342222222222226
  },
  { names: ["مارک‌ردویتس"], country: "DE", lng: 12.066666666666666, lat: 50 },
  {
    names: ["کوستوپیل", "Kostopil", "Костопіль"],
    country: "UA",
    lng: 26.45,
    lat: 50.88333333333333
  },
  {
    names: ["فورت کالینز، کلرادو"],
    country: "US",
    lng: -105.07805555555555,
    lat: 40.55916666666666
  },
  {
    names: ["منطقه کوکیمبو", "Coquimbo Region", "IV Región de Coquimbo"],
    country: "CL",
    lng: -70.25416666666666,
    lat: -29.907777777777778
  },
  {
    names: ["دمام (شهر)", "دمام", "الدمام"],
    country: "SA",
    lng: 50.2,
    lat: 26.283333333333335
  },
  { names: ["بروجن", "اورجن"], lng: 51.1722, lat: 31.5806 },
  {
    names: ["ریورساید، کالیفرنیا", "ریورساید"],
    country: "",
    lng: -117.39612777777778,
    lat: 33.94806388888889
  },
  { names: ["جرجا"], country: "EG", lng: 31.9, lat: 26.333333333333332 },
  {
    names: ["متمان", "Mettmann"],
    country: "DE",
    lng: 6.966666666666667,
    lat: 51.25
  },
  {
    names: ["کابل"],
    country: "AF",
    lng: 69.16666666666667,
    lat: 34.53333333333333
  },
  {
    names: ["تاواس", "Tavas"],
    country: "TR",
    lng: 29.07138888888889,
    lat: 37.57277777777778
  },
  {
    names: ["ازمیت"],
    country: "TR",
    lng: 29.916666666666668,
    lat: 40.766666666666666
  },
  { names: ["کوپنهایم"], country: "DE", lng: 8.254444444444445, lat: 48.8275 },
  { names: ["اتینگن"], country: "DE", lng: 10.583333333333334, lat: 48.95 },
  {
    names: ["استان اوساکا", "Osaka Prefecture", "大阪府"],
    country: "JP",
    lng: 135.52,
    lat: 34.686388888888885
  },
  {
    names: ["اودورهیو سکویس", "Odorheiu Secuiesc", "Székelyudvarhely"],
    country: "RO",
    lng: 25.301666666666666,
    lat: 46.31388888888888
  },
  {
    names: ["آمونبرگ"],
    country: "DE",
    lng: 8.923055555555555,
    lat: 50.797777777777775
  },
  {
    names: ["اکتروپ", "Ochtrup"],
    country: "DE",
    lng: 7.190277777777778,
    lat: 52.205555555555556
  },
  {
    names: ["مورفتلر", "Murfatlar"],
    country: "RO",
    lng: 28.40833333333333,
    lat: 44.17361111111111
  },
  { names: ["تیراسپل"], country: "MD", lng: 29.633333333333333, lat: 46.85 },
  { names: ["کویت"], lng: 47.96666666666667, lat: 29.366666666666667 },
  { names: ["برنبورگ"], country: "DE", lng: 11.733333333333333, lat: 51.8 },
  {
    names: ["سوروکابا", "Sorocaba"],
    country: "BR",
    lng: -47.45805555555556,
    lat: -23.501666666666665
  },
  {
    names: ["زاپوپان، خالیسکو"],
    country: "MX",
    lng: -103.39194444444445,
    lat: 20.720277777777778
  },
  {
    names: ["تولچین", "Тульчин"],
    country: "UA",
    lng: 28.849722222222223,
    lat: 48.67444444444444
  },
  {
    names: ["فلینت، میشیگان", "Flint, Michigan"],
    country: "US",
    lng: -83.69,
    lat: 43.01
  },
  {
    names: ["افشین (شهر)", "افشین"],
    country: "TR",
    lng: 36.916666666666664,
    lat: 38.25
  },
  {
    names: ["آلوشتا", "Alushta", "Алушта", "Aluşta"],
    country: "UA",
    lng: 34.397777777777776,
    lat: 44.66722222222222
  },
  {
    names: ["راینفلدن، آلمان", "Rheinfelden"],
    country: "DE",
    lng: 7.791666666666667,
    lat: 47.56111111111111
  },
  {
    names: ["تورنتو", "Toronto"],
    country: "CA",
    lng: -79.34068611111111,
    lat: 43.71658888888889
  },
  { names: ["کارتوزه"], country: "PL", lng: 18.2, lat: 54.333333333333336 },
  {
    names: ["بورگل", "Bürgel"],
    country: "DE",
    lng: 11.75388888888889,
    lat: 50.94138888888889
  },
  {
    names: ["چیسنادیه", "Cisnădie"],
    country: "RO",
    lng: 24.15083333333333,
    lat: 45.71277777777778
  },
  {
    names: ["سرین‌یول", "Serinyol"],
    country: "TR",
    lng: 36.2,
    lat: 36.36666666666667
  },
  {
    names: ["اسن"],
    country: "DE",
    lng: 7.013055555555556,
    lat: 51.450833333333335
  },
  {
    names: ["الوادی، الجزایر", "الوادی"],
    country: "DZ",
    lng: 7.183333333333334,
    lat: 33.455555555555556
  },
  {
    names: ["ژمرینکا", "Zhmerynka", "Жмеринка"],
    country: "UA",
    lng: 28.1,
    lat: 49.05
  },
  {
    names: ["ماناگویه", "ماناگوآ", "Santiago de Managua"],
    country: "NI",
    lng: -86.25138888888888,
    lat: 12.136388888888888
  },
  { names: ["واینهایم"], country: "DE", lng: 8.666666666666666, lat: 49.55 },
  {
    names: ["مسعد، الجزایر", "مسعد", "Messad"],
    country: "DZ",
    lng: 3.5,
    lat: 34.166666666666664
  },
  {
    names: ["ایبیسفلده-وفرلینگن"],
    country: "DE",
    lng: 10.983333333333333,
    lat: 52.43333333333333
  },
  {
    names: ["کمپ-لینتفورت", "Kamp-Lintfort"],
    country: "DE",
    lng: 6.533333333333333,
    lat: 51.5
  },
  {
    names: ["گوانگ‌ژو", "广州市"],
    country: "CN",
    lng: 113.26666666666667,
    lat: 23.133333333333333
  },
  {
    names: ["آرتموفه", "Artemove", "Артемове"],
    country: "UA",
    lng: 38.483333333333334,
    lat: 47.78333333333333
  },
  {
    names: ["سکوگهل", "Skoghall"],
    country: "SE",
    lng: 13.433333333333334,
    lat: 59.333333333333336
  },
  {
    names: ["رمدیوس (انتیوکیا)", "Remedios"],
    country: "CO",
    lng: -74.69388888888889,
    lat: 7.0275
  },
  {
    names: ["زوراک، ارمنستان", "زوراک", "Զորակ"],
    country: "AM",
    lng: 44.39194444444444,
    lat: 40.0925
  },
  {
    names: ["یسن (الشتر)"],
    country: "DE",
    lng: 12.955555555555556,
    lat: 51.791666666666664
  },
  {
    names: ["تسویزل", "Zwiesel"],
    country: "DE",
    lng: 13.233333333333333,
    lat: 49.016666666666666
  },
  {
    names: ["برستچکو", "Berestechko"],
    country: "UA",
    lng: 25.116666666666667,
    lat: 50.35
  },
  {
    names: ["کورال اسپرینگز، فلوریدا", "City of Coral Springs"],
    country: "US",
    lng: -80.25916666666667,
    lat: 26.270555555555553
  },
  {
    names: ["جکسون‌ویل، فلوریدا", "جکسون‌ویل", "City of Jacksonville"],
    country: "US",
    lng: -81.66666666666667,
    lat: 30.316666666666666
  },
  {
    names: ["لانژو", "兰州市"],
    country: "CN",
    lng: 103.8,
    lat: 36.03333333333333
  },
  {
    names: ["آکاپولکو، گویررو", "آکاپولکو", "Acapulco"],
    country: "MX",
    lng: -99.8825,
    lat: 16.863611111111112
  },
  { names: ["بولاوایو"], country: "ZW", lng: 28.58, lat: -20.17 },
  {
    names: ["ادینبرا", "Edinburgh", "Dùn Èideann"],
    country: "GB",
    lng: -3.2,
    lat: 55.95
  },
  { names: ["کویرفورت"], country: "DE", lng: 11.6, lat: 51.38333333333333 },
  {
    names: ["منگلیا", "Mangalia"],
    country: "RO",
    lng: 28.58277777777778,
    lat: 43.81722222222223
  },
  {
    names: ["هوهنمولزن"],
    country: "DE",
    lng: 12.098055555555556,
    lat: 51.156388888888884
  },
  {
    names: ["لوآندا", "Luanda", "São Paulo da Assunção de Loanda"],
    country: "AO",
    lng: 13.234444444444444,
    lat: -8.838333333333335
  },
  {
    names: ["ساگا", "Saga", "佐賀"],
    country: "JP",
    lng: 130.3,
    lat: 33.266666666666666
  },
  {
    names: ["اردورف"],
    country: "DE",
    lng: 10.732777777777779,
    lat: 50.82805555555556
  },
  {
    names: ["رس (آلمان)", "Rees"],
    country: "DE",
    lng: 6.4,
    lat: 51.766666666666666
  },
  { names: ["جمهوری دومینیکن"], lng: -70.66666666666667, lat: 19 },
  {
    names: ["ساغموساوان", "Սաղմոսավան"],
    country: "AM",
    lng: 44.39388888888889,
    lat: 40.38583333333333
  },
  {
    names: ["ماناوگات", "Manavgat"],
    country: "TR",
    lng: 31.433333333333334,
    lat: 36.78333333333333
  },
  { names: ["بافق"], lng: 55.4, lat: 31.58 },
  {
    names: ["همزباخ"],
    country: "DE",
    lng: 8.65638888888889,
    lat: 49.59027777777778
  },
  {
    names: ["تاکوما، واشینگتن", "تاکوما", "City of Tacoma"],
    country: "US",
    lng: -122.45944444444444,
    lat: 47.24138888888889
  },
  {
    names: ["برد (ارمنستان)", "برد", "Բերդ"],
    country: "AM",
    lng: 45.391666666666666,
    lat: 40.880833333333335
  },
  {
    names: ["آغتسک", "Աղձք"],
    country: "AM",
    lng: 44.25361111111111,
    lat: 40.31638888888889
  },
  {
    names: ["میانیانگ", "绵阳市"],
    country: "CN",
    lng: 104.68333333333334,
    lat: 31.466666666666665
  },
  {
    names: ["فریبورگ (اون‌اشتروت)", "Freyburg"],
    country: "DE",
    lng: 11.769722222222223,
    lat: 51.21277777777778
  },
  {
    names: ["پوکر سپاسار", "Փոքր Սեպասար"],
    country: "AM",
    lng: 43.81305555555555,
    lat: 41.03583333333333
  },
  {
    names: ["مورونی", "Mūrūnī"],
    country: "KM",
    lng: 43.255692,
    lat: -11.699307
  },
  {
    names: ["سالتییو", "Saltillo"],
    country: "MX",
    lng: -101,
    lat: 25.433333333333334
  },
  {
    names: ["کابالا (شهر)"],
    country: "TR",
    lng: 40.81666666666667,
    lat: 37.35
  },
  {
    names: ["ووسکهات، آرماویر", "ووسکهات", "Ոսկեհատ"],
    country: "AM",
    lng: 44.32916666666667,
    lat: 40.14138888888889
  },
  {
    names: ["اشتات‌اشتایناخ"],
    country: "DE",
    lng: 11.5,
    lat: 50.166666666666664
  },
  {
    names: ["ماتسویاما، اهیمه", "Matsuyama", "松山"],
    country: "JP",
    lng: 132.76666666666668,
    lat: 33.833333333333336
  },
  {
    names: ["مطای", "Matai"],
    country: "EG",
    lng: 30.75,
    lat: 28.416666666666668
  },
  {
    names: ["کیوتو", "Kyoto", "京都"],
    country: "JP",
    lng: 135.76833333333335,
    lat: 35.01166666666666
  },
  {
    names: ["زووچف"],
    country: "PL",
    lng: 18.607222222222223,
    lat: 51.414722222222224
  },
  {
    names: ["مسووویتسه"],
    country: "PL",
    lng: 19.133333333333333,
    lat: 50.233333333333334
  },
  {
    names: ["کارچوان", "Կարճևան"],
    country: "AM",
    lng: 46.178888888888885,
    lat: 38.896388888888886
  },
  {
    names: ["دزیتهانکوو", "Ձիթհանքով"],
    country: "AM",
    lng: 43.81333333333333,
    lat: 40.51555555555556
  },
  {
    names: ["فونافوتی", "Funafuti"],
    country: "TV",
    lng: 179.21666666666667,
    lat: -8.516666666666667
  },
  {
    names: ["والهو، کالیفرنیا", "والهو"],
    country: "US",
    lng: -122.23583333333333,
    lat: 38.113055555555555
  },
  {
    names: ["رگین", "Reghin", "Szászrégen"],
    country: "RO",
    lng: 24.708333333333332,
    lat: 46.77583333333333
  },
  {
    names: ["ماردین"],
    country: "TR",
    lng: 40.73777777777778,
    lat: 37.31666666666667
  },
  {
    names: ["کاوهسیونگ", "Kaohsiung", "高雄市"],
    country: "TW",
    lng: 120.26666666666667,
    lat: 22.633333333333333
  },
  {
    names: ["آرخلیا (کایوکا)", "Argelia"],
    country: "CO",
    lng: -77.2786111111111,
    lat: 2.243055555555556
  },
  {
    names: ["کاونتری", "City of Coventry"],
    country: "GB",
    lng: -1.5105555555555557,
    lat: 52.408055555555556
  },
  {
    names: ["ماولبرون"],
    country: "DE",
    lng: 8.810833333333335,
    lat: 49.000277777777775
  },
  {
    names: ["سیراکوز", "سیراکوزا", "Siracusa"],
    country: "IT",
    lng: 15.283333333333333,
    lat: 37.083333333333336
  },
  {
    names: ["بندورف در جنگل سیاه"],
    country: "DE",
    lng: 8.343055555555557,
    lat: 47.81944444444445
  },
  {
    names: ["آرتوین"],
    country: "TR",
    lng: 41.81805555555556,
    lat: 41.18333333333333
  },
  {
    names: ["نوینبورگ (انتس)"],
    country: "DE",
    lng: 8.58888888888889,
    lat: 48.846111111111114
  },
  {
    names: ["شونتیننتال"],
    country: "DE",
    lng: 10.216666666666667,
    lat: 54.266666666666666
  },
  {
    names: ["کلن", "Köln"],
    country: "DE",
    lng: 6.952777777777778,
    lat: 50.936388888888885
  },
  {
    names: ["باد اشوراتوا"],
    country: "DE",
    lng: 10.6975,
    lat: 53.919444444444444
  },
  {
    names: ["گرابو (الده)", "Grabow"],
    country: "DE",
    lng: 11.566666666666666,
    lat: 53.266666666666666
  },
  {
    names: ["اوسوایا", "اوشوآیا", "Ushuaia"],
    country: "AR",
    lng: -68.3,
    lat: -54.8
  },
  {
    names: ["بلانتایر، مالاوی", "بلانتایر"],
    country: "MW",
    lng: 35.005833333333335,
    lat: -15.786111111111111
  },
  {
    names: ["هنابرد، آرارات", "هنابرد", "Հնաբերդ"],
    country: "AM",
    lng: 44.574444444444445,
    lat: 40.005833333333335
  },
  {
    names: ["تومبا (سوید)", "Tumba"],
    country: "SE",
    lng: 17.816666666666666,
    lat: 59.2
  },
  {
    names: ["آلتزی"],
    country: "DE",
    lng: 8.116111111111111,
    lat: 49.751666666666665
  },
  {
    names: ["رسیفی", "Recife"],
    country: "BR",
    lng: -34.88333333333333,
    lat: -8.05
  },
  {
    names: ["باد نندورف"],
    country: "DE",
    lng: 9.37861111111111,
    lat: 52.33694444444445
  },
  {
    names: ["انینوآزا", "Aninoasa"],
    country: "RO",
    lng: 22.310000000000002,
    lat: 45.37861111111111
  },
  {
    names: ["برلین", "Berlin"],
    country: "DE",
    lng: 13.383333333333333,
    lat: 52.516666666666666
  },
  {
    names: ["وارداغبیور", "Վարդաղբյուր"],
    country: "AM",
    lng: 43.916666666666664,
    lat: 40.95
  },
  {
    names: ["آلن‌تاون، پنسیلوانیا"],
    country: "US",
    lng: -75.47722222222222,
    lat: 40.60166666666667
  },
  {
    names: ["ایزبیتسا کویافسکا"],
    country: "PL",
    lng: 18.760277777777777,
    lat: 52.419444444444444
  },
  { names: ["هشتپر"], lng: 48.9037, lat: 37.8008 },
  { names: ["دورفن"], country: "DE", lng: 12.15, lat: 48.266666666666666 },
  {
    names: ["رود تاون", "Road Town"],
    country: "GB",
    lng: -64.62305555555555,
    lat: 18.43138888888889
  },
  {
    names: ["کراکوف"],
    country: "PL",
    lng: 19.933333333333334,
    lat: 50.06666666666667
  },
  {
    names: ["گوانگ‌ژو", "广州市"],
    country: "CN",
    lng: 113.26666666666667,
    lat: 23.133333333333333
  },
  {
    names: ["پیاچنزا", "Piacenza"],
    country: "IT",
    lng: 9.700555555555555,
    lat: 45.047777777777775
  },
  {
    names: ["کلن (رومانی)", "Călan"],
    country: "RO",
    lng: 23.00861111111111,
    lat: 45.736111111111114
  },
  {
    names: ["کیرانتس", "Կիրանց"],
    country: "AM",
    lng: 45.10138888888889,
    lat: 41.05027777777777
  },
  {
    names: ["سنجه (سودان)", "سنجه"],
    country: "SD",
    lng: 33.93333333333333,
    lat: 13.15
  },
  {
    names: ["لوآندا", "Luanda", "São Paulo da Assunção de Loanda"],
    country: "AO",
    lng: 13.234444444444444,
    lat: -8.838333333333335
  },
  {
    names: ["سان سالوادور", "San Salvador"],
    country: "SV",
    lng: -89.19,
    lat: 13.69
  },
  {
    names: ["گتاشن", "Գտաշեն"],
    country: "AM",
    lng: 43.716944444444444,
    lat: 40.91888888888889
  },
  {
    names: ["مالا ویسکا", "Mala Vyska", "Мала Виска"],
    country: "UA",
    lng: 31.633333333333333,
    lat: 48.65
  },
  {
    names: ["کیشینیو-کری", "Chișineu-Criș"],
    country: "RO",
    lng: 21.515833333333333,
    lat: 46.5225
  },
  {
    names: ["بیرفلدن"],
    country: "DE",
    lng: 8.966666666666667,
    lat: 49.56666666666667
  },
  { names: ["روانسر"], lng: 46.6560507, lat: 34.7081228 },
  {
    names: ["آنتوفاگاستا", "Antofagasta"],
    country: "CL",
    lng: -70.4,
    lat: -23.65
  },
  {
    names: ["هاتینگن", "Hattingen"],
    country: "DE",
    lng: 7.185833333333334,
    lat: 51.399166666666666
  },
  {
    names: ["شیجیاژوانگ", "石家庄市"],
    country: "CN",
    lng: 114.48333333333333,
    lat: 38.06666666666667
  },
  {
    names: ["گرین‌بی، ویسکانسین", "گرین‌بی", "Green Bay"],
    country: "US",
    lng: -88.01583333333333,
    lat: 44.513333333333335
  },
  {
    names: ["شاختارسک", "Shakhtarsk", "Шахтарськ"],
    country: "UA",
    lng: 38.468611111111116,
    lat: 48.04694444444444
  },
  {
    names: ["اوبرمشل"],
    country: "DE",
    lng: 7.772777777777778,
    lat: 49.72694444444445
  },
  {
    names: ["کانچ", "Կանչ"],
    country: "AM",
    lng: 43.733333333333334,
    lat: 40.38333333333333
  },
  {
    names: ["لمار", "Lohmar"],
    country: "DE",
    lng: 7.216666666666667,
    lat: 50.81666666666667
  },
  {
    names: ["شاتوان", "Շատվան"],
    country: "AM",
    lng: 45.82555555555556,
    lat: 40.183055555555555
  },
  {
    names: ["کاپیاتا", "Capiatá"],
    country: "PY",
    lng: -57.419999999999995,
    lat: -25.35
  },
  {
    names: ["انتاریو، کالیفرنیا", "انتاریو"],
    country: "US",
    lng: -117.62777777777777,
    lat: 34.05277777777778
  },
  {
    names: ["آرپنی", "Արփենի"],
    country: "AM",
    lng: 43.88333333333333,
    lat: 40.916666666666664
  },
  {
    names: ["لوس ریس اکاکویلپان"],
    country: "MX",
    lng: -98.98,
    lat: 19.360555555555557
  },
  {
    names: ["واردنیس، آراگاتسوتن", "واردنیس", "Վարդենիս"],
    country: "AM",
    lng: 44.40277777777778,
    lat: 40.57166666666667
  },
  {
    names: ["اشوگه", "Eschwege"],
    country: "DE",
    lng: 10.052777777777779,
    lat: 51.18805555555555
  },
  {
    names: ["کوناکلی", "Konaklı"],
    country: "TR",
    lng: 31.883333333333333,
    lat: 36.583333333333336
  },
  {
    names: ["اشپیر"],
    country: "DE",
    lng: 8.431111111111111,
    lat: 49.31944444444445
  },
  {
    names: ["کانزاس‌سیتی، میزوری", "کانزاس سیتی", "Kansas City"],
    country: "US",
    lng: -94.5886111111111,
    lat: 39.109722222222224
  },
  {
    names: ["بیتوریا", "بیتریا", "(به اسپانیایی: Vitoria)", "باسک: Gasteiz)"],
    country: "ES",
    lng: -2.6833333333333336,
    lat: 42.85
  },
  {
    names: ["ویزلخ"],
    country: "DE",
    lng: 8.698333333333334,
    lat: 49.29416666666666
  },
  {
    names: ["داکار"],
    country: "SN",
    lng: -17.446666666666665,
    lat: 14.692777777777778
  },
  {
    names: ["کاپاکلی", "Kapaklı"],
    country: "TR",
    lng: 27.966666666666665,
    lat: 41.333333333333336
  },
  {
    names: ["اگزین"],
    country: "DE",
    lng: 14.083333333333334,
    lat: 53.68333333333333
  },
  {
    names: ["هوفینگن"],
    country: "DE",
    lng: 8.489999999999998,
    lat: 47.92611111111111
  },
  {
    names: ["هخهایم ام ماین"],
    country: "DE",
    lng: 8.35,
    lat: 50.016666666666666
  },
  {
    names: ["پونه (شهر)", "پونه"],
    country: "IN",
    lng: 73.85666666666665,
    lat: 18.52027777777778
  },
  { names: ["بنی مزار"], country: "EG", lng: 30.8, lat: 28.5 },
  { names: ["سریویتز"], country: "DE", lng: 11.65, lat: 53.583333333333336 },
  {
    names: ["ریگا", "Riga"],
    country: "LV",
    lng: 24.10638888888889,
    lat: 56.94888888888889
  },
  {
    names: ["ال سالتو"],
    country: "MX",
    lng: -103.30388888888889,
    lat: 20.853611111111114
  },
  {
    names: ["باکو", "Bakı"],
    country: "AZ",
    lng: 49.882222222222225,
    lat: 40.39527777777778
  },
  {
    names: ["وینزر، انتاریو", "وینزر", "Windsor"],
    country: "CA",
    lng: -83,
    lat: 42.28333333333333
  },
  { names: ["توفاشن", "Տուֆաշեն"], country: "AM", lng: 43.9, lat: 40.6 },
  {
    names: ["چارلستون، کارولینای جنوبی", "City of Charleston"],
    country: "US",
    lng: -79.93333333333334,
    lat: 32.78333333333333
  },
  {
    names: ["لکسند", "Leksand"],
    country: "SE",
    lng: 15,
    lat: 60.733333333333334
  },
  {
    names: ["بیزوایلر", "Baesweiler"],
    country: "DE",
    lng: 6.183333333333334,
    lat: 50.9
  },
  { names: ["مدیین"], country: "CO", lng: -75.5751361111111, lat: 6.235925 },
  {
    names: ["چنای", "Chennai", "مَدرَس"],
    country: "IN",
    lng: 80.27,
    lat: 13.08388888888889
  },
  {
    names: ["سیاتل، واشینگتن", "سیاتل", "Seattle"],
    country: "US",
    lng: -122.33305555555555,
    lat: 47.609722222222224
  },
  {
    names: ["آلتنبرگ (زاکسن)", "Altenberg"],
    country: "DE",
    lng: 13.757777777777777,
    lat: 50.76444444444444
  },
  {
    names: ["نوک (گرینلند)", "نوک"],
    country: "GL",
    lng: -51.733333333333334,
    lat: 65.2
  },
  {
    names: ["کریستورو سکوییسک", "Cristuru Secuiesc", "Székelykeresztúr"],
    country: "RO",
    lng: 25.03527777777778,
    lat: 46.291666666666664
  },
  {
    names: ["مسباخ"],
    country: "DE",
    lng: 9.146666666666667,
    lat: 49.352222222222224
  },
  { names: ["جبل‌الطارق"], lng: -5.35, lat: 36.13333333333333 },
  {
    names: ["گوغت", "Գողթ"],
    country: "AM",
    lng: 44.779444444444444,
    lat: 40.13944444444444
  },
  {
    names: ["چیفنگ", "赤峰市 · ᠤᠯᠠᠭᠠᠨᠬᠠᠳᠠᠬᠣᠲᠠ"],
    country: "CN",
    lng: 118.88333333333334,
    lat: 42.25
  },
  {
    names: ["ریو دو ژانیرو"],
    lng: -43.19638888888888,
    lat: -22.90833333333333
  },
  {
    names: ["کاپس", "Կապս"],
    country: "AM",
    lng: 43.71666666666667,
    lat: 40.86666666666667
  },
  {
    names: ["برول (راینلند)", "Brühl"],
    country: "DE",
    lng: 6.9,
    lat: 50.833333333333336
  },
  {
    names: ["شاهومیان، آرارات", "شاهومیان", "Շահումյան"],
    country: "AM",
    lng: 44.57833333333333,
    lat: 39.93083333333333
  },
  {
    names: ["موریوکا، ایواته", "Morioka", "盛岡"],
    country: "JP",
    lng: 141.15,
    lat: 39.68333333333333
  },
  {
    names: ["میهایلشت", "Mihăileşti"],
    country: "RO",
    lng: 25.9,
    lat: 44.31666666666667
  },
  {
    names: ["آنتاراشات", "Անտառաշատ"],
    country: "AM",
    lng: 46.32916666666667,
    lat: 39.30027777777777
  },
  {
    names: ["پریرا (کلمبیا)", "Pereira"],
    country: "CO",
    lng: -75.69455833333333,
    lat: 4.814277777777778
  },
  {
    names: ["آشوتاوان", "Աշոտավան"],
    country: "AM",
    lng: 45.99777777777778,
    lat: 39.47638888888889
  },
  {
    names: ["زارا (ترکیه)", "زارا"],
    country: "TR",
    lng: 37.753055555555555,
    lat: 39.894999999999996
  },
  { names: ["اشمون"], country: "EG", lng: 31.034203, lat: 30.294054 },
  { names: ["لاوتراشتاین"], country: "DE", lng: 9.861388888888888, lat: 48.71 },
  {
    names: ["ویپرفورث", "Wipperfürth"],
    country: "DE",
    lng: 7.4,
    lat: 51.11666666666667
  },
  {
    names: ["انویگادو", "Envigado"],
    country: "CO",
    lng: -75.58027777777778,
    lat: 6.171944444444445
  },
  {
    names: ["گیزتاخت"],
    country: "DE",
    lng: 10.366666666666667,
    lat: 53.43333333333333
  },
  { names: ["لیبرویل", "Libreville"], country: "GA", lng: 9.45, lat: 0.39 },
  {
    names: ["سکوچخوآره", "Skutskär"],
    country: "SE",
    lng: 17.416666666666668,
    lat: 60.63333333333333
  },
  {
    names: ["انینگن (دانوب)"],
    country: "DE",
    lng: 9.723611111111111,
    lat: 48.28333333333333
  },
  {
    names: ["ریزا"],
    country: "DE",
    lng: 13.293888888888889,
    lat: 51.308055555555555
  },
  {
    names: ["آگاراک، آراگاتسوتن", "آگاراک", "Ագարակ"],
    country: "AM",
    lng: 44.278888888888886,
    lat: 40.302499999999995
  },
  {
    names: ["لیلونگوه", "Lilongwe"],
    country: "MW",
    lng: 33.78333333333333,
    lat: -13.983333333333333
  },
  {
    names: ["ویلمینگتن، کارولینای شمالی", "Wilmington, North Carolina"],
    country: "US",
    lng: -77.91222222222223,
    lat: 34.223333333333336
  },
  {
    names: ["گرویچ"],
    country: "DE",
    lng: 12.280555555555557,
    lat: 51.15555555555555
  },
  { names: ["لانگلزهایم"], country: "DE", lng: 10.335, lat: 51.93805555555555 },
  { names: ["صالحیه (بهارستان)"], lng: 51.1833, lat: 35.5167 },
  {
    names: ["گردن (نیدرزاکسن)"],
    country: "DE",
    lng: 9.600277777777777,
    lat: 52.31166666666666
  },
  {
    names: ["چینگ‌دایو", "青岛市"],
    country: "CN",
    lng: 120.38333333333334,
    lat: 36.06666666666667
  },
  {
    names: ["نلسون، نیوزلند", "Whakatū"],
    country: "NZ",
    lng: 173.2838888888889,
    lat: -41.270833333333336
  },
  {
    names: ["گاندزاکار", "Գանձաքար"],
    country: "AM",
    lng: 45.16305555555555,
    lat: 40.84
  },
  {
    names: ["کیرشبرگ (هونزروک)", "Kirchberg"],
    country: "DE",
    lng: 7.407222222222223,
    lat: 49.94499999999999
  },
  {
    names: ["آیگپار", "Այգեպար"],
    country: "AM",
    lng: 45.46222222222222,
    lat: 40.94194444444444
  },
  {
    names: ["مودستو، کالیفرنیا", "مودستو"],
    country: "US",
    lng: -120.99444444444444,
    lat: 37.66138888888889
  },
  {
    names: ["سوکار، تاووش", "سِوکار", "Սևքար"],
    country: "AM",
    lng: 45.1425,
    lat: 41.01972222222222
  },
  {
    names: ["ناپرویل، ایلینوی"],
    country: "US",
    lng: -88.16555555555556,
    lat: 41.74805555555556
  },
  { names: ["بندر لنگه"], lng: 54.8808, lat: 26.5561 },
  {
    names: ["پوابلو، کلرادو"],
    country: "US",
    lng: -104.62027777777777,
    lat: 38.26694444444444
  },
  {
    names: ["آغاوناتون", "Աղավնատուն"],
    country: "AM",
    lng: 44.25138888888889,
    lat: 40.233333333333334
  },
  {
    names: ["لاگاو، ارتزگبیرگه"],
    country: "DE",
    lng: 12.746388888888887,
    lat: 50.73833333333334
  },
  {
    names: [
      "سانتا کروس د لا سیرا (بولیوی)",
      "سانتا کروس د لا سیرا",
      "Santa Cruz de la Sierra"
    ],
    country: "BO",
    lng: -63.166666666666664,
    lat: -17.8
  },
  {
    names: ["تل‌آویو", "תל אביב-יפו (عبری )", "تل اَبیب-یافا (عربی )"],
    country: "IL",
    lng: 34.78333333333333,
    lat: 32.06666666666667
  },
  {
    names: ["رینتلن"],
    country: "DE",
    lng: 9.081388888888888,
    lat: 52.190555555555555
  },
  {
    names: ["تگرنزی", "Tegernsee"],
    country: "DE",
    lng: 11.766666666666667,
    lat: 47.7
  },
  {
    names: ["آودیییفکا", "Avdiivka", "Авдіївка"],
    country: "UA",
    lng: 37.745,
    lat: 48.14527777777778
  },
  {
    names: ["بیلیاییفکا", "Bilyayivka", "Біляївка"],
    country: "UA",
    lng: 30.20138888888889,
    lat: 46.48275
  },
  {
    names: ["دبتاوان", "Դեբետավան"],
    country: "AM",
    lng: 44.85,
    lat: 41.233333333333334
  },
  {
    names: ["آرمنیا (کیندیو)", "Armenia"],
    country: "CO",
    lng: -75.70416666666667,
    lat: 4.528611111111111
  },
  {
    names: ["فافنهوفن آن در ایلم", "Pfaffenhofen a.d.Ilm"],
    country: "DE",
    lng: 11.516666666666667,
    lat: 48.53333333333333
  },
  {
    names: ["کلدا"],
    country: "DE",
    lng: 11.216666666666667,
    lat: 51.166666666666664
  },
  {
    names: ["اشتاوفنبرگ (هسن)", "Staufenberg"],
    country: "DE",
    lng: 8.716666666666667,
    lat: 50.666666666666664
  },
  {
    names: ["بوگا (بایه دل کایوکا)", "بوگا"],
    country: "CO",
    lng: -76.3,
    lat: 3.9
  },
  {
    names: ["کیپ‌تاون", "Kaapstad, iKapa", "Cape Town"],
    country: "ZA",
    lng: 18.42388888888889,
    lat: -33.92527777777777
  },
  { names: ["بوغازلیان", "Boğazlıyan"], country: "TR", lng: 35.25, lat: 39.2 },
  {
    names: ["برازاویل", "Brazzaville"],
    country: "CG",
    lng: 15.291944444444445,
    lat: -4.267777777777778
  },
  {
    names: ["بیسمارک (آلتمارک)", "Bismark"],
    country: "DE",
    lng: 11.55,
    lat: 52.666666666666664
  },
  {
    names: ["لودو", "Luduș", "Marosludas"],
    country: "RO",
    lng: 24.09611111111111,
    lat: 46.47777777777778
  },
  {
    names: ["چینه (شهر)", "Çine"],
    country: "TR",
    lng: 28.06138888888889,
    lat: 37.611666666666665
  },
  { names: ["نوی-اولم"], country: "DE", lng: 10, lat: 48.38333333333333 },
  {
    names: ["کی وست، فلوریدا", "Key West, Florida"],
    country: "US",
    lng: -81.78403055555556,
    lat: 24.559166666666666
  },
  {
    names: ["هاتساوان، کوتایک", "هاتساوان", "Հացավան"],
    country: "AM",
    lng: 44.65222222222222,
    lat: 40.13777777777778
  },
  {
    names: ["پوساداس", "Posadas"],
    country: "AR",
    lng: -55.88333333333333,
    lat: -27.366666666666667
  },
  {
    names: ["فاگستا"],
    country: "SE",
    lng: 15.793333333333333,
    lat: 60.00416666666667
  },
  { names: ["میبد"], lng: 54, lat: 31.2167 },
  {
    names: ["گورگن‌تپه", "Gürgentepe"],
    country: "TR",
    lng: 37.6,
    lat: 40.78333333333333
  },
  {
    names: ["رجو کالابریا"],
    country: "IT",
    lng: 15.661944444444444,
    lat: 38.11138888888889
  },
  {
    names: ["لانگن (بای برمرهافن)", "Langen"],
    country: "DE",
    lng: 8.583333333333334,
    lat: 53.61666666666667
  },
  {
    names: ["تراپانی", "Trapani"],
    country: "IT",
    lng: 12.516666666666667,
    lat: 38.016666666666666
  },
  {
    names: ["پریلوکی", "Pryluky", "Прилуки"],
    country: "UA",
    lng: 32.4,
    lat: 50.6
  },
  {
    names: ["تسیتا"],
    country: "DE",
    lng: 14.807222222222222,
    lat: 50.89611111111111
  },
  { names: ["تهواکان"], country: "MX", lng: -97.38333333333334, lat: 18.45 },
  {
    names: ["هام", "Hamm"],
    country: "DE",
    lng: 7.820277777777777,
    lat: 51.6825
  },
  {
    names: ["آنکارا"],
    country: "TR",
    lng: 32.86666666666667,
    lat: 39.86666666666667
  },
  {
    names: ["گلدرن", "Geldern"],
    country: "DE",
    lng: 6.3325,
    lat: 51.51972222222222
  },
  {
    names: ["آراووس", "Արավուս"],
    country: "AM",
    lng: 46.467222222222226,
    lat: 39.562777777777775
  },
  { names: ["فومن"], lng: 49.3125, lat: 37.2239 },
  { names: ["بندرعباس"], lng: 56.2766, lat: 27.1883 },
  {
    names: ["شارلوت آمالی", "Charlotte Amalie"],
    country: "",
    lng: -64.95,
    lat: 18.35
  },
  {
    names: ["بولدر، کلرادو", "بولدر"],
    country: "US",
    lng: -105.29277777777777,
    lat: 40.019444444444446
  },
  {
    names: ["ریاض (کفر الشیخ)", "الریاض"],
    country: "EG",
    lng: 30.945347,
    lat: 31.236546
  },
  {
    names: ["اگوا دو دایوز", "Agua de Dios"],
    country: "CO",
    lng: -74.6738888888889,
    lat: 4.378055555555555
  },
  {
    names: ["جراربی", "Ջրարբի"],
    country: "AM",
    lng: 44.233333333333334,
    lat: 40.09166666666667
  },
  {
    names: ["هازلونه"],
    country: "DE",
    lng: 7.466666666666667,
    lat: 52.666666666666664
  },
  {
    names: ["وایسواسر", "Weißwasser"],
    country: "DE",
    lng: 14.633333333333333,
    lat: 51.5
  },
  {
    names: ["اورگوو", "Օրգով"],
    country: "AM",
    lng: 44.2525,
    lat: 40.34777777777778
  },
  { names: ["ایچنیا", "Ichnia", "Ічня"], country: "UA", lng: 32.4, lat: 50.85 },
  {
    names: ["سیدی بلعباس، الجزایر", "سیدی بلعباس"],
    country: "DZ",
    lng: 0.6333333333333333,
    lat: 35.2
  },
  {
    names: ["کویایما", "Coyaima"],
    country: "CO",
    lng: -75.08333333333333,
    lat: 3.8333333333333335
  },
  {
    names: ["پرشوتراونسک", "Першотравенськ"],
    country: "UA",
    lng: 36.401666666666664,
    lat: 48.347500000000004
  },
  { names: ["بم"], lng: 58.34427, lat: 29.10118 },
  {
    names: ["نوگالس، سونورا"],
    country: "MX",
    lng: -110.94583333333334,
    lat: 31.31861111111111
  },
  {
    names: ["ایندیاناپلیس", "ایندیاناپولیس، ایندیانا"],
    country: "US",
    lng: -86,
    lat: 39
  },
  { names: ["ایپهوفن"], country: "DE", lng: 10.266666666666667, lat: 49.7 },
  {
    names: ["آگاراک، لوری", "آگاراک", "Ագարակ"],
    country: "AM",
    lng: 44.4675,
    lat: 41.010555555555555
  },
  {
    names: ["کاراگلوخ", "Քարագլուխ"],
    country: "AM",
    lng: 45.26888888888889,
    lat: 39.89555555555555
  },
  {
    names: ["نیوپورت نیوز، ویرجینیا", "Newport News, Virginia"],
    country: "US",
    lng: -76.48444444444445,
    lat: 37.07083333333334
  },
  {
    names: ["والنسیا", "(به اسپانیایی: Valencia)"],
    country: "ES",
    lng: -0.38333333333333336,
    lat: 39.46666666666667
  },
  {
    names: ["افیون قره‌حصار"],
    country: "TR",
    lng: 30.538666666666668,
    lat: 38.758
  },
  { names: ["ویک آوف فور"], country: "DE", lng: 8.566666666666666, lat: 54.7 },
  {
    names: ["الریش"],
    country: "DE",
    lng: 10.668055555555554,
    lat: 51.58555555555556
  },
  {
    names: ["پترلاجل", "Pătârlagele"],
    country: "RO",
    lng: 26.359722222222224,
    lat: 45.31888888888889
  },
  {
    names: ["باد آرولزن", "Bad Arolsen"],
    country: "DE",
    lng: 9.016666666666667,
    lat: 51.36666666666667
  },
  {
    names: ["ماتسویه", "Matsue", "松江"],
    country: "JP",
    lng: 133.05,
    lat: 35.46666666666667
  },
  {
    names: ["پیوریا، ایلینوی"],
    country: "US",
    lng: -89.60944444444443,
    lat: 40.72083333333334
  },
  { names: ["ماینتال"], country: "DE", lng: 8.833333333333334, lat: 50.15 },
  {
    names: ["سیوداد دل استه", "Ciudad del Este"],
    country: "PY",
    lng: -54.61666666666667,
    lat: -25.516666666666666
  },
  {
    names: ["یوردانوو"],
    country: "PL",
    lng: 19.833333333333332,
    lat: 49.666666666666664
  },
  { names: ["بلکده"], lng: 49.890475, lat: 37.330883 },
  { names: ["گرسرشن"], country: "DE", lng: 14, lat: 51.58305555555556 },
  { names: ["اوچامچیرا", "ოჩამჩირე"], country: "GE", lng: 41.45, lat: 42.7 },
  { names: ["برکا/ورا"], country: "DE", lng: 10.07, lat: 50.93944444444444 },
  {
    names: ["صنعا", "صنعاء", "Sanaa"],
    country: "YE",
    lng: 44.20638888888889,
    lat: 15.348333333333334
  },
  {
    names: ["لوساکا", "Lusaka"],
    country: "ZM",
    lng: 28.283333333333335,
    lat: -15.416666666666666
  },
  { names: ["کمال‌شهر", "کمال‌آباد"], lng: 50.873888, lat: 35.860277 },
  {
    names: ["واهان، ارمنستان", "واهان", "Վահան"],
    country: "AM",
    lng: 45.39888888888889,
    lat: 40.57555555555556
  },
  {
    names: ["اوساکا", "大阪市"],
    country: "JP",
    lng: 135.50222222222223,
    lat: 34.693888888888885
  },
  {
    names: ["کانزاس‌سیتی، میزوری", "کانزاس سیتی", "Kansas City"],
    country: "US",
    lng: -94.5886111111111,
    lat: 39.109722222222224
  },
  {
    names: ["فلادونگ"],
    country: "DE",
    lng: 10.145277777777777,
    lat: 50.52111111111111
  },
  {
    names: ["لوتسک", "Луцьк"],
    country: "UA",
    lng: 25.335833333333333,
    lat: 50.75
  },
  { names: ["گوکچه"], country: "TR", lng: 40.7, lat: 37.2 },
  {
    names: ["نوی‌اشتات آن در والدناب", "Neustadt a.d.Waldnaab"],
    country: "DE",
    lng: 12.1707,
    lat: 49.73082
  },
  { names: ["نی‌ریز"], lng: 54.2, lat: 29.12 },
  {
    names: ["ورتا (وستفالن)", "Werther (Westf.)"],
    country: "DE",
    lng: 8.416666666666666,
    lat: 52.06666666666667
  },
  {
    names: ["افنباخ آم ماین", "Offenbach"],
    country: "DE",
    lng: 8.8,
    lat: 50.1
  },
  {
    names: ["کمناث"],
    country: "DE",
    lng: 11.883333333333333,
    lat: 49.86666666666667
  },
  {
    names: ["سدار راپیدز، آیووا", "سدار راپیدز", "Cedar Rapids"],
    country: "US",
    lng: -91.66861111111112,
    lat: 41.98305555555556
  },
  {
    names: ["ینکه", "Ianca"],
    country: "RO",
    lng: 27.47472222222222,
    lat: 45.135
  },
  {
    names: ["هتینگن"],
    country: "DE",
    lng: 9.231388888888889,
    lat: 48.21611111111111
  },
  {
    names: ["دونگوان", "دونگ گوان (دونگوان)", "东莞"],
    country: "CN",
    lng: 113.71666666666667,
    lat: 23.033333333333335
  },
  {
    names: ["آگاراک، سیونیک", "آگاراک", "Ագարակ"],
    country: "AM",
    lng: 46.2,
    lat: 38.86666666666667
  },
  { names: ["کاپان"], country: "AM", lng: 46.415, lat: 39.20111111111111 },
  { names: ["ابرسباخ نویگرسدورف"], country: "DE", lng: 14.6, lat: 51 },
  {
    names: [
      "داوایو سیتی",
      "(به سینوگبانونی: Dakbayan sa Dabaw)",
      "(به تاگالوگ: Lungsod ng Dabaw)"
    ],
    country: "PH",
    lng: 125.60777777777777,
    lat: 7.064444444444444
  },
  {
    names: ["جکسون‌ویل، فلوریدا", "جکسون‌ویل", "City of Jacksonville"],
    country: "US",
    lng: -81.66666666666667,
    lat: 30.316666666666666
  },
  { names: ["آنکلام"], country: "DE", lng: 13.683333333333334, lat: 53.85 },
  {
    names: ["هانیشن (زاکسن)", "Hainichen"],
    country: "DE",
    lng: 13.125277777777779,
    lat: 50.969722222222224
  },
  {
    names: ["بولدشت-سکیه", "Boldeşti-Scăeni"],
    country: "RO",
    lng: 26.029999999999998,
    lat: 45.03
  },
  {
    names: ["ویتنبرگ", "Lutherstadt Wittenberg"],
    country: "DE",
    lng: 12.65,
    lat: 51.86666666666667
  },
  {
    names: ["میتو، ایباراکی", "Mito", "水戸"],
    country: "JP",
    lng: 140.46666666666667,
    lat: 36.36666666666667
  },
  {
    names: ["یوهانگیورگن‌اشتات"],
    country: "DE",
    lng: 12.713888888888889,
    lat: 50.43333333333333
  },
  {
    names: ["ویا الیسا", "Villa Elisa"],
    country: "PY",
    lng: -57.572500000000005,
    lat: -25.5075
  },
  { names: ["فولونیکا"], country: "IT", lng: 10.761877777777778, lat: 42.9191 },
  { names: ["شیلداو"], country: "DE", lng: 12.933333333333334, lat: 51.45 },
  {
    names: ["باد آیبلینگ"],
    country: "DE",
    lng: 12.016666666666667,
    lat: 47.86666666666667
  },
  { names: ["دبی"], country: "AE", lng: 55.333333333333336, lat: 24.95 },
  { names: ["واسا"], country: "FI", lng: 21.616666666666667, lat: 63.1 },
  {
    names: ["آماسیا، آرماویر", "آماسیا", "Ամասիա"],
    country: "AM",
    lng: 43.96666666666667,
    lat: 40.083333333333336
  },
  {
    names: ["چیلون"],
    country: "MX",
    lng: -92.28333333333333,
    lat: 17.116666666666667
  },
  { names: ["اماگا", "Amagá"], country: "CO", lng: -75.7, lat: 6.05 },
  { names: ["ویشوگرود"], country: "PL", lng: 20.2, lat: 52.38333333333333 },
  {
    names: ["بافرا", "Bafra"],
    country: "TR",
    lng: 35.9,
    lat: 41.56666666666667
  },
  {
    names: ["میزباخ"],
    country: "DE",
    lng: 11.833333333333334,
    lat: 47.78333333333333
  },
  {
    names: ["ساروهان‌لی", "Saruhanlı"],
    country: "TR",
    lng: 27.566666666666666,
    lat: 38.733333333333334
  },
  {
    names: ["اوستر", "Oster", "Остер"],
    country: "UA",
    lng: 30.88111111111111,
    lat: 50.948611111111106
  },
  {
    names: ["هایمزهایم"],
    country: "DE",
    lng: 8.861944444444443,
    lat: 48.80555555555555
  },
  {
    names: [
      "براشوو",
      "(به رومانیایی: Braşov)",
      "(به آلمانی: Kronstadt)",
      "(به مجاری: Brassó)",
      "(به لاتین: Brassovia یا Corona)"
    ],
    country: "RO",
    lng: 25.616666666666667,
    lat: 45.666666666666664
  },
  { names: ["کاسل"], country: "DE", lng: 9.5, lat: 51.31666666666667 },
  { names: ["بیلا"], country: "EG", lng: 31.220434, lat: 31.174659 },
  {
    names: ["مونته‌ویدیو", "Montevideo"],
    country: "UY",
    lng: -56.18194444444444,
    lat: -34.88361111111111
  },
  { names: ["ساوه"], lng: 50.22, lat: 35.01 },
  {
    names: ["آرتابوینک", "Արտաբույնք"],
    country: "AM",
    lng: 45.36138888888889,
    lat: 39.85888888888889
  },
  {
    names: ["هویباخ (وورتمبرگ)", "Heubach"],
    country: "DE",
    lng: 9.933333333333334,
    lat: 48.78805555555555
  },
  {
    names: ["فرافره", "Farafra"],
    country: "EG",
    lng: 27.97,
    lat: 27.058333333333334
  },
  { names: ["دیمل‌اشتات"], country: "DE", lng: 8.98, lat: 51.46 },
  {
    names: ["هویدی", "Huedin", "Bánffyhunyad"],
    country: "RO",
    lng: 23.029999999999998,
    lat: 46.87
  },
  {
    names: ["بورلنیه", "Borlänge"],
    country: "SE",
    lng: 15.436388888888889,
    lat: 60.48555555555556
  },
  { names: ["ژوری"], country: "PL", lng: 18.7, lat: 50.05 },
  { names: ["محمدشهر", "محمدآباد"], lng: 50.7883, lat: 35.7219 },
  {
    names: ["کروپیونیسکی", "Кіровогра́д"],
    country: "UA",
    lng: 32.266666666666666,
    lat: 48.5
  },
  { names: ["کاله‌رد", "Kållered"], country: "SE", lng: 12.05, lat: 57.6 },
  {
    names: ["گغادیر", "Գեղադիր"],
    country: "AM",
    lng: 44.10722222222223,
    lat: 40.65888888888889
  },
  {
    names: ["تاراپوتو", "Tarapoto"],
    country: "PE",
    lng: -76.36666666666666,
    lat: -6.483333333333333
  },
  {
    names: ["برویل"],
    country: "DE",
    lng: 11.716666666666667,
    lat: 53.71666666666667
  },
  {
    names: ["سیتکا، آلاسکا", "City and Borough of Sitka"],
    country: "US",
    lng: -135.3386416666667,
    lat: 57.051561111111106
  },
  { names: ["ورل", "Werl"], country: "DE", lng: 7.92, lat: 51.55 },
  {
    names: ["لا وگا (کایوکا)", "La Vega"],
    country: "CO",
    lng: -76.77777777777777,
    lat: 2.0008333333333335
  },
  {
    names: ["رحمانیه (استان بحیره)", "الرحمانیه"],
    country: "EG",
    lng: 30.633731,
    lat: 31.106155
  },
  {
    names: ["آق‌سرای"],
    country: "TR",
    lng: 34.03333333333333,
    lat: 38.36666666666667
  },
  {
    names: ["اگنفلدن"],
    country: "DE",
    lng: 12.764166666666666,
    lat: 48.403888888888886
  },
  {
    names: ["رانیس"],
    country: "DE",
    lng: 11.568055555555555,
    lat: 50.663888888888884
  },
  {
    names: ["گوایاکیل", "گوای‌اکیل", "Santiago de Guayaquil"],
    country: "EC",
    lng: -79.88333333333334,
    lat: -2.183333333333333
  },
  {
    names: ["باتیکالوا", "மட்டக்களப்பு", "මඩකලපුව"],
    country: "LK",
    lng: 81.7,
    lat: 7.716666666666667
  },
  {
    names: ["ژیبو", "Jibou"],
    country: "RO",
    lng: 23.258333333333333,
    lat: 47.25833333333333
  },
  {
    names: ["پینار دل ریو", "Pinar del Río"],
    country: "CU",
    lng: -83.67194444444445,
    lat: 22.41222222222222
  },
  { names: ["اونکل"], country: "DE", lng: 7.215, lat: 50.600833333333334 },
  {
    names: ["شیفراشتات", "Schifferstadt"],
    country: "DE",
    lng: 8.366666666666667,
    lat: 49.38333333333333
  },
  {
    names: ["ونسان", "원산시"],
    country: "KP",
    lng: 127.44611111111111,
    lat: 39.1475
  },
  { names: ["بروخزال"], country: "DE", lng: 8.6, lat: 49.13333333333333 },
  {
    names: ["وارزه", "Varese"],
    country: "IT",
    lng: 8.833333333333334,
    lat: 45.81666666666667
  },
  {
    names: ["اشتراوسبرگ", "Strausberg"],
    country: "DE",
    lng: 13.883333333333333,
    lat: 52.583333333333336
  },
  {
    names: ["کمپتن ایم آلگوی", "Kempten"],
    country: "DE",
    lng: 10.316666666666666,
    lat: 47.733333333333334
  },
  { names: ["هیلدس‌هایم"], country: "DE", lng: 9.95, lat: 52.15 },
  {
    names: ["انوگو", "Énugwú"],
    country: "NG",
    lng: 7.5103333333333335,
    lat: 6.4526666666666666
  },
  {
    names: ["شیامن", "厦门市"],
    country: "CN",
    lng: 118.08941944444445,
    lat: 24.47983611111111
  },
  {
    names: ["کتسنیا"],
    country: "PL",
    lng: 17.484444444444446,
    lat: 52.99194444444444
  },
  {
    names: ["الیزابت، نیوجرسی", "Elizabeth, New Jersey"],
    country: "US",
    lng: -74.19353,
    lat: 40.666261
  },
  {
    names: ["باندیوان", "Բանդիվան"],
    country: "AM",
    lng: 43.80305555555555,
    lat: 40.95611111111111
  },
  {
    names: ["اورتاجه", "Ortaca"],
    country: "TR",
    lng: 28.764444444444443,
    lat: 36.83888888888889
  },
  {
    names: ["میرکورا نیرژولو", "Miercurea Nirajului", "Nyárádszereda"],
    country: "RO",
    lng: 24.8,
    lat: 46.53
  },
  {
    names: ["کانو، نیجریه", "Kano"],
    country: "NG",
    lng: 8.516666666666667,
    lat: 12
  },
  {
    names: ["لانگ فنگ", "廊坊市"],
    country: "CN",
    lng: 116.7,
    lat: 39.516666666666666
  },
  {
    names: ["ورخنودنیپروفسک", "Верхньодніпровськ"],
    country: "UA",
    lng: 34.32833333333333,
    lat: 48.65611111111111
  },
  { names: ["ترلیو", "Trelew"], country: "AR", lng: -65.3, lat: -43.25 },
  {
    names: ["نور گغی", "Նոր Գեղի"],
    country: "AM",
    lng: 44.57972222222222,
    lat: 40.321111111111115
  },
  {
    names: ["زلتاو", "Soltau"],
    country: "DE",
    lng: 9.833333333333334,
    lat: 52.983333333333334
  },
  {
    names: ["آکایا", "Akaa", "Ackas"],
    country: "FI",
    lng: 23.866666666666667,
    lat: 61.166666666666664
  },
  {
    names: ["آناهایم، کالیفرنیا", "آناهایم", "Anaheim"],
    country: "US",
    lng: -117.88972222222223,
    lat: 33.836111111111116
  },
  {
    names: ["گوغتانیک", "Գողթանիկ"],
    country: "AM",
    lng: 45.471944444444446,
    lat: 39.867222222222225
  },
  {
    names: ["موانزا", "انیانزا"],
    country: "TZ",
    lng: 32.9,
    lat: -2.5166666666666666
  },
  {
    names: ["تساغکاشن، آراگاتسوتن", "تساغکاشن", "Ծաղկաշեն"],
    country: "AM",
    lng: 44.349722222222226,
    lat: 40.50805555555556
  },
  {
    names: ["کنتسینگن"],
    country: "DE",
    lng: 7.7683333333333335,
    lat: 48.19166666666666
  },
  { names: ["فردوس"], lng: 58.172, lat: 34.018 },
  {
    names: ["فرشن", "Frechen"],
    country: "DE",
    lng: 6.816666666666666,
    lat: 50.916666666666664
  },
  {
    names: ["جامشلو", "Ջամշլու"],
    country: "AM",
    lng: 44.27361111111111,
    lat: 40.690555555555555
  },
  {
    names: ["تربسن (مولده)"],
    country: "DE",
    lng: 12.75,
    lat: 51.283055555555556
  },
  {
    names: ["هراره", "Harare", "Salisbury"],
    country: "ZW",
    lng: 31.029722222222222,
    lat: -17.86388888888889
  },
  {
    names: ["اتربورگ"],
    country: "DE",
    lng: 7.771111111111111,
    lat: 49.504444444444445
  },
  {
    names: ["زلیو", "Zalău"],
    country: "RO",
    lng: 23.05,
    lat: 47.18333333333333
  },
  {
    names: ["کوینکا", "(به اسپانیایی: Cuenca)"],
    country: "ES",
    lng: -2.15,
    lat: 40.06666666666667
  },
  {
    names: ["کوبلنتس"],
    country: "DE",
    lng: 7.597777777777777,
    lat: 50.359722222222224
  },
  {
    names: ["کویدلیندبورگ"],
    country: "DE",
    lng: 11.147222222222222,
    lat: 51.791666666666664
  },
  {
    names: ["باغرامیان، واغارشاپات", "باغرامیان", "Բաղրամյանի"],
    country: "AM",
    lng: 44.368611111111115,
    lat: 40.19333333333333
  },
  {
    names: ["هیروشیما", "Hiroshima", "広島"],
    country: "JP",
    lng: 132.45527777777778,
    lat: 34.38527777777778
  },
  {
    names: ["دیزنباخ"],
    country: "DE",
    lng: 8.783333333333333,
    lat: 50.016666666666666
  },
  {
    names: ["سویا (سوید)", "Sävja"],
    country: "SE",
    lng: 17.7,
    lat: 59.81666666666667
  },
  {
    names: ["نمیریو", "Nemyriv", "Немирів"],
    country: "UA",
    lng: 28.85,
    lat: 48.96666666666667
  },
  {
    names: ["بورگ‌هاوزن، التوتیگ", "Burghausen"],
    country: "DE",
    lng: 12.833333333333334,
    lat: 48.166666666666664
  },
  {
    names: ["آلبورگ", "Aalborg"],
    country: "DK",
    lng: 9.916666666666666,
    lat: 57.05
  },
  {
    names: ["کاراشامب", "Karashamb", "Քարաշամբ"],
    country: "AM",
    lng: 44.57638888888889,
    lat: 40.405
  },
  {
    names: ["آنتیوچ، کالیفرنیا", "آنتیوچ"],
    country: "US",
    lng: -121.80583333333333,
    lat: 38.005
  },
  { names: ["هاولبرگ"], country: "DE", lng: 12.074444444444444, lat: 52.825 },
  {
    names: ["گرمنجیک", "Germencik"],
    country: "TR",
    lng: 27.605833333333333,
    lat: 37.86972222222222
  },
  {
    names: ["گرب‌اشتت"],
    country: "DE",
    lng: 11.616666666666667,
    lat: 51.63305555555556
  },
  {
    names: ["وایربورگ آن در این", "Wasserburg a.Inn"],
    country: "DE",
    lng: 12.233333333333333,
    lat: 48.06166666666667
  },
  {
    names: ["هیوارد، کالیفرنیا", "هِی‌واُرد", "Hayward"],
    country: "US",
    lng: -122.08083333333333,
    lat: 37.66888888888889
  },
  {
    names: ["موریتا، کالیفرنیا", "City of Murrieta"],
    country: "US",
    lng: -117.2025,
    lat: 33.56944444444445
  },
  {
    names: ["گلدنباخ"],
    country: "DE",
    lng: 8.582777777777778,
    lat: 50.768055555555556
  },
  {
    names: ["پترولینا"],
    country: "BR",
    lng: -40.507777777777775,
    lat: -9.392777777777777
  },
  {
    names: ["منزله (استان دقهلیه)", "منزله", "المنزله"],
    country: "EG",
    lng: 32.2,
    lat: 31.2
  },
  {
    names: ["کوتایک (روستا)", "کوتایک", "Կոտայք"],
    country: "AM",
    lng: 44.660555555555554,
    lat: 40.275
  },
  { names: ["زرین‌شهر", "لنجان (ریز)"], lng: 51.3883, lat: 32.3967 },
  { names: ["پوزنان"], country: "PL", lng: 16.916666666666668, lat: 52.4 },
  {
    names: ["زینکیو", "Zinkiv", "Зіньків"],
    country: "UA",
    lng: 34.35,
    lat: 50.2
  },
  {
    names: ["اوربرو", "Örebro"],
    country: "SE",
    lng: 15.2075,
    lat: 59.27388888888889
  },
  {
    names: ["دیز، آلمان"],
    country: "DE",
    lng: 8.015833333333333,
    lat: 50.37083333333334
  },
  {
    names: ["اشتات‌هاگن"],
    country: "DE",
    lng: 9.206944444444444,
    lat: 52.32472222222223
  },
  { names: ["ملازگرد", "Malazgirt"], country: "TR", lng: 42.32, lat: 39.8 },
  {
    names: ["دوحه", "الدوحه"],
    country: "QA",
    lng: 51.516666666666666,
    lat: 25.283333333333335
  },
  {
    names: ["روچستر، مینه‌سوتا", "شهر روچستر", "City of Rochester"],
    country: "US",
    lng: -92.46277777777777,
    lat: 44.02333333333333
  },
  {
    names: ["نرکین ساسناشن", "Ներքին Սասնաշեն"],
    country: "AM",
    lng: 43.98277777777778,
    lat: 40.36194444444445
  },
  {
    names: ["پاکاسمایو", "Pacasmayo"],
    country: "PE",
    lng: -79.57,
    lat: -7.400277777777778
  },
  {
    names: ["آلاچام", "Alaçam"],
    country: "TR",
    lng: 35.583333333333336,
    lat: 41.6
  },
  {
    names: ["کوماسی", "Kumasi"],
    country: "GH",
    lng: -1.6166666666666667,
    lat: 6.666666666666667
  },
  { names: ["فرانسه"], lng: 2.35, lat: 48.85 },
  {
    names: ["وونستورف"],
    country: "DE",
    lng: 9.429444444444444,
    lat: 52.427499999999995
  },
  {
    names: ["مطریه"],
    country: "EG",
    lng: 31.28888888888889,
    lat: 30.129527777777778
  },
  {
    names: ["تالکا"],
    country: "CL",
    lng: -71.66666666666667,
    lat: -35.43333333333333
  },
  {
    names: ["میلان", "Milano", "Milan"],
    country: "IT",
    lng: 9.190277777777778,
    lat: 45.46416666666667
  },
  {
    names: ["درسدن"],
    country: "DE",
    lng: 13.733333333333333,
    lat: 51.03333333333333
  },
  {
    names: ["عاشر من رمضان", "مدینه العاشر من رمضان"],
    country: "EG",
    lng: 31.366666666666667,
    lat: 30.05
  },
  { names: ["تسویکا"], country: "DE", lng: 12.324166666666667, lat: 51.2175 },
  {
    names: ["پرایا", "Praia"],
    country: "CV",
    lng: -23.508333333333333,
    lat: 14.920833333333333
  },
  { names: ["دماوند (شهر)"], lng: 52.065, lat: 35.7178 },
  {
    names: ["گوییانگ", "Guiyang", "贵阳市"],
    country: "CN",
    lng: 106.63333333333334,
    lat: 26.65
  },
  {
    names: ["ایکستاپالوکا"],
    country: "MX",
    lng: -98.88222222222221,
    lat: 19.31861111111111
  },
  {
    names: ["نوویی روزدیل", "Novyi Rozdil", "Новий Розділ", "Nowy Rozdół"],
    country: "UA",
    lng: 24.136666666666667,
    lat: 49.469722222222224
  },
  {
    names: ["اوهوس", "Åhus"],
    country: "SE",
    lng: 14.283333333333333,
    lat: 55.916666666666664
  },
  {
    names: ["هسیش الدندورف"],
    country: "DE",
    lng: 9.25,
    lat: 52.166666666666664
  },
  {
    names: ["تالین", "Tallinn"],
    country: "EE",
    lng: 24.74527777777778,
    lat: 59.43722222222222
  },
  {
    names: ["بوخوم"],
    country: "DE",
    lng: 7.215833333333333,
    lat: 51.481944444444444
  },
  {
    names: ["لیش (هسن)", "Lich"],
    country: "DE",
    lng: 8.820833333333333,
    lat: 50.52166666666667
  },
  {
    names: ["ریا تازا", "Ռյա Թազա"],
    country: "AM",
    lng: 44.30611111111111,
    lat: 40.658055555555556
  },
  {
    names: ["خندزوروت، وایوتس‌جور", "خندزوروت", "Խնձորուտ"],
    country: "AM",
    lng: 45.37694444444445,
    lat: 39.566111111111105
  },
  {
    names: ["هسلهولم", "Hässleholm, Sweden"],
    country: "SE",
    lng: 13.766666666666667,
    lat: 56.166666666666664
  },
  {
    names: ["کورگان، اوبلاست کورگان", "Курган"],
    country: "RU",
    lng: 65.35,
    lat: 55.46666666666667
  },
  {
    names: ["زانکت آندریاسبرگ"],
    country: "DE",
    lng: 10.518333333333334,
    lat: 51.71055555555556
  },
  {
    names: ["تویشنیتز"],
    country: "DE",
    lng: 11.380555555555556,
    lat: 50.395833333333336
  },
  { names: ["هیلدس‌هایم"], country: "DE", lng: 9.95, lat: 52.15 },
  {
    names: ["واردانیدزر", "Վարդանիձոր"],
    country: "AM",
    lng: 46.21416666666667,
    lat: 38.96944444444445
  },
  { names: ["دورستن"], country: "DE", lng: 6.964166666666667, lat: 51.66 },
  {
    names: ["هورودنیا", "Horodnia", "Городня"],
    country: "UA",
    lng: 31.59361111111111,
    lat: 51.89055555555556
  },
  {
    names: ["براتیسلاوا", "Bratislava"],
    country: "SK",
    lng: 48.14388888888889,
    lat: 17.109722222222224
  },
  {
    names: ["آرتسوانیست", "Արծվանիստ"],
    country: "AM",
    lng: 45.507777777777775,
    lat: 40.155
  },
  {
    names: ["گخ", "Goch"],
    country: "DE",
    lng: 6.161944444444445,
    lat: 51.68388888888889
  },
  {
    names: ["ییواسکیلا", "Jyväskylä"],
    country: "FI",
    lng: 25.741666666666667,
    lat: 62.24166666666667
  },
  { names: ["شیراز"], lng: 52.543423, lat: 29.617248 },
  {
    names: ["مریدا", "(به اسپانیایی: Mérida)"],
    country: "ES",
    lng: -6.333333333333333,
    lat: 38.9
  },
  {
    names: ["سالت‌لیک‌سیتی", "Salt Lake City"],
    country: "US",
    lng: -111.88333333333334,
    lat: 40.75
  },
  { names: ["قم"], lng: 50.88, lat: 34.66 },
  { names: ["اشتندل"], country: "DE", lng: 11.85, lat: 52.6 },
  { names: ["بازل", "Basel"], lng: 7.36, lat: 47.34 },
  {
    names: ["هوفهایم ام تانوس"],
    country: "DE",
    lng: 8.45,
    lat: 50.083333333333336
  },
  {
    names: ["اشلایدن"],
    country: "DE",
    lng: 6.466666666666667,
    lat: 50.533055555555556
  },
  {
    names: ["خانجیان، ارمنستان", "خانجیان", "Խանջյան"],
    country: "AM",
    lng: 44.03333333333333,
    lat: 40.166666666666664
  },
  { names: ["محلات"], lng: 50.45, lat: 33.9167 },
  {
    names: ["سایو کارلوس", "ساو کارلوس"],
    country: "BR",
    lng: -47.89083333333333,
    lat: -22.017777777777777
  },
  {
    names: ["آرخونا (کلمبیا)", "Arjona"],
    country: "CO",
    lng: -75.3461111111111,
    lat: 10.258611111111112
  },
  { names: ["باد بوشا"], country: "DE", lng: 9.61, lat: 48.066111111111105 },
  { names: ["باغ‌ملک"], lng: 49.51, lat: 31.31 },
  {
    names: ["تویاما (شهر)", "Toyama", "富山"],
    country: "JP",
    lng: 137.21666666666667,
    lat: 36.7
  },
  {
    names: ["بریج‌تاون", "Bridgetown"],
    country: "BB",
    lng: -59.632,
    lat: 13.106
  },
  {
    names: ["تالکا"],
    country: "CL",
    lng: -71.66666666666667,
    lat: -35.43333333333333
  },
  {
    names: ["بسنی"],
    country: "TR",
    lng: 37.86138888888889,
    lat: 37.69416666666666
  },
  { names: ["چانگچون", "长春市"], country: "CN", lng: 125.2, lat: 43.9 },
  {
    names: ["سنت لوییس، میزوری", "سنت لوییس", "City of St. Louis"],
    country: "US",
    lng: -90.19777777777779,
    lat: 38.62722222222222
  },
  {
    names: ["آندریا (ایتالیا)", "Andria"],
    country: "IT",
    lng: 16.3,
    lat: 41.21666666666667
  },
  {
    names: ["لا سرنا", "La Serna"],
    country: "ES",
    lng: -4.666666666666667,
    lat: 42.416666666666664
  },
  { names: ["سان مارینو"], lng: 12.033333333333333, lat: 43.93333333333333 },
  {
    names: ["خناتساخ", "Խնածախ"],
    country: "AM",
    lng: 46.39277777777778,
    lat: 39.603611111111114
  },
  { names: ["هواشتات ان در دانوب"], country: "DE", lng: 10.55, lat: 48.6 },
  {
    names: ["ژیاوزو", "焦作市"],
    country: "CN",
    lng: 113.22305555555556,
    lat: 35.24305555555556
  },
  {
    names: ["الپه، آلمان", "Olpe"],
    country: "DE",
    lng: 7.833333333333333,
    lat: 51.016666666666666
  },
  {
    names: ["ریوآچا", "Riohacha"],
    country: "CO",
    lng: -72.90694444444445,
    lat: 11.544166666666667
  },
  {
    names: ["سیمیونوفکا، ارمنستان", "سیمیونوفکا", "Սեմյոնովկա"],
    country: "AM",
    lng: 44.90972222222222,
    lat: 40.653055555555554
  },
  {
    names: ["التساخ"],
    country: "DE",
    lng: 8.071666666666667,
    lat: 48.17472222222222
  },
  {
    names: ["بریلن", "Brilon"],
    country: "DE",
    lng: 8.566666666666666,
    lat: 51.38333333333333
  },
  { names: ["اوبرهاوزن", "Oberhausen"], country: "DE", lng: 6.85, lat: 51.55 },
  {
    names: ["نورواک، کالیفرنیا", "City of Norwalk"],
    country: "US",
    lng: -118.08333333333333,
    lat: 33.90694444444444
  },
  {
    names: ["هایکادزور", "Հայկաձոր"],
    country: "AM",
    lng: 43.66083333333333,
    lat: 40.53777777777778
  },
  {
    names: ["استان تاووش", "Տավուշի մարզ"],
    country: "AM",
    lng: 53.13333333333333,
    lat: 40.75
  },
  {
    names: ["راینباخ", "Rheinbach"],
    country: "DE",
    lng: 6.95,
    lat: 50.63333333333333
  },
  {
    names: ["گورایک", "Գորայք"],
    country: "AM",
    lng: 45.80972222222222,
    lat: 39.668055555555554
  },
  {
    names: ["پتروشن", "Petroșani"],
    country: "RO",
    lng: 23.373333333333335,
    lat: 45.41222222222222
  },
  {
    names: ["گرایفسوالد", "Greifswald"],
    country: "DE",
    lng: 13.383333333333333,
    lat: 54.083333333333336
  },
  { names: ["باقرشهر", "باقراباد"], lng: 51.4022, lat: 35.5092 },
  {
    names: ["چونگجین", "청진시"],
    country: "KP",
    lng: 129.76666666666668,
    lat: 41.78333333333333
  },
  {
    names: ["داشتادم", "Դաշտադեմ"],
    country: "AM",
    lng: 43.85,
    lat: 40.333333333333336
  },
  {
    names: ["اورلندو، فلوریدا", "City of Orlando"],
    country: "US",
    lng: -81.29888888888888,
    lat: 28.41583333333333
  },
  {
    names: ["اونتراشلایسهایم"],
    country: "DE",
    lng: 11.566666666666666,
    lat: 48.28333333333333
  },
  {
    names: ["لاونبورگ", "Lauenburg"],
    country: "DE",
    lng: 10.55888888888889,
    lat: 53.37583333333333
  },
  {
    names: ["گواتمالاسیتی", "La Nueva Guatemala de la Asunción"],
    country: "GT",
    lng: -90.53527777777778,
    lat: 14.613333333333333
  },
  {
    names: ["یفپاتوریا", "Yevpatoria", "Євпаторія", "Евпатория", "Kezlev"],
    country: "UA",
    lng: 33.36805555555556,
    lat: 45.193888888888885
  },
  { names: ["نایین"], lng: 53.0826, lat: 32.8602 },
  {
    names: ["آندروشیوکا", "Andrushivka"],
    country: "UA",
    lng: 29.016666666666666,
    lat: 50.016666666666666
  },
  {
    names: ["هووتاشات", "Հովտաշատ"],
    country: "AM",
    lng: 44.34277777777778,
    lat: 40.10194444444445
  },
  {
    names: ["نوو تارگ"],
    country: "PL",
    lng: 20.016666666666666,
    lat: 49.46666666666667
  },
  {
    names: ["الزفلس", "Elsfleth"],
    country: "DE",
    lng: 8.466666666666667,
    lat: 53.233333333333334
  },
  {
    names: ["بادن-وورتمبرگ", "Baden-Württemberg"],
    country: "DE",
    lng: 9.04111111111111,
    lat: 48.53777777777778
  },
  {
    names: ["نانتانگ", "南通市"],
    country: "CN",
    lng: 120.9,
    lat: 31.983333333333334
  },
  {
    names: ["تانگرمونده", "Tangermünde"],
    country: "DE",
    lng: 11.96888888888889,
    lat: 52.54083333333333
  },
  {
    names: ["لوبلینگتس"],
    country: "PL",
    lng: 18.683333333333334,
    lat: 50.68333333333333
  },
  {
    names: ["فلوریانوپلیس"],
    country: "BR",
    lng: -48.416666666666664,
    lat: -27.833333333333332
  },
  {
    names: ["اشتوم"],
    country: "PL",
    lng: 19.033611111111114,
    lat: 53.92166666666667
  },
  {
    names: ["باد هرسفلد", "Bad Hersfeld"],
    country: "DE",
    lng: 9.7075,
    lat: 50.86833333333333
  },
  { names: ["درانزفلد"], country: "DE", lng: 9.766666666666667, lat: 51.5 },
  {
    names: ["آرماویر، ارمنستان", "آرماویر", "Արմավիր"],
    country: "AM",
    lng: 44.04,
    lat: 40.15
  },
  {
    names: ["نویاوتینگ", "Neuötting"],
    country: "DE",
    lng: 12.683333333333334,
    lat: 48.21666666666667
  },
  {
    names: ["رتنبورگ، زاکسن", "Rothenburg"],
    country: "DE",
    lng: 14.966666666666667,
    lat: 51.333333333333336
  },
  {
    names: ["ونیز", "Venessia", "Venice"],
    country: "IT",
    lng: 12.335833333333333,
    lat: 45.4375
  },
  { names: ["سووا", "Suva"], country: "FJ", lng: 178, lat: -18 },
  {
    names: ["سانتیاگو دل استرو", "Santiago del Estero"],
    country: "AR",
    lng: -64.26666666666667,
    lat: -27.783333333333335
  },
  {
    names: ["اشلوس هولته-اشتوکنبروک"],
    country: "DE",
    lng: 8.616666666666667,
    lat: 51.88333333333333
  },
  {
    names: ["منشاو", "Monschau"],
    country: "DE",
    lng: 6.256388888888889,
    lat: 50.559999999999995
  },
  {
    names: ["شارلوت‌تاون", "City of Charlottetown"],
    country: "CA",
    lng: -63.15,
    lat: 46.233333333333334
  },
  {
    names: ["رتنفلز"],
    country: "DE",
    lng: 9.583333333333334,
    lat: 49.88333333333333
  },
  {
    names: ["چارچاکیس", "Ճարճակիս"],
    country: "AM",
    lng: 44.32611111111112,
    lat: 40.70333333333333
  },
  {
    names: ["اورادیا", "(به رومانیایی: Oradea)"],
    country: "RO",
    lng: 21.921111111111113,
    lat: 47.07222222222222
  },
  {
    names: ["اسپرینگفیلد، ماساچوست"],
    country: "US",
    lng: -72.59027777777777,
    lat: 42.10138888888889
  },
  {
    names: ["ریچموند، کالیفرنیا", "ریچموند"],
    country: "US",
    lng: -122.34777777777778,
    lat: 37.93583333333333
  },
  {
    names: ["بودنوردر"],
    country: "DE",
    lng: 9.516666666666667,
    lat: 51.96666666666667
  },
  {
    names: [
      "رینوسا تامایولیپاس",
      "Villa de Nuestra Señora de Guadalupe de Reynosa"
    ],
    country: "MX",
    lng: -98.27777777777777,
    lat: 26.092222222222222
  },
  {
    names: ["ورملزکیرشن", "Wermelskirchen"],
    country: "DE",
    lng: 7.216666666666667,
    lat: 51.15
  },
  {
    names: ["کایاکوپه", "Caacupé"],
    country: "PY",
    lng: -57.14083333333333,
    lat: -25.38611111111111
  },
  {
    names: ["بنونتو"],
    country: "IT",
    lng: 14.783333333333333,
    lat: 41.13333333333333
  },
  {
    names: ["تالارا", "Talara"],
    country: "PE",
    lng: -81.27187777777777,
    lat: -4.579902777777778
  },
  { names: ["توکسپان، وراکروز"], country: "MX", lng: -97.4, lat: 20.95 },
  {
    names: ["لاوفن، آلمان", "Laufen"],
    country: "DE",
    lng: 12.933333333333334,
    lat: 47.93333333333333
  },
  {
    names: ["بریول", "Baraolt", "Barót"],
    country: "RO",
    lng: 25.6,
    lat: 46.075
  },
  {
    names: ["ارباخ (دانوب)", "Erbach"],
    country: "DE",
    lng: 9.887777777777778,
    lat: 48.32805555555556
  },
  {
    names: ["سندای", "仙台"],
    country: "JP",
    lng: 140.86666666666667,
    lat: 38.266666666666666
  },
  {
    names: ["قوملوجا", "Kumluca"],
    country: "TR",
    lng: 30.283333333333335,
    lat: 36.36666666666667
  },
  {
    names: ["ماله (مالدیو)", "ماله", "Male", "މާލެ"],
    country: "MV",
    lng: 73.50888888888889,
    lat: 4.175000000000001
  },
  {
    names: ["نورتلیه", "Norrtälje"],
    country: "SE",
    lng: 18.7,
    lat: 59.766666666666666
  },
  { names: ["کنارک", "کٌنرک"], lng: 60.3997, lat: 25.3556 },
  { names: ["الدمازین"], country: "SD", lng: 34.35, lat: 11.766666666666667 },
  {
    names: ["هورباتغ", "Հորբատեղ"],
    country: "AM",
    lng: 45.33555555555556,
    lat: 39.89472222222222
  },
  { names: ["مشهد"], lng: 59.36, lat: 36.18 },
  {
    names: ["هاوانا", "La Habana"],
    country: "CU",
    lng: -82.38333333333334,
    lat: 23.133333333333333
  },
  {
    names: ["اوپوله"],
    country: "PL",
    lng: 17.933333333333334,
    lat: 50.666666666666664
  },
  {
    names: ["اوبرفیشتاخ"],
    country: "DE",
    lng: 12.416666666666666,
    lat: 49.46666666666667
  },
  {
    names: ["انشلدسویک", "Örnsköldsvik"],
    country: "SE",
    lng: 18.715555555555554,
    lat: 63.29083333333333
  },
  {
    names: ["شپتیفکا", "Shepetivka", "Шепетівка"],
    country: "UA",
    lng: 27.066666666666666,
    lat: 50.18333333333333
  },
  {
    names: ["اسلام‌آباد"],
    country: "PK",
    lng: 73.06666666666666,
    lat: 33.71666666666667
  },
  {
    names: ["جیانگژو", "荆州市"],
    country: "CN",
    lng: 112.21666666666667,
    lat: 30.333333333333332
  },
  {
    names: ["گایزا"],
    country: "DE",
    lng: 9.966666666666667,
    lat: 50.71666666666667
  },
  {
    names: ["شاهومیان، آرماویر", "شاهومیان", "Շահումյան"],
    country: "AM",
    lng: 44.29666666666667,
    lat: 40.21333333333334
  },
  {
    names: ["کانازاوا، ایشیکاوا", "کانازاوا", "金沢"],
    country: "JP",
    lng: 136.65,
    lat: 36.56666666666667
  },
  {
    names: ["رام‌الله", "(به عربی:رام‌الله)"],
    country: "PS",
    lng: 35.2,
    lat: 31.9
  },
  {
    names: ["وایسنزی در تورینگن", "Weißensee"],
    country: "DE",
    lng: 11.066666666666666,
    lat: 51.18333333333333
  },
  {
    names: ["آسلار"],
    country: "DE",
    lng: 8.466666666666667,
    lat: 50.583333333333336
  },
  {
    names: ["سیوداد ویکتوریا"],
    country: "MX",
    lng: -99.13333333333334,
    lat: 23.733333333333334
  },
  {
    names: ["بروواری", "Бровари"],
    country: "UA",
    lng: 30.766666666666666,
    lat: 50.5
  },
  {
    names: ["توکوشیما (شهر)", "Tokushima", "徳島"],
    country: "JP",
    lng: 134.55,
    lat: 34.06666666666667
  },
  { names: ["ماینبرنهایم"], country: "DE", lng: 10.216666666666667, lat: 49.7 },
  {
    names: ["استاخانوف، اوکراین", "Stakhanov", "Стаханов"],
    country: "UA",
    lng: 38.65861111111111,
    lat: 48.56805555555556
  },
  {
    names: ["اوژانیس", "Ուժանիս"],
    country: "AM",
    lng: 46.54194444444444,
    lat: 39.23555555555556
  },
  {
    names: ["کورباخ", "Korbach"],
    country: "DE",
    lng: 8.866666666666667,
    lat: 51.28333333333333
  },
  {
    names: ["اوراسار", "Ուրասար"],
    country: "AM",
    lng: 44.28,
    lat: 41.015277777777776
  },
  {
    names: ["آبوجا", "Abuja"],
    country: "NG",
    lng: 7.483333333333333,
    lat: 9.066666666666666
  },
  {
    names: ["والهو، کالیفرنیا", "والهو"],
    country: "US",
    lng: -122.23583333333333,
    lat: 38.113055555555555
  },
  {
    names: ["آمباتو، اکوادور", "San Juan Bautista de Ambato"],
    country: "EC",
    lng: -78.61972222222222,
    lat: -1.2416666666666667
  },
  {
    names: ["کالتانیستا", "Caltanissetta"],
    country: "IT",
    lng: 14.066666666666666,
    lat: 37.483333333333334
  },
  {
    names: ["ایباگه", "Ibagué"],
    country: "CO",
    lng: -75.23333333333333,
    lat: 4.433333333333334
  },
  {
    names: ["آیگک", "Այգեկ"],
    country: "AM",
    lng: 44.38333333333333,
    lat: 40.18861111111111
  },
  { names: ["کالبه (میلده)"], country: "DE", lng: 11.4, lat: 52.6333 },
  {
    names: ["هانوفر", "Hannover"],
    country: "DE",
    lng: 9.716666666666667,
    lat: 52.36666666666667
  },
  { names: ["گلستان (بهارستان)", "گلستان"], lng: 51.16, lat: 35.51 },
  {
    names: ["فور-دو-فرانس", "Fort-de-France"],
    country: "FR",
    lng: -61.083333333333336,
    lat: 14.6
  },
  {
    names: ["لاهور"],
    country: "PK",
    lng: 74.33333333333333,
    lat: 31.533333333333335
  },
  {
    names: ["ووستان", "Ոստան"],
    country: "AM",
    lng: 44.55916666666666,
    lat: 39.95888888888889
  },
  {
    names: ["آپاگا", "Ապագա"],
    country: "AM",
    lng: 44.25111111111111,
    lat: 40.096111111111114
  },
  {
    names: ["اشناکنبرگ"],
    country: "DE",
    lng: 11.568055555555555,
    lat: 53.03666666666666
  },
  {
    names: ["چی‌واوا (ایالت چی‌واوا)", "چی‌واوا", "Chihuahua"],
    country: "MX",
    lng: -106.08,
    lat: 28.63
  },
  {
    names: ["سوردلوف، ارمنستان", "سوردلوف", "Սվերդլով"],
    country: "AM",
    lng: 44.40083333333333,
    lat: 41.09722222222222
  },
  {
    names: ["بامبرگ"],
    country: "DE",
    lng: 10.891666666666666,
    lat: 49.891666666666666
  },
  {
    names: ["زایبو", "淄博市"],
    country: "CN",
    lng: 118.05,
    lat: 36.78333333333333
  },
  { names: ["ویسمار"], country: "DE", lng: 11.466666666666667, lat: 53.9 },
  {
    names: ["رومنی", "Romny", "Ромни, Ромны"],
    country: "UA",
    lng: 33.46666666666667,
    lat: 50.75
  },
  {
    names: ["شی‌آن", "西安市"],
    country: "CN",
    lng: 108.9,
    lat: 34.266666666666666
  },
  {
    names: ["کوماموتو (شهر)", "Kumamoto", "熊本"],
    country: "JP",
    lng: 130.73333333333332,
    lat: 32.78333333333333
  },
  {
    names: ["هیلرود"],
    country: "DK",
    lng: 12.308055555555557,
    lat: 55.92916666666667
  },
  {
    names: ["مدان", "Kota Medan"],
    country: "ID",
    lng: 98.66666666666667,
    lat: -3.5833333333333335
  },
  {
    names: ["ماریسکال استیگاریبیا", "Mariscal Estigarribia"],
    country: "PY",
    lng: -60.63333333333333,
    lat: -22.033333333333335
  },
  {
    names: ["پیترماریتسبرگ"],
    country: "ZA",
    lng: 30.383333333333333,
    lat: -29.616666666666667
  },
  {
    names: ["ایلینتسی", "Illintsi", "Іллінці"],
    country: "UA",
    lng: 29.20888888888889,
    lat: 49.105555555555554
  },
  {
    names: ["وارداشن، آرارات", "وارداشن", "Վարդաշեն"],
    country: "AM",
    lng: 44.55583333333333,
    lat: 40.03361111111111
  },
  {
    names: ["نورنوس", "Նուռնուս"],
    country: "AM",
    lng: 44.60583333333334,
    lat: 40.3575
  },
  {
    names: ["دیبوییا (لا گواخیرا)", "Dibulla"],
    country: "CO",
    lng: -73.3,
    lat: 11.266666666666667
  },
  {
    names: ["کلبرا (کیفرهویزر)"],
    country: "DE",
    lng: 11.033333333333333,
    lat: 51.43333333333333
  },
  {
    names: ["نرکین بازمابرد", "Ներքին Բազմաբերդ"],
    country: "AM",
    lng: 44.05555555555555,
    lat: 40.34527777777778
  },
  { names: ["وحیدیه"], lng: 51.0414, lat: 35.5964 },
  {
    names: ["آرگونی", "Արեգունի"],
    country: "AM",
    lng: 45.60888888888889,
    lat: 40.338055555555556
  },
  {
    names: ["لوبک"],
    country: "DE",
    lng: 10.686388888888889,
    lat: 53.86972222222222
  },
  {
    names: ["هایده (اشلسویگ-هولشتاین)"],
    country: "DE",
    lng: 9.093333333333334,
    lat: 54.19611111111111
  },
  {
    names: ["فیلادلفیا", "The City of Philadelphia"],
    country: "US",
    lng: -75.17,
    lat: 39.95333333333333
  },
  {
    names: ["اسپیه", "Espiye"],
    country: "TR",
    lng: 38.733333333333334,
    lat: 40.95
  },
  {
    names: ["سان‌فرانسیسکو"],
    country: "US",
    lng: -122.4192,
    lat: 37.77833333333333
  },
  {
    names: ["فوجا (شهر)", "فوجّا", "Foggia"],
    country: "IT",
    lng: 15.546111111111111,
    lat: 41.46416666666667
  },
  {
    names: ["فررنیافه", "Ferreñafe"],
    country: "PE",
    lng: -79.77027777777778,
    lat: -6.718258333333334
  },
  { names: ["طبس"], lng: 56.9225, lat: 33.5883 },
  {
    names: ["فشتا", "Vechta"],
    country: "DE",
    lng: 8.288611111111111,
    lat: 52.730555555555554
  },
  {
    names: ["سوگاموسو", "Sogamoso"],
    country: "CO",
    lng: -72.91666666666667,
    lat: 5.716666666666667
  },
  { names: ["موتسشن"], country: "DE", lng: 12.9, lat: 51.266666666666666 },
  {
    names: ["مندن (زاورلند)", "Menden (Sauerland)"],
    country: "DE",
    lng: 7.8,
    lat: 51.43333333333333
  },
  {
    names: ["کارکوپ", "Քարկոփ"],
    country: "AM",
    lng: 44.833333333333336,
    lat: 41.2
  },
  { names: ["سوسنگرد", "الخفاجیه"], lng: 48.17, lat: 31.55 },
  {
    names: ["اولیندا"],
    country: "BR",
    lng: -34.855000000000004,
    lat: -8.008888888888889
  },
  {
    names: ["لیبناو، هسن", "Liebenau"],
    country: "DE",
    lng: 9.283333333333333,
    lat: 51.483333333333334
  },
  {
    names: ["ژوکووو"],
    country: "PL",
    lng: 18.360555555555557,
    lat: 54.34583333333334
  },
  { names: ["اخمیم"], country: "EG", lng: 31.75, lat: 26.566666666666666 },
  {
    names: ["سوزه (آلمان)"],
    country: "DE",
    lng: 13.449722222222222,
    lat: 52.21666666666667
  },
  {
    names: ["پادربورن", "Paderborn"],
    country: "DE",
    lng: 8.766666666666667,
    lat: 51.71666666666667
  },
  { names: ["طلخا"], country: "EG", lng: 31.375644, lat: 31.054735 },
  { names: ["دیواندره"], lng: 47.01, lat: 35.54 },
  {
    names: ["هولزگرلینگن"],
    country: "DE",
    lng: 9.010833333333334,
    lat: 48.63916666666667
  },
  { names: ["تارما"], lng: -75.69083, lat: -11.41972 },
  { names: ["گنبد کاووس"], lng: 55.1, lat: 37.15 },
  {
    names: ["اردملی"],
    country: "TR",
    lng: 34.26611111111111,
    lat: 36.60777777777778
  },
  {
    names: ["هرازدان", "Հրազդան"],
    country: "AM",
    lng: 44.766666666666666,
    lat: 40.5
  },
  {
    names: ["اوبرهوف، آلمان", "Oberhof"],
    country: "DE",
    lng: 10.725833333333334,
    lat: 50.70527777777778
  },
  {
    names: ["کاتماندو", "काठमाडौं"],
    country: "NP",
    lng: 85.33333333333333,
    lat: 27.7
  },
  {
    names: ["آرناشتاین"],
    country: "DE",
    lng: 9.983333333333333,
    lat: 49.96666666666667
  },
  {
    names: ["نردرنی"],
    country: "DE",
    lng: 7.146944444444445,
    lat: 53.70722222222223
  },
  {
    names: ["بیه ده اریش", "Baia de Arieș"],
    country: "RO",
    lng: 23.279722222222222,
    lat: 46.379444444444445
  },
  {
    names: ["والدزهوت-تینگن"],
    country: "DE",
    lng: 8.214444444444444,
    lat: 47.62305555555555
  },
  { names: ["اسلام‌آباد غرب", "شاباد"], lng: 46.52778, lat: 34.11139 },
  { names: ["پینبرگ"], country: "DE", lng: 9.8, lat: 53.63333333333333 },
  {
    names: ["هوفگایزمار", "Hofgeismar"],
    country: "DE",
    lng: 9.4,
    lat: 51.483333333333334
  },
  {
    names: ["کفر الشیخ", "کَفر الشیخ"],
    country: "EG",
    lng: 30.945833333333333,
    lat: 31.111666666666668
  },
  {
    names: ["هانگژو", "杭州市"],
    country: "CN",
    lng: 120.16666666666667,
    lat: 30.25
  },
  {
    names: ["جرارات", "Ջրառատ"],
    country: "AM",
    lng: 44.08833333333334,
    lat: 40.74611111111111
  },
  {
    names: ["موکرن"],
    country: "DE",
    lng: 11.952499999999999,
    lat: 52.14055555555556
  },
  {
    names: ["وردا (هاول)", "Werder (Havel)"],
    country: "DE",
    lng: 12.935,
    lat: 52.378055555555555
  },
  {
    names: ["آلسدورف", "Alsdorf"],
    country: "DE",
    lng: 6.166666666666667,
    lat: 50.88333333333333
  },
  {
    names: ["نورواک، کالیفرنیا", "City of Norwalk"],
    country: "US",
    lng: -118.08333333333333,
    lat: 33.90694444444444
  },
  { names: ["قامشلی"], country: "SY", lng: 41.21666666666667, lat: 37.05 },
  {
    names: ["دورانگو (شهر)", "دورانگو، دورانگو"],
    country: "MX",
    lng: -104.66666666666667,
    lat: 24.016666666666666
  },
  {
    names: ["فلبرگ"],
    country: "DE",
    lng: 9.881666666666668,
    lat: 49.08777777777778
  },
  {
    names: ["شچولکینه", "Shcholkine", "Щолкіне", "Щёлкино", "Şçolkino"],
    country: "UA",
    lng: 35.81861111111112,
    lat: 45.42361111111111
  },
  {
    names: ["کومانشت", "Comăneşti"],
    country: "RO",
    lng: 26.45,
    lat: 46.42972222222222
  },
  {
    names: ["خرطوم بحری"],
    country: "SD",
    lng: 32.63333333333333,
    lat: 15.633333333333333
  },
  {
    names: ["صدفا"],
    country: "EG",
    lng: 31.174722222222222,
    lat: 29.922222222222224
  },
  {
    names: ["اسپلکامپف", "Espelkamp"],
    country: "DE",
    lng: 8.632777777777779,
    lat: 52.37722222222222
  },
  {
    names: ["تلاکوپاکو"],
    country: "MX",
    lng: -103.35,
    lat: 20.666666666666668
  },
  {
    names: ["داراکرت", "Դարակերտ"],
    country: "AM",
    lng: 44.413888888888884,
    lat: 40.10583333333334
  },
  {
    names: ["ازوگا", "Azuga"],
    country: "RO",
    lng: 25.55527777777778,
    lat: 45.44499999999999
  },
  {
    names: ["کوتونو", "Cotonou"],
    country: "BJ",
    lng: 2.4333333333333336,
    lat: 6.366666666666666
  },
  {
    names: ["کامین-کاشیرسکی", "Kamin-Kashyrskyi"],
    country: "UA",
    lng: 24.96527777777778,
    lat: 51.62
  },
  {
    names: ["نویهاوس آم رن‌وگ"],
    country: "DE",
    lng: 11.15,
    lat: 50.516666666666666
  },
  {
    names: ["واناشن", "Վանաշեն"],
    country: "AM",
    lng: 44.68333333333333,
    lat: 39.9
  },
  {
    names: ["کلگری", "کَلگِری", "Calgary"],
    country: "CA",
    lng: -114.05722222222222,
    lat: 51.044999999999995
  },
  {
    names: ["فاقوس", "Faqus"],
    country: "EG",
    lng: 31.8,
    lat: 30.733333333333334
  },
  {
    names: ["کملوپس"],
    country: "CA",
    lng: -120.34083333333332,
    lat: 50.67611111111111
  },
  {
    names: ["یدلینا-زدروی"],
    country: "PL",
    lng: 16.33888888888889,
    lat: 50.721111111111114
  },
  {
    names: ["مهیکنگ", "Mafikeng, Mafeking"],
    country: "ZA",
    lng: 25.633333333333333,
    lat: -25.85
  },
  {
    names: ["برزوی (رومانی)", "Brezoi"],
    country: "RO",
    lng: 24.25,
    lat: 45.35
  },
  {
    names: ["ماربورگ", "Marburg"],
    country: "DE",
    lng: 8.770833333333334,
    lat: 50.809999999999995
  },
  {
    names: ["مرادلی"],
    country: "TR",
    lng: 27.50861111111111,
    lat: 41.174166666666665
  },
  {
    names: ["بیرمنگام", "بیرمنهگام", "City of Birmingham"],
    country: "GB",
    lng: -1.8936111111111111,
    lat: 52.48305555555556
  },
  { names: ["گوژنو"], country: "PL", lng: 19.65, lat: 53.2 },
  { names: ["اسپارتا"], country: "TR", lng: 30.55, lat: 37.766666666666666 },
  {
    names: ["زانکت گوارزهاوزن", "زانکت گوارزهاوزن ", "Sankt Goarshausen"],
    country: "DE",
    lng: 7.715277777777778,
    lat: 50.15472222222222
  },
  {
    names: ["ساریگیوغ", "Սարիգյուղ"],
    country: "AM",
    lng: 45.145833333333336,
    lat: 41.05638888888888
  },
  {
    names: ["پالیکیر", "Palikir"],
    country: "FM",
    lng: 158.185,
    lat: 6.917777777777778
  },
  {
    names: ["سدار راپیدز، آیووا", "سدار راپیدز", "Cedar Rapids"],
    country: "US",
    lng: -91.66861111111112,
    lat: 41.98305555555556
  },
  {
    names: ["وست کووینا، کالیفرنیا"],
    country: "US",
    lng: -117.91861111111112,
    lat: 34.056666666666665
  },
  { names: ["پرتک"], country: "TR", lng: 39.325, lat: 38.86694444444444 },
  {
    names: ["خرسون", "Херсон"],
    country: "UA",
    lng: 32.583333333333336,
    lat: 46.63333333333333
  },
  {
    names: ["ازدونسکا وولا"],
    country: "PL",
    lng: 18.966666666666665,
    lat: 51.6
  },
  {
    names: ["سوان (ارمنستان)", "سوان", "Սևան"],
    country: "AM",
    lng: 44.953611111111115,
    lat: 40.555
  },
  {
    names: ["رادبورگ"],
    country: "DE",
    lng: 13.725555555555555,
    lat: 51.212500000000006
  },
  { names: ["هندیجان", "هندیون"], lng: 49.71, lat: 30.24 },
  { names: ["برمرهافن"], country: "DE", lng: 8.583333333333334, lat: 53.55 },
  {
    names: ["وراکروز (شهر)", "وراکروس (وراکروس)", "Puerto de tlaxciclo"],
    country: "MX",
    lng: -96.15333333333334,
    lat: 19.190277777777776
  },
  {
    names: ["تری‌یر"],
    country: "DE",
    lng: 6.641388888888889,
    lat: 49.75666666666667
  },
  { names: ["نوشهر"], lng: 51.4833, lat: 36.65 },
  {
    names: ["مایزنهایم"],
    country: "DE",
    lng: 7.666666666666667,
    lat: 49.71666666666667
  },
  { names: ["کوراسایو"], lng: -68.93333333333334, lat: 12.116666666666667 },
  { names: ["سن خوان د پایارا"], country: "VE", lng: -67.6, lat: 7.65 },
  {
    names: ["گوانتانامو"],
    country: "CU",
    lng: -75.21388888888889,
    lat: 20.136666666666667
  },
  {
    names: ["ایرپین", "Ірпiнь", "Ирпе́нь"],
    country: "UA",
    lng: 30.25,
    lat: 50.516666666666666
  },
  {
    names: ["الترلاین"],
    country: "DE",
    lng: 12.867222222222223,
    lat: 50.57694444444445
  },
  {
    names: ["آستغادزور", "Աստղաձոր"],
    country: "AM",
    lng: 45.35666666666667,
    lat: 40.12388888888889
  },
  { names: ["تویسترینگن", "Twistringen"], country: "DE", lng: 8.65, lat: 52.8 },
  {
    names: ["کینشاسا", "Kinshas"],
    country: "CD",
    lng: 15.322222222222223,
    lat: -4.325
  },
  {
    names: ["کوستیانتینیفکا", "Kostiantynivka", "Костянтинівка"],
    country: "UA",
    lng: 37.71666666666667,
    lat: 48.53333333333333
  },
  { names: ["مونتسرات"], lng: -62.2, lat: 16.75 },
  {
    names: ["اولدنبورگ"],
    country: "DE",
    lng: 8.213888888888889,
    lat: 53.14388888888889
  },
  {
    names: ["بسیگهایم", "Besigheim"],
    country: "DE",
    lng: 9.141666666666667,
    lat: 48.998333333333335
  },
  {
    names: ["جی‌لین", "استان جیلین", "Jilin Province", "吉林"],
    country: "AM",
    lng: 126.2,
    lat: 43.7
  },
  {
    names: ["لوله‌بورگاس", "Lüleburgaz"],
    country: "TR",
    lng: 27.356944444444444,
    lat: 41.40555555555555
  },
  {
    names: ["الکزاندریا (رومانی)", "الکزاندریا", "Alexandria"],
    country: "RO",
    lng: 25.333333333333332,
    lat: 43.968611111111116
  },
  { names: ["کولمباخ"], country: "DE", lng: 11.433333333333334, lat: 50.1 },
  {
    names: ["آرواتساگ", "Արևածագ"],
    country: "AM",
    lng: 44.61055555555556,
    lat: 40.973888888888894
  },
  {
    names: ["مونترآل", "Montréal"],
    country: "CA",
    lng: -73.65,
    lat: 45.516666666666666
  },
  {
    names: ["تکت"],
    country: "MX",
    lng: -116.64027777777778,
    lat: 32.57222222222222
  },
  {
    names: ["ارفتشتات", "Erftstadt"],
    country: "DE",
    lng: 6.766666666666667,
    lat: 50.81666666666667
  },
  { names: ["تسیندورف"], country: "DE", lng: 10.95, lat: 49.45 },
  {
    names: ["دوور، دلاویر", "دوور", "Dover"],
    country: "US",
    lng: -75.52666666666667,
    lat: 39.161944444444444
  },
  {
    names: ["کمپیناس"],
    country: "BR",
    lng: -47.05722222222222,
    lat: -22.90083333333333
  },
  { names: ["نیزکی"], country: "DE", lng: 14.816666666666666, lat: 51.3 },
  { names: ["شوشتر"], lng: 48.83, lat: 32.02 },
  {
    names: ["کورونا، کالیفرنیا", "Corona"],
    country: "US",
    lng: -117.56666666666666,
    lat: 33.86666666666667
  },
  {
    names: ["هویوتلا د ریس"],
    country: "MX",
    lng: -98.41666666666667,
    lat: 21.133333333333333
  },
  {
    names: ["کاتناغبیور، لوری", "کاتناغبیور", "Կաթնաղբյուր"],
    country: "AM",
    lng: 44.22027777777778,
    lat: 41.0375
  },
  { names: ["برمودا"], lng: -64.78333333333333, lat: 32.3 },
  {
    names: ["ووسکهات", "Ոսկեհատ"],
    country: "AM",
    lng: 44.27444444444444,
    lat: 40.27638888888889
  },
  {
    names: ["ساسکاتون", "Saskatoon"],
    country: "CA",
    lng: -106.68333333333334,
    lat: 52.13333333333333
  },
  { names: ["آنسباخ"], country: "DE", lng: 10.583333333333334, lat: 49.3 },
  { names: ["کابیماس"], country: "VE", lng: -71.45, lat: 10.4 },
  {
    names: ["استان سیونیک", "Սյունիք մարզ"],
    country: "AM",
    lng: 46.25,
    lat: 39.25
  },
  {
    names: ["هلوخیف", "Hlukhiv (Глухів)", "Glukhov (Глухов)"],
    country: "UA",
    lng: 33.91138888888889,
    lat: 51.67861111111111
  },
  {
    names: ["سوخومی", "სოხუმი", "Аҟәа"],
    country: "GE",
    lng: 41.015277777777776,
    lat: 43.00333333333333
  },
  {
    names: ["گتاب، ارمنستان", "گتاب", "Գետափ"],
    country: "AM",
    lng: 44,
    lat: 40.65
  },
  {
    names: ["ووراشتات"],
    country: "DE",
    lng: 8.115555555555556,
    lat: 49.84305555555556
  },
  {
    names: ["نور کیانک", "Նոր կյանք"],
    country: "AM",
    lng: 43.975,
    lat: 40.650277777777774
  },
  {
    names: ["سرپسبرگ"],
    country: "NO",
    lng: 11.202777777777778,
    lat: 59.29055555555556
  },
  { names: ["مونتری"], country: "MX", lng: -100.3, lat: 25.666666666666668 },
  {
    names: ["لیشتن‌اشتاین، زاکسن", "Lichtenstein"],
    country: "DE",
    lng: 12.631666666666668,
    lat: 50.756388888888885
  },
  {
    names: ["موریتا، کالیفرنیا", "City of Murrieta"],
    country: "US",
    lng: -117.2025,
    lat: 33.56944444444445
  },
  {
    names: ["کامپالا", "Kampala"],
    country: "UG",
    lng: 32.58111111111111,
    lat: 0.3136111111111111
  },
  {
    names: ["یغگناوان", "Եղեգնավան"],
    country: "AM",
    lng: 44.63722222222222,
    lat: 39.82777777777778
  },
  {
    names: ["جاغاتسادزور", "Ջաղացաձոր"],
    country: "AM",
    lng: 45.815555555555555,
    lat: 40.14666666666667
  },
  {
    names: ["انیگرلوه", "Ennigerloh"],
    country: "DE",
    lng: 8.025555555555556,
    lat: 51.836666666666666
  },
  {
    names: ["بالتا، اوکراین", "Balta", "Балта"],
    country: "UA",
    lng: 29.621944444444445,
    lat: 47.94
  },
  {
    names: ["سورته", "Surte"],
    country: "SE",
    lng: 12.016666666666667,
    lat: 57.81666666666667
  },
  {
    names: ["تلایومولکو د زونیگا"],
    country: "MX",
    lng: -103.44305555555556,
    lat: 20.473611111111108
  },
  { names: ["بروجرد", "ووری یرد"], lng: 48.5, lat: 33.8 },
  {
    names: ["دیلی", "Dili"],
    country: "TL",
    lng: 125.58333333333333,
    lat: -8.55
  },
  {
    names: ["دتمولد"],
    country: "DE",
    lng: 8.883333333333333,
    lat: 51.93333333333333
  },
  {
    names: ["اوبوکیف", "Обухів", "Обухов"],
    country: "UA",
    lng: 30.656666666666666,
    lat: 50.13
  },
  {
    names: ["زوواشن، کوتایک", "زوواشن", "Զովաշեն"],
    country: "AM",
    lng: 44.74888888888889,
    lat: 40.31166666666666
  },
  {
    names: ["بوپفینگن"],
    country: "DE",
    lng: 10.352222222222222,
    lat: 48.856944444444444
  },
  {
    names: ["نینبورگ", "Nienburg"],
    country: "DE",
    lng: 9.206944444444444,
    lat: 52.64111111111111
  },
  {
    names: ["آلتسناو این اونترفرانکن"],
    country: "DE",
    lng: 9.066666666666666,
    lat: 50.06666666666667
  },
  {
    names: ["الجفله، الجزایر", "الجفله", "الجلفه‌"],
    country: "DZ",
    lng: 3.25,
    lat: 34.666666666666664
  },
  {
    names: ["اسکندریه", "الاسکندریه"],
    country: "EG",
    lng: 29.916666666666668,
    lat: 31.2
  },
  {
    names: ["تتیییف", "Тетіїв"],
    country: "UA",
    lng: 29.69,
    lat: 49.37083333333334
  },
  {
    names: ["زاریشات", "Զարիշատ"],
    country: "AM",
    lng: 43.659444444444446,
    lat: 41.001666666666665
  },
  { names: ["هرب‌اشتاین"], country: "DE", lng: 9.35, lat: 50.55 },
  {
    names: ["چیتاگونگ", "চট্টগ্রাম"],
    country: "BD",
    lng: 91.8,
    lat: 22.366666666666667
  },
  { names: ["گسلار"], country: "DE", lng: 10.43, lat: 51.907222222222224 },
  {
    names: ["یاووژنو", "Jaworzno"],
    country: "PL",
    lng: 19.266666666666666,
    lat: 50.18333333333333
  },
  {
    names: ["ان آربر، میشیگان", "Ann Arbor, Michigan"],
    country: "US",
    lng: -83.74833333333333,
    lat: 42.28138888888889
  },
  { names: ["آداپازاری"], country: "TR", lng: 30.4, lat: 40.78333333333333 },
  {
    names: ["سایو ژوزه دوس کامپوس", "São José dos Campos"],
    country: "BR",
    lng: -45.87861111111111,
    lat: -23.18638888888889
  },
  {
    names: ["وروتسواف", "Wrocław"],
    country: "PL",
    lng: 17.038333333333334,
    lat: 51.10777777777778
  },
  {
    names: ["کوییکبورن (کرایس پینبرگ)"],
    country: "DE",
    lng: 9.897222222222222,
    lat: 53.733333333333334
  },
  { names: ["تریپتیس"], country: "DE", lng: 11.85, lat: 50.733333333333334 },
  { names: ["توتلینگن"], country: "DE", lng: 8.823333333333332, lat: 47.985 },
  {
    names: ["ارمنستان", "جمهوری ارمنستان"],
    lng: 44.516666666666666,
    lat: 40.18333333333333
  },
  {
    names: ["قره‌چولها", "Karaçulha"],
    country: "TR",
    lng: 29.216666666666665,
    lat: 36.65
  },
  {
    names: ["الوانگان"],
    country: "DE",
    lng: 10.130555555555556,
    lat: 48.961111111111116
  },
  {
    names: ["واتربری، کنتیکت", "Waterbury, Connecticut"],
    country: "US",
    lng: -73.04138888888889,
    lat: 41.55611111111111
  },
  {
    names: ["موصل", "موصِل", "الموصل (عربی )"],
    country: "IQ",
    lng: 43.07,
    lat: 36.02
  },
  {
    names: ["آرازاپ", "Արազափ"],
    country: "AM",
    lng: 44.145833333333336,
    lat: 40.04277777777778
  },
  { names: ["کفر شکر"], country: "EG", lng: 31.267333, lat: 30.546961 },
  { names: ["کلبرمور"], country: "DE", lng: 12.066666666666666, lat: 47.85 },
  {
    names: ["گرزه (شهر)", "Gerze"],
    country: "TR",
    lng: 35.18333333333333,
    lat: 41.8
  },
  {
    names: ["پیتشت", "Piteşti"],
    country: "RO",
    lng: 24.86777777777778,
    lat: 44.86055555555556
  },
  {
    names: ["تنگن، آلمان", "Tengen"],
    country: "DE",
    lng: 8.659166666666668,
    lat: 47.81444444444444
  },
  {
    names: ["پتن‌اشتاین (بایرن)"],
    country: "DE",
    lng: 11.411388888888888,
    lat: 49.77222222222222
  },
  {
    names: ["سنت وندل"],
    country: "DE",
    lng: 7.166666666666667,
    lat: 49.46666666666667
  },
  { names: ["برازیلیا", "Brasília"], country: "BR", lng: -47.9, lat: 15.8 },
  {
    names: ["آرچیس، ارمنستان", "آرچیس", "Արճիս"],
    country: "AM",
    lng: 44.8725,
    lat: 41.16416666666667
  },
  { names: ["برویک (سوید)", "Brevik"], country: "SE", lng: 18.2, lat: 59.35 },
  { names: ["هواشتات ان در آیش"], country: "DE", lng: 10.8, lat: 49.7 },
  {
    names: ["لاوفنبورگ، آلمان", "Laufenburg"],
    country: "DE",
    lng: 8.064722222222223,
    lat: 47.565555555555555
  },
  {
    names: ["نیواورلیان", "نیو اورلیان"],
    country: "US",
    lng: -90.07055555555556,
    lat: 29.96472222222222
  },
  {
    names: ["باد موسکاو", "Bad Muskau"],
    country: "DE",
    lng: 14.716666666666667,
    lat: 51.55
  },
  {
    names: ["سولهان"],
    country: "TR",
    lng: 41.05444444444444,
    lat: 38.96083333333333
  },
  {
    names: ["بودش", "Budești", "Budeshti"],
    country: "RO",
    lng: 26.45,
    lat: 44.230000000000004
  },
  {
    names: ["غاریبجانیان", "Ղարիբջանյան"],
    country: "AM",
    lng: 43.79694444444444,
    lat: 40.74611111111111
  },
  {
    names: ["ورین ساسونیک", "Վերին Սասունիկ"],
    country: "AM",
    lng: 44.166666666666664,
    lat: 40.333333333333336
  },
  {
    names: ["پکانبارو", "ڤکنبارو"],
    country: "ID",
    lng: 101.45,
    lat: -0.5333333333333333
  },
  {
    names: ["کرنیتسا مورسکا"],
    country: "PL",
    lng: 19.444444444444446,
    lat: 54.3825
  },
  {
    names: ["پوتلینگن"],
    country: "DE",
    lng: 6.883333333333333,
    lat: 49.28333333333333
  },
  {
    names: ["دیترویت", "دیترویت، میشیگان", "Detroit"],
    country: "US",
    lng: -83.04583333333333,
    lat: 42.331388888888895
  },
  {
    names: ["مانیسا"],
    country: "TR",
    lng: 27.422222222222224,
    lat: 38.63055555555555
  },
  {
    names: ["نوکوآلوفا", "Nukuʻalofa"],
    country: "TO",
    lng: -175.2,
    lat: -21.133333333333333
  },
  {
    names: ["اورتسالانج", "Ուրցալանջ"],
    country: "AM",
    lng: 44.985,
    lat: 39.85305555555556
  },
  {
    names: ["گیر"],
    country: "DE",
    lng: 12.923333333333332,
    lat: 50.62361111111111
  },
  {
    names: ["داشتادم، لوری", "داشتادم", "Դաշտադեմ"],
    country: "AM",
    lng: 44.175,
    lat: 41.13666666666666
  },
  {
    names: ["فریتزلار", "Fritzlar"],
    country: "DE",
    lng: 9.283333333333333,
    lat: 51.13333333333333
  },
  {
    names: ["پوکر مانتاش", "Փոքր Մանթաշ"],
    country: "AM",
    lng: 44.05,
    lat: 40.65
  },
  {
    names: ["هامینکلن"],
    country: "DE",
    lng: 6.590833333333333,
    lat: 51.731944444444444
  },
  {
    names: ["اسکولی پیچنو", "Ascoli Piceno"],
    country: "IT",
    lng: 13.583333333333334,
    lat: 42.85
  },
  {
    names: ["هوکلهوفن", "Hückelhoven"],
    country: "DE",
    lng: 6.219722222222222,
    lat: 51.06083333333333
  },
  {
    names: ["هانتسویل، آلاباما", "Huntsville"],
    country: "US",
    lng: -86.585,
    lat: 34.730000000000004
  },
  {
    names: ["دجله (ترکیه)", "دجله"],
    country: "TR",
    lng: 40.07333333333334,
    lat: 38.375
  },
  {
    names: ["کیرشبرگ (زاکسن)"],
    country: "DE",
    lng: 12.525555555555556,
    lat: 50.62222222222222
  },
  {
    names: ["سان خوآن، آرژانتین", "سان خوآن", "San Juan"],
    country: "AR",
    lng: -68.5261111111111,
    lat: -31.534166666666668
  },
  { names: ["کاتانزارو", "Catanzaro"], country: "IT", lng: 16.6, lat: 38.9 },
  {
    names: ["سان خوآن", "San Juan, Puerto Rico"],
    country: "US",
    lng: -66.06666666666666,
    lat: 17.45
  },
  {
    names: ["المهولت", "Älmhult"],
    country: "SE",
    lng: 14.133333333333333,
    lat: 56.55
  },
  {
    names: ["سلیدوفه", "Selydove", "Селидове"],
    country: "UA",
    lng: 37.5,
    lat: 48.21666666666667
  },
  {
    names: ["لاندسبرگ آم لش"],
    country: "DE",
    lng: 10.898888888888889,
    lat: 48.047777777777775
  },
  {
    names: ["جینینگ (شاندونگ)", "Jining", "济宁市"],
    lng: 116.56666666666666,
    lat: 35.4
  },
  { names: ["لوبن (اشپریوالد)"], country: "DE", lng: 13.9, lat: 51.95 },
  {
    names: ["آکنر، سیونیک", "آکنر", "Ակներ"],
    country: "AM",
    lng: 46.308611111111105,
    lat: 39.50666666666667
  },
  {
    names: ["بلومبرگ", "Blumberg"],
    country: "DE",
    lng: 8.534166666666666,
    lat: 47.83916666666667
  },
  {
    names: ["لیانیانگانگ", "连云港市"],
    country: "CN",
    lng: 119.16666666666667,
    lat: 34.6
  },
  {
    names: ["دینکلزبول"],
    country: "DE",
    lng: 10.319444444444445,
    lat: 49.07083333333334
  },
  { names: ["گنیفکووو"], country: "PL", lng: 18.416666666666668, lat: 52.9 },
  {
    names: ["کاکاواسار", "Կաքավասար"],
    country: "AM",
    lng: 44.03333333333333,
    lat: 40.916666666666664
  },
  {
    names: ["یونشوپینگ", "Jönköping"],
    country: "SE",
    lng: 14.160555555555556,
    lat: 57.782777777777774
  },
  {
    names: ["ارموسییو، سونورا", "ارموسییو", "Hermosillo"],
    country: "MX",
    lng: -110.95416666666667,
    lat: 29.098888888888887
  },
  {
    names: ["گبزی"],
    country: "DE",
    lng: 10.934722222222222,
    lat: 51.11388888888889
  },
  {
    names: ["اوپسالا", "Uppsala"],
    country: "SE",
    lng: 17.633333333333333,
    lat: 59.85
  },
  {
    names: ["کورپس کریستی", "Corpus Christi, Texas"],
    country: "US",
    lng: -97.40194444444445,
    lat: 27.74277777777778
  },
  {
    names: ["سکوندی-تاکورادی", "Sekondi-Takoradi", "City of Sekondi-Takoradi"],
    country: "GH",
    lng: -1.7666666666666666,
    lat: 4.916666666666667
  },
  {
    names: ["آگویاسکالینتس (شهر)", "آگویاسکالینتس", "Aguascalientes"],
    country: "MX",
    lng: -102.2961111111111,
    lat: 21.880833333333335
  },
  {
    names: ["اجی‌پیام", "Acıpayam"],
    country: "TR",
    lng: 29.35388888888889,
    lat: 37.425
  },
  {
    names: ["اینیریدا، گواینیا"],
    country: "CO",
    lng: -67.9238888888889,
    lat: 3.865277777777778
  },
  {
    names: ["منطقه لوس لاگوس", "Los Lagos Region", "X Región de Los Lagos"],
    country: "CL",
    lng: -72.93666666666667,
    lat: -41.47166666666667
  },
  {
    names: ["اشتاینباخ (تانوس)"],
    country: "DE",
    lng: 8.566666666666666,
    lat: 50.166666666666664
  },
  {
    names: ["شمبورگ (بای بالینگن)", "Schömberg"],
    country: "DE",
    lng: 8.761666666666667,
    lat: 48.21138888888889
  },
  {
    names: ["آیگدزور", "Այգեձոր"],
    country: "AM",
    lng: 45.54083333333333,
    lat: 40.82555555555556
  },
  {
    names: ["کالاچ (شهر)", "Калач"],
    country: "RU",
    lng: 41,
    lat: 50.43333333333333
  },
  {
    names: ["کوجی", "Cugir"],
    country: "RO",
    lng: 23.363611111111112,
    lat: 45.843611111111116
  },
  {
    names: ["هونیارا", "Honiara"],
    country: "SB",
    lng: 159.81666666666666,
    lat: -9.466666666666667
  },
  { names: ["ابردین", "Obar Dheathain"], country: "GB", lng: -2, lat: 57 },
  { names: ["رفسنجان"], lng: 55.99161, lat: 30.40594 },
  { names: ["قرچک"], lng: 51.57, lat: 35.44 },
  {
    names: ["روویگو", "Rovigo"],
    lng: 11.790555555555555,
    lat: 45.07027777777778
  },
  {
    names: ["کیتو", "Quito"],
    country: "EC",
    lng: -78.58333333333333,
    lat: -0.25
  },
  {
    names: ["هاتیس", "Հատիս"],
    country: "AM",
    lng: 44.72972222222222,
    lat: 40.34055555555556
  },
  {
    names: ["دراج (آلبانی)", "دراج", "Durrës"],
    country: "AL",
    lng: 19.45,
    lat: 41.31666666666667
  },
  { names: ["اراک"], lng: 49.7, lat: 34.08 },
  {
    names: ["مالمبریت", "Malmberget"],
    country: "SE",
    lng: 20.666666666666668,
    lat: 67.16666666666667
  },
  {
    names: ["واغاتین", "Վաղատին"],
    country: "AM",
    lng: 46.11805555555556,
    lat: 39.50527777777778
  },
  {
    names: ["کالیاری", "Cagliari"],
    country: "IT",
    lng: 9.057500000000001,
    lat: 39.24638888888889
  },
  {
    names: ["نوباریه جدیده", "النوباریه الجدیده"],
    country: "EG",
    lng: 30.066666666666666,
    lat: 30.666666666666668
  },
  {
    names: ["جوهور بهرو"],
    country: "MY",
    lng: 103.73333333333333,
    lat: 1.4833333333333334
  },
  {
    names: ["شارلوت، کارولینای شمالی", "شارلوت", "Charlotte"],
    country: "US",
    lng: -80.84333333333333,
    lat: 35.22694444444445
  },
  { names: ["گرمدره"], lng: 51.0692, lat: 35.7558 },
  {
    names: ["فالشوپینگ", "Falköping"],
    country: "SE",
    lng: 13.553055555555556,
    lat: 58.175
  },
  {
    names: ["اشتوسن"],
    country: "DE",
    lng: 11.933055555555555,
    lat: 51.109722222222224
  },
  {
    names: ["سمالوط"],
    country: "EG",
    lng: 30.710833333333333,
    lat: 28.309722222222224
  },
  {
    names: ["کرمن", "Kremmen"],
    country: "DE",
    lng: 13.033055555555556,
    lat: 52.766666666666666
  },
  {
    names: ["تامباخ-دیت‌هارتس"],
    country: "DE",
    lng: 10.616666666666667,
    lat: 50.78972222222222
  },
  {
    names: ["شیملیو سیلوانیه", "Şimleu Silvaniei", "Szilágysomlyó"],
    country: "RO",
    lng: 22.8,
    lat: 47.230555555555554
  },
  { names: ["قاین"], lng: 59.18, lat: 33.73 },
  {
    names: ["شنیک، آرماویر", "شنیک", "Շենիկ"],
    country: "AM",
    lng: 43.766666666666666,
    lat: 40.2
  },
  {
    names: ["پاناماسیتی", "Panamá"],
    country: "PA",
    lng: -79.51666666666667,
    lat: 8.983333333333333
  },
  {
    names: ["برگن آن در روگن"],
    country: "DE",
    lng: 13.433333333333334,
    lat: 54.416666666666664
  },
  {
    names: ["بروکسل", "(به هلندی: Brussel)", "(به فرانسوی: Bruxelles)"],
    country: "BE",
    lng: 4.35,
    lat: 50.85
  },
  {
    names: ["اوبروزل"],
    country: "DE",
    lng: 7.721388888888889,
    lat: 50.111111111111114
  },
  { names: ["ارزروم"], country: "TR", lng: 41.27, lat: 39.9 },
  {
    names: ["کارمیر آغک", "Կարմիր Աղեկ"],
    country: "AM",
    lng: 44.55,
    lat: 40.983333333333334
  },
  { names: ["شیلونگ"], country: "IN", lng: 91.8833, lat: 25.5667 },
  {
    names: ["کاغنوت", "Կաղնուտ"],
    country: "AM",
    lng: 46.506388888888885,
    lat: 39.274166666666666
  },
  {
    names: ["باد فرانکن‌هاوزن/کیفرهویزر"],
    country: "DE",
    lng: 11.101111111111111,
    lat: 51.35583333333334
  },
  {
    names: ["الحوامدیه"],
    country: "EG",
    lng: 31.264166666666668,
    lat: 29.897777777777776
  },
  {
    names: ["اوپوچنو"],
    country: "PL",
    lng: 20.283333333333335,
    lat: 51.38333333333333
  },
  {
    names: ["جرج‌تاون", "Georgetown, Guyana"],
    country: "GY",
    lng: -58.166666666666664,
    lat: 6.8
  },
  {
    names: ["مسقط"],
    country: "OM",
    lng: 58.591944444444444,
    lat: 23.608611111111113
  },
  {
    names: ["لیوبلیانا", "Ljubljana"],
    country: "SI",
    lng: 14.508333333333333,
    lat: 46.05555555555555
  },
  { names: ["گالاراته", "Gallarate"], lng: 8.8, lat: 45.666666666666664 },
  {
    names: ["ایو (رومانی)", "Aiud"],
    country: "RO",
    lng: 23.729166666666664,
    lat: 46.31222222222222
  },
  {
    names: ["تساغکاشات", "Ծաղկաշատ"],
    country: "AM",
    lng: 44.74027777777778,
    lat: 41.07666666666667
  },
  {
    names: ["فریدریشسهافن"],
    country: "DE",
    lng: 9.479166666666666,
    lat: 47.65416666666667
  },
  { names: ["چرکس‌کوی"], country: "TR", lng: 28, lat: 41.28333333333333 },
  {
    names: ["جراپی", "Ջրափի"],
    country: "AM",
    lng: 43.68277777777777,
    lat: 40.55694444444444
  },
  { names: ["هان. موندن"], country: "DE", lng: 9.65, lat: 51.416666666666664 },
  {
    names: ["آیگاوان", "Այգավան"],
    country: "AM",
    lng: 44.67027777777778,
    lat: 39.86472222222223
  },
  {
    names: ["همبورگ (سار)", "Homburg"],
    country: "DE",
    lng: 7.333333333333333,
    lat: 49.31666666666667
  },
  {
    names: ["لیونبرگ (وورتمبرگ)"],
    country: "DE",
    lng: 9.013055555555555,
    lat: 48.80138888888889
  },
  {
    names: ["نورمن، اکلاهما", "Norman, Oklahoma"],
    country: "US",
    lng: -97.41666666666667,
    lat: 35.21666666666667
  },
  {
    names: ["فروندنبرگ"],
    country: "DE",
    lng: 7.765833333333333,
    lat: 51.471944444444446
  },
  {
    names: ["آلماتی", "Алматы"],
    country: "KZ",
    lng: 76.89583333333334,
    lat: 43.277499999999996
  },
  {
    names: ["گوایاکیل", "گوای‌اکیل", "Santiago de Guayaquil"],
    country: "EC",
    lng: -79.88333333333334,
    lat: -2.183333333333333
  },
  {
    names: ["وییاپینسون", "Hato Viejo"],
    country: "CO",
    lng: -73.6,
    lat: 5.216666666666667
  },
  { names: ["بونیر", "جزیره بونیر"], lng: -68.46666666666667, lat: 12.25 },
  { names: ["کریمیتشوا"], country: "DE", lng: 12.3875, lat: 50.81805555555556 },
  {
    names: ["ریاض"],
    country: "SA",
    lng: 46.71666666666667,
    lat: 24.633333333333333
  },
  {
    names: ["نیامی", "Niamey"],
    country: "NE",
    lng: 2.105277777777778,
    lat: 13.52138888888889
  },
  {
    names: ["بلفاست"],
    country: "GB",
    lng: -5.929166666666667,
    lat: 54.59666666666667
  },
  {
    names: ["گابورون", "Gaborone"],
    country: "BW",
    lng: 25.91222222222222,
    lat: -24.658055555555553
  },
  {
    names: ["لاس پالماس", "(به اسپانیایی: Las Palmas)"],
    country: "ES",
    lng: -15.416666666666666,
    lat: 28.15
  },
  {
    names: ["بندورف آن در راین"],
    country: "DE",
    lng: 7.570277777777777,
    lat: 50.42972222222222
  },
  { names: ["سلماس"], lng: 44.7681, lat: 38.1975 },
  {
    names: ["لیوژو", "柳州市 • Liujcouh Si"],
    country: "CN",
    lng: 109.38333333333334,
    lat: 24.316666666666666
  },
  {
    names: ["گوانگ‌ژو", "广州市"],
    country: "CN",
    lng: 113.26666666666667,
    lat: 23.133333333333333
  },
  {
    names: ["واردابلور، آراگاتسوتن", "واردابلور", "Վարդաբլուր"],
    country: "AM",
    lng: 44.230000000000004,
    lat: 40.69611111111111
  },
  {
    names: ["وانک، سیونیک", "وانک", "Վանեք"],
    country: "AM",
    lng: 46.35,
    lat: 39.28333333333333
  },
  {
    names: ["سیپانیک", "Սիփանիկ"],
    country: "AM",
    lng: 44.352222222222224,
    lat: 40.106944444444444
  },
  { names: ["ویلشتر"], country: "DE", lng: 9.374444444444444, lat: 53.9225 },
  {
    names: ["سابانالارگا (آتلانتیکو)", "Sabanalarga"],
    country: "CO",
    lng: -74.92111111111112,
    lat: 10.631111111111112
  },
  {
    names: ["آستانه (قزاقستان)", "آستانه", "Астана"],
    country: "KZ",
    lng: 71.43333333333334,
    lat: 51.166666666666664
  },
  {
    names: ["مارگارا", "Մարգարա"],
    country: "AM",
    lng: 44.17388888888889,
    lat: 40.03361111111111
  },
  {
    names: ["بایامو"],
    country: "CU",
    lng: -76.64277777777778,
    lat: 20.381666666666668
  },
  {
    names: ["خالکیس", "Χαλκίδα"],
    country: "GR",
    lng: 23.6,
    lat: 38.46666666666667
  },
  { names: ["پاریس", "شهر"], country: "FR", lng: 2.3508, lat: 48.8567 },
  {
    names: ["سیوداد مانته"],
    country: "MX",
    lng: -98.95,
    lat: 22.733333333333334
  },
  {
    names: ["کلونا"],
    country: "CA",
    lng: -119.49333333333334,
    lat: 49.88361111111111
  },
  {
    names: ["پیرنا"],
    country: "DE",
    lng: 13.940277777777778,
    lat: 50.96222222222222
  },
  { names: ["هونگن"], country: "DE", lng: 8.9, lat: 50.46666666666667 },
  {
    names: ["هرمس‌کایل"],
    country: "DE",
    lng: 6.948888888888889,
    lat: 49.657222222222224
  },
  {
    names: ["سنت جان", "Saint John"],
    country: "CA",
    lng: -66.0761111111111,
    lat: 45.28055555555555
  },
  {
    names: ["سووپسک", "Słupsk"],
    country: "PL",
    lng: 17.029166666666665,
    lat: 54.465833333333336
  },
  {
    names: ["آبیجان", "Abidjan"],
    country: "CI",
    lng: -4.033333333333333,
    lat: 5.316666666666666
  },
  {
    names: ["لیپ‌اشتات", "Lippstadt"],
    country: "DE",
    lng: 8.35,
    lat: 51.666666666666664
  },
  {
    names: ["تروسینگن"],
    country: "DE",
    lng: 8.636111111111111,
    lat: 48.07555555555556
  },
  {
    names: ["امه ریش", "Emmerich"],
    country: "DE",
    lng: 6.245277777777778,
    lat: 51.835
  },
  {
    names: ["دیکیلی", "Dikili"],
    country: "TR",
    lng: 26.883333333333333,
    lat: 39.06666666666667
  },
  { names: ["اشلویزینگن"], country: "DE", lng: 10.75, lat: 50.516666666666666 },
  {
    names: ["باد گوتلوبا-برگیس‌هوبل"],
    country: "DE",
    lng: 13.95,
    lat: 50.858333333333334
  },
  {
    names: ["یومبو (واییه دل کایوکا)", "Yumbo"],
    country: "CO",
    lng: -76.46666666666667,
    lat: 3.5833333333333335
  },
  {
    names: ["پورتو"],
    country: "",
    lng: -8.621952777777778,
    lat: 41.16214166666666
  },
  {
    names: ["هادیاچ", "Гадяч"],
    country: "UA",
    lng: 34,
    lat: 50.36666666666667
  },
  {
    names: ["مولخو", "Mullsjö"],
    country: "SE",
    lng: 13.883333333333333,
    lat: 57.916666666666664
  },
  { names: ["مهاجران (مرکزی)"], lng: 49.2604, lat: 34.0301 },
  { names: ["سنکت اینگبرت"], country: "DE", lng: 7.116666666666666, lat: 49.3 },
  {
    names: ["سایو پایولو", "São Paulo"],
    country: "BR",
    lng: -46.63333333333333,
    lat: -23.55
  },
  {
    names: ["رسیفی", "Recife"],
    country: "BR",
    lng: -34.88333333333333,
    lat: -8.05
  },
  {
    names: ["لاوشا"],
    country: "DE",
    lng: 11.160277777777779,
    lat: 50.481388888888894
  },
  {
    names: ["استمفورد، کنتیکت", "Stamford, Connecticut"],
    country: "US",
    lng: -73.53888888888889,
    lat: 41.05277777777778
  },
  {
    names: ["سوواوکی"],
    country: "PL",
    lng: 22.933333333333334,
    lat: 54.083333333333336
  },
  {
    names: ["همینگن (نیدرزاکسن)", "Hemmingen"],
    country: "DE",
    lng: 9.725555555555555,
    lat: 52.32361111111111
  },
  {
    names: ["شهرستان قوص", "Qus"],
    country: "EG",
    lng: 32.766666666666666,
    lat: 25.933333333333334
  },
  {
    names: ["انانین‌دوا، پارا", "انانین‌دوا"],
    country: "BR",
    lng: -48.371944444444445,
    lat: -1.3658333333333335
  },
  {
    names: ["بالینگن"],
    country: "DE",
    lng: 8.850555555555555,
    lat: 48.27305555555555
  },
  { names: ["بندر انزلی"], lng: 49.4667, lat: 37.4667 },
  {
    names: ["هاقپات", "Հաղպատ"],
    country: "AM",
    lng: 44.71027777777778,
    lat: 41.095
  },
  {
    names: ["سانتا ماریا (ریو گرانده جنوبی)", "سانتا ماریا", "Santa Maria"],
    country: "BR",
    lng: -53.8,
    lat: -29.683333333333334
  },
  {
    names: ["پرا ناخون سی آیوتایا (شهر)", "آیوتایا", "พระนครศรีอยุธยา"],
    country: "AM",
    lng: 100.56055555555555,
    lat: 14.347777777777779
  },
  {
    names: ["کیرشبرگ ان در یاگست"],
    country: "DE",
    lng: 9.981388888888889,
    lat: 49.20388888888889
  },
  {
    names: ["بروانلاگه"],
    country: "DE",
    lng: 10.611944444444443,
    lat: 51.72694444444445
  },
  {
    names: ["ینوکاوان", "Ենոքավան"],
    country: "AM",
    lng: 45.099444444444444,
    lat: 40.91361111111111
  },
  {
    names: ["دوبلین", "(به ایرلندی: Baile Átha Cliath)", "Dublin"],
    country: "IE",
    lng: -6.25,
    lat: 53.333333333333336
  },
  {
    names: ["سایهوا", "绥化市"],
    country: "CN",
    lng: 126.98333333333333,
    lat: 46.63333333333333
  },
  {
    names: ["ویامایو", "City of Viamão"],
    country: "BR",
    lng: -51.022777777777776,
    lat: -30.080833333333334
  },
  {
    names: ["کاجاران (روستا)", "کاجاران", "Քաջարան"],
    country: "AM",
    lng: 46.15611111111111,
    lat: 39.12166666666667
  },
  {
    names: ["سورنتون، کلرادو"],
    country: "US",
    lng: -104.95444444444445,
    lat: 39.903055555555554
  },
  {
    names: ["مسینا", "Missina", "Messina"],
    country: "IT",
    lng: 15.55,
    lat: 38.18333333333333
  },
  {
    names: ["فیلدراشتات"],
    country: "DE",
    lng: 9.218333333333334,
    lat: 48.680277777777775
  },
  {
    names: ["لسنوی، اوبلاست سوردلوفسک", "Лесной"],
    country: "RU",
    lng: 59.78333333333333,
    lat: 58.63333333333333
  },
  {
    names: ["کاندل (شهر)", "Kandel"],
    country: "DE",
    lng: 8.196388888888889,
    lat: 49.08277777777778
  },
  {
    names: ["مارماراشن"],
    country: "AM",
    lng: 44.471111111111114,
    lat: 40.0575
  },
  {
    names: ["بنشی (لیایونینگ)", "بنشی", "本溪市"],
    country: "CN",
    lng: 123.76666666666667,
    lat: 41.3
  },
  {
    names: ["گوندلفینگن آن در دناو"],
    country: "DE",
    lng: 10.366666666666667,
    lat: 48.55
  },
  {
    names: ["یوتبری", "Göteborg"],
    country: "SE",
    lng: 11.966666666666667,
    lat: 57.7
  },
  {
    names: [
      "کینگستون، جاماییکا",
      "شهر کینگستون، جاماییکا",
      "City of Kingston, Jamaica"
    ],
    country: "JM",
    lng: -76.8,
    lat: 17.983333333333334
  },
  { names: ["بومهن"], lng: 51.8647, lat: 35.7319 },
  {
    names: ["لوبکه", "Lübbecke"],
    country: "DE",
    lng: 8.623055555555556,
    lat: 52.308055555555555
  },
  {
    names: ["آرگاواند، آرارات", "آرگاواند", "Արգավանդ"],
    country: "AM",
    lng: 44.44,
    lat: 40.158055555555556
  },
  {
    names: ["شارجه", "اماره الشارقهّ"],
    country: "AE",
    lng: 55.38333333333333,
    lat: 25.433333333333334
  },
  {
    names: ["بوردو", "Ville de Bordeaux"],
    country: "FR",
    lng: 0.5783333333333334,
    lat: 44.83861111111111
  },
  { names: ["واربورگ"], country: "DE", lng: 9.169722222222221, lat: 51.5 },
  {
    names: ["مرمره ارغلیسی"],
    country: "TR",
    lng: 27.955277777777777,
    lat: 40.969722222222224
  },
  {
    names: ["ابوظبی"],
    country: "AE",
    lng: 54.36666666666667,
    lat: 24.466666666666665
  },
  { names: ["برانگسک"], country: "PL", lng: 22.833333333333332, lat: 52.75 },
  {
    names: ["فورت لادردیل، فلوریدا", "Fort Lauderdale, Florida"],
    country: "US",
    lng: -80.14194444444445,
    lat: 26.135833333333334
  },
  {
    names: ["براکه (اونتروسر)", "Brake"],
    country: "DE",
    lng: 8.483333333333333,
    lat: 53.333333333333336
  },
  { names: ["شن‌یانگ", "沈阳市"], country: "CN", lng: 123.4, lat: 41.8 },
  {
    names: ["بورن (وستفالن)", "Büren"],
    country: "DE",
    lng: 8.566666666666666,
    lat: 51.55
  },
  {
    names: ["ووادیسواوووو"],
    country: "PL",
    lng: 18.315555555555555,
    lat: 54.83388888888889
  },
  {
    names: ["نمنگان"],
    country: "UZ",
    lng: 71.96666666666667,
    lat: 41.63333333333333
  },
  {
    names: ["لاهور"],
    country: "PK",
    lng: 74.33333333333333,
    lat: 31.533333333333335
  },
  {
    names: ["آپوستولوفه", "Апостолове"],
    country: "UA",
    lng: 33.71666666666667,
    lat: 47.659444444444446
  },
  {
    names: ["ورت آن در دناو"],
    country: "DE",
    lng: 12.401111111111112,
    lat: 49.00083333333333
  },
  { names: ["گرونزفلد"], country: "DE", lng: 9.75, lat: 49.6 },
  { names: ["ورامین"], lng: 51.6456, lat: 35.3253 },
  {
    names: ["ویکتوریا (براشوو)", "Victoria"],
    country: "RO",
    lng: 24.69,
    lat: 45.74277777777778
  },
  {
    names: ["وانادزور"],
    country: "AM",
    lng: 44.48833333333334,
    lat: 40.812777777777775
  },
  {
    names: ["سورنتون، کلرادو"],
    country: "US",
    lng: -104.95444444444445,
    lat: 39.903055555555554
  },
  {
    names: ["تسیزار"],
    country: "DE",
    lng: 12.283055555555556,
    lat: 52.266666666666666
  },
  {
    names: ["بالاکلیا", "Balakliia", "Балаклія"],
    country: "UA",
    lng: 36.867777777777775,
    lat: 49.465833333333336
  },
  {
    names: ["زولینگن", "Solingen"],
    country: "DE",
    lng: 8.8,
    lat: 52.666666666666664
  },
  { names: ["گزبرخوار"], lng: 51.39, lat: 32.38 },
  {
    names: ["بورگدورف (هانوفر)", "Burgdorf"],
    country: "DE",
    lng: 10.008333333333333,
    lat: 52.45
  },
  {
    names: ["مالچو", "Malchow"],
    country: "DE",
    lng: 12.416666666666666,
    lat: 53.46666666666667
  },
  {
    names: ["استراسبورگ", "Strasbourg"],
    country: "FR",
    lng: 7.748611111111111,
    lat: 48.58444444444444
  },
  {
    names: ["تساغکوت", "Ծաղկուտ"],
    country: "AM",
    lng: 43.61638888888889,
    lat: 41.097500000000004
  },
  { names: ["الباسان"], country: "AL", lng: 20.066666666666666, lat: 41.1 },
  {
    names: ["ترینیداد و توباگو"],
    lng: -61.516666666666666,
    lat: 10.666666666666666
  },
  {
    names: ["آلبا ایولیا", "Alba Iulia"],
    country: "RO",
    lng: 23.57,
    lat: 46.066944444444445
  },
  {
    names: ["کمبریج، ماساچوست", "Cambridge, Massachusetts"],
    country: "US",
    lng: -71.11055555555555,
    lat: 42.37361111111111
  },
  {
    names: ["گتارگل", "Գետարգել"],
    country: "AM",
    lng: 44.55833333333333,
    lat: 40.233333333333334
  },
  { names: ["قنطره شرق", "قنطره شرقی"], country: "EG", lng: 32.31, lat: 30.85 },
  { names: ["سیرجان"], lng: 55.67, lat: 29.45 },
  { names: ["سمنان", "سِمَن"], lng: 53.23, lat: 35.34 },
  {
    names: ["رتهایم"],
    country: "DE",
    lng: 9.378055555555555,
    lat: 52.78472222222222
  },
  {
    names: ["بیتوریا", "بیتریا", "(به اسپانیایی: Vitoria)", "باسک: Gasteiz)"],
    country: "ES",
    lng: -2.6833333333333336,
    lat: 42.85
  },
  {
    names: ["دنیپرو", "Дніпро"],
    country: "UA",
    lng: 34.983333333333334,
    lat: 48.45
  },
  {
    names: ["پاساو"],
    country: "DE",
    lng: 13.466666666666667,
    lat: 48.56666666666667
  },
  { names: ["بافت (شهر)"], lng: 56.600897, lat: 29.233038 },
  {
    names: ["انشلدسویک", "Örnsköldsvik"],
    country: "SE",
    lng: 18.715555555555554,
    lat: 63.29083333333333
  },
  {
    names: ["نیوکاسل", "City of Newcastle upon Tyne"],
    country: "GB",
    lng: -1.6,
    lat: 54.96666666666667
  },
  {
    names: ["ماگدالا، آلمان", "Magdala"],
    country: "DE",
    lng: 11.446111111111112,
    lat: 50.906666666666666
  },
  {
    names: ["خارکیف", "خارکیف (خارکوف)", "Харків"],
    country: "UA",
    lng: 36.31666666666667,
    lat: 49.916666666666664
  },
  {
    names: ["آغری", "Karaköse"],
    country: "TR",
    lng: 43.056666666666665,
    lat: 39.721666666666664
  },
  {
    names: ["اینوروتسواف"],
    country: "PL",
    lng: 18.261111111111113,
    lat: 52.793055555555554
  },
  {
    names: ["لیته (رومانی)", "Liteni"],
    country: "RO",
    lng: 26.531944444444445,
    lat: 47.519999999999996
  },
  {
    names: ["پروشیان", "Պռոշյան"],
    country: "AM",
    lng: 44.415,
    lat: 40.24805555555556
  },
  {
    names: ["ارکیپا", "Arequipa, Peru"],
    country: "PE",
    lng: -71.53688333333334,
    lat: -16.398822222222222
  },
  {
    names: ["کلیولند، اوهایو", "کلیولند", "City of Cleveland"],
    country: "US",
    lng: -81.66972222222223,
    lat: 41.48222222222223
  },
  {
    names: ["وانوان", "Վանևան"],
    country: "AM",
    lng: 45.68333333333333,
    lat: 40.2
  },
  {
    names: ["الشتروردا"],
    country: "DE",
    lng: 13.523888888888889,
    lat: 51.45777777777778
  },
  { names: ["زوریخ", "Zürich"], lng: 8.33, lat: 47.22 },
  {
    names: ["گفرس"],
    country: "DE",
    lng: 11.73983611111111,
    lat: 50.09513888888889
  },
  {
    names: ["ووستر، ماساچوست", "City of Worcester"],
    country: "US",
    lng: -71.8,
    lat: 42.266666666666666
  },
  {
    names: ["ونیز", "Venessia", "Venice"],
    country: "IT",
    lng: 12.335833333333333,
    lat: 45.4375
  },
  {
    names: ["پیوترکوف تربونالسکی"],
    country: "PL",
    lng: 19.683333333333334,
    lat: 51.4
  },
  {
    names: ["بلایشاروده"],
    country: "DE",
    lng: 10.566666666666666,
    lat: 51.416666666666664
  },
  {
    names: ["ایندیپندنس، میزوری", "Independence"],
    country: "US",
    lng: -94.40666666666667,
    lat: 39.07972222222222
  },
  {
    names: ["اور-ارکن‌اشویک", "Oer-Erkenschwick"],
    country: "DE",
    lng: 7.2508333333333335,
    lat: 51.64222222222222
  },
  { names: ["رومان (رومانی)", "Roman"], country: "RO", lng: 26.93, lat: 46.93 },
  {
    names: ["هانتسویل، آلاباما", "Huntsville"],
    country: "US",
    lng: -86.585,
    lat: 34.730000000000004
  },
  {
    names: ["آتن، جورجیا", "Athens, Georgia"],
    country: "US",
    lng: -83.38333333333334,
    lat: 33.95
  },
  {
    names: ["آمبرد، آرماویر", "آمبرد", "Ամբերդ"],
    country: "AM",
    lng: 44.272777777777776,
    lat: 40.24166666666667
  },
  {
    names: ["ترگو مورش", "Târgu Mureş"],
    country: "RO",
    lng: 24.5625,
    lat: 46.54555555555555
  },
  {
    names: ["اسپیتاک", "Սպիտակ"],
    country: "AM",
    lng: 44.2675,
    lat: 40.83722222222222
  },
  { names: ["دیبورگ"], country: "DE", lng: 8.85, lat: 49.9 },
  {
    names: ["گغاماسار", "Գեղամասար"],
    country: "AM",
    lng: 45.67916666666667,
    lat: 40.31055555555555
  },
  { names: ["تکاب"], lng: 47.11285563, lat: 36.40108724 },
  {
    names: ["اورخان غازی (شهر)", "اورخان غازی"],
    country: "TR",
    lng: 29.308333333333334,
    lat: 40.48888888888889
  },
  { names: ["ساوور"], country: "TR", lng: 40.88916666666667, lat: 37.5375 },
  {
    names: ["اسمره", "Asmara", "ኣስመራ", "اسمرا"],
    country: "ER",
    lng: 38.93333333333333,
    lat: 15.333333333333334
  },
  {
    names: ["بلفاست"],
    country: "GB",
    lng: -5.929166666666667,
    lat: 54.59666666666667
  },
  {
    names: ["تکسکوکو، استادو د مخیکو", "Texcoco de Mora"],
    country: "MX",
    lng: -98.882,
    lat: 19.509
  },
  {
    names: ["میکاییلوفکا", "Միխայելովկա"],
    country: "AM",
    lng: 44.277499999999996,
    lat: 41.165277777777774
  },
  { names: ["نکا"], lng: 53.308251, lat: 36.66155 },
  {
    names: ["بندر سری بگاوان", "بندر سری بڬاوان", "Bandar Seri Begawan"],
    country: "BN",
    lng: 114.94222222222223,
    lat: 4.8902777777777775
  },
  {
    names: ["مارسی", "Ville de Marseille"],
    country: "FR",
    lng: 5.369999999999999,
    lat: 43.296388888888885
  },
  {
    names: ["موسایلیان", "Մուսայելյան"],
    country: "AM",
    lng: 43.93888888888888,
    lat: 40.99277777777778
  },
  {
    names: ["برییلا", "Brăila"],
    country: "RO",
    lng: 27.957472222222222,
    lat: 45.269194444444445
  },
  {
    names: ["نیوهیون، کنتیکت", "New Haven, Connecticut"],
    country: "US",
    lng: -72.92361111111111,
    lat: 41.309999999999995
  },
  {
    names: ["کورونووو"],
    country: "PL",
    lng: 17.933333333333334,
    lat: 53.31666666666667
  },
  {
    names: ["دلیسیاس", "Ciudad Delicias"],
    country: "MX",
    lng: -106.00222222222222,
    lat: 28.100833333333334
  },
  { names: ["همدان"], lng: 48.52, lat: 34.8 },
  {
    names: ["پارانا، انتره ریوس", "پارانا", "Paraná"],
    country: "AR",
    lng: -60.53333333333333,
    lat: -31.733333333333334
  },
  {
    names: ["کونیگزی", "Königsee"],
    country: "DE",
    lng: 11.097222222222223,
    lat: 50.66138888888889
  },
  {
    names: ["سردارآباد، ارمنستان", "هوکتمبر", "Հոկտեմբեր"],
    country: "AM",
    lng: 44.013888888888886,
    lat: 40.13611111111111
  },
  { names: ["خاش", "خواش"], lng: 61.2131, lat: 28.2197 },
  { names: ["درای‌آیش"], country: "DE", lng: 8.7, lat: 50 },
  {
    names: ["زانکت آگستین", "Sankt Augustin"],
    country: "DE",
    lng: 7.1866666666666665,
    lat: 50.769999999999996
  },
  {
    names: ["بارسلون", "(به اسپانیایی: Barcelona)"],
    country: "ES",
    lng: 2.18,
    lat: 41.38
  },
  {
    names: ["گلینده (اشتورمارن)", "Glinde"],
    country: "DE",
    lng: 10.21111111111111,
    lat: 53.54055555555556
  },
  {
    names: ["دبولن", "Dăbuleni"],
    country: "RO",
    lng: 24.091944444444444,
    lat: 43.801111111111105
  },
  {
    names: ["ماچالا", "San Antonio de Machala"],
    country: "EC",
    lng: -79.96666666666667,
    lat: -3.2666666666666666
  },
  { names: ["مولروزه"], country: "DE", lng: 14.416666666666666, lat: 52.25 },
  {
    names: ["سچورا", "Sechura"],
    country: "PE",
    lng: -80.8223,
    lat: -5.5575833333333335
  },
  {
    names: ["کولیکورو", "Koulikoro"],
    country: "ML",
    lng: -7.566666666666666,
    lat: 12.866666666666667
  },
  {
    names: ["مارک‌کلیبرگ"],
    country: "DE",
    lng: 12.383333333333333,
    lat: 51.27777777777778
  },
  {
    names: ["ساراوان، ارمنستان", "ساراوان", "Սարավան"],
    country: "AM",
    lng: 45.64833333333333,
    lat: 39.71888888888889
  },
  { names: ["سیدی سالم"], country: "EG", lng: 30.780809, lat: 31.272352 },
  {
    names: ["تاکوما، واشینگتن", "تاکوما", "City of Tacoma"],
    country: "US",
    lng: -122.45944444444444,
    lat: 47.24138888888889
  },
  {
    names: ["تسغوک", "Ծղուկ"],
    country: "AM",
    lng: 45.830555555555556,
    lat: 39.65416666666667
  },
  {
    names: ["دولمن", "Dülmen"],
    country: "DE",
    lng: 7.278333333333333,
    lat: 51.83083333333334
  },
  {
    names: ["پنوم‌پن", "پنوم پن", "Phnom-Penh", "ភ្នំពេញ"],
    country: "KH",
    lng: 104.91666666666667,
    lat: 11.55
  },
  { names: ["مهریز"], lng: 54.45, lat: 31.58 },
  {
    names: ["آچانان", "Աճանան"],
    country: "AM",
    lng: 46.43138888888889,
    lat: 39.234722222222224
  },
  {
    names: ["تاوریییسک", "Tavriysk", "Таврійськ"],
    country: "UA",
    lng: 33.416666666666664,
    lat: 46.75
  },
  {
    names: ["اوکلند، کالیفرنیا", "اوکلند", "Oakland"],
    country: "US",
    lng: -122.27083333333333,
    lat: 37.80444444444444
  },
  {
    names: ["آروادا، کلرادو"],
    country: "US",
    lng: -105.1111111111111,
    lat: 39.82
  },
  {
    names: ["رنشن"],
    country: "DE",
    lng: 8.010555555555555,
    lat: 48.58583333333333
  },
  {
    names: ["آهنیدزور", "Ահնիձոր"],
    country: "AM",
    lng: 44.82138888888889,
    lat: 40.91
  },
  {
    names: ["زبوریف", "Zboriv", "Зборів"],
    country: "UA",
    lng: 25.15,
    lat: 49.666666666666664
  },
  {
    names: ["سودرا سندبه", "Södra Sandby"],
    country: "SE",
    lng: 13.35,
    lat: 55.71666666666667
  },
  {
    names: ["گتاپنیا", "Գետափնյա"],
    country: "AM",
    lng: 44.4325,
    lat: 40.14055555555556
  },
  {
    names: ["پاغاغبیور", "Պաղաղբյուր"],
    country: "AM",
    lng: 44.11888888888889,
    lat: 41.17916666666667
  },
  {
    names: ["نورا (سوید)", "Nora"],
    country: "SE",
    lng: 15.033333333333333,
    lat: 59.516666666666666
  },
  { names: ["شچچین"], country: "PL", lng: 14.548055555555555, lat: 53.4325 },
  {
    names: ["آناهایم، کالیفرنیا", "آناهایم", "Anaheim"],
    country: "US",
    lng: -117.88972222222223,
    lat: 33.836111111111116
  },
  {
    names: ["شوغاکن", "Շողակն"],
    country: "AM",
    lng: 44.47944444444445,
    lat: 40.46944444444445
  },
  {
    names: ["تالسا، اکلاهما", "Tulsa, Oklahoma"],
    country: "US",
    lng: -95.93722222222223,
    lat: 36.13138888888889
  },
  {
    names: ["لوساکن", "Լուսակն"],
    country: "AM",
    lng: 43.833333333333336,
    lat: 40.3
  },
  {
    names: ["یرازگاوروس", "Երազգավորս"],
    country: "AM",
    lng: 43.766666666666666,
    lat: 40.7
  },
  {
    names: ["شوارتسنبرگ، زاکسن", "Schwarzenberg"],
    country: "DE",
    lng: 12.779166666666667,
    lat: 50.54527777777778
  },
  { names: ["بابل (بابل)", "بابِل"], lng: 52.44, lat: 36.34 },
  {
    names: ["ویرجینیا بیچ، ویرجینیا", "ویرجینیا بیچ", "Virginia Beach"],
    country: "US",
    lng: -75.9779,
    lat: 36.8506
  },
  {
    names: ["ولینیه", "Vellinge"],
    country: "SE",
    lng: 13.016666666666667,
    lat: 55.46666666666667
  },
  {
    names: ["راس سدر"],
    country: "EG",
    lng: 32.705555555555556,
    lat: 29.591666666666665
  },
  { names: ["پاوه"], lng: 46.363889, lat: 35.044111 },
  {
    names: ["سته لاگوآس", "Sete Lagoas"],
    country: "BR",
    lng: -44.246944444444445,
    lat: -19.465833333333332
  },
  {
    names: ["فاشا، آلمان", "Vacha"],
    country: "DE",
    lng: 10.02138888888889,
    lat: 50.82888888888889
  },
  {
    names: ["گموندن آم ماین", "Gemünden a.Main"],
    country: "DE",
    lng: 9.705555555555556,
    lat: 50.04972222222222
  },
  {
    names: ["ووغجابرد", "Ողջաբերդ"],
    country: "AM",
    lng: 44.64833333333333,
    lat: 40.16638888888889
  },
  {
    names: ["زولتسباخ (سار)", "Sulzbach"],
    country: "DE",
    lng: 7.066666666666666,
    lat: 49.28333333333333
  },
  {
    names: ["کامپچه٬ کامپچه", "کامپچه", "Campeche"],
    country: "MX",
    lng: -90.53055555555555,
    lat: 19.85
  },
  {
    names: ["آیوموری", "青森"],
    country: "JP",
    lng: 140.75,
    lat: 40.81666666666667
  },
  {
    names: ["باد ایبورگ"],
    country: "DE",
    lng: 8.047222222222222,
    lat: 52.159166666666664
  },
  {
    names: ["کروپلینگ"],
    country: "DE",
    lng: 11.783333333333333,
    lat: 54.06666666666667
  },
  {
    names: ["سریق", "Serik"],
    country: "TR",
    lng: 31.1,
    lat: 36.916666666666664
  },
  {
    names: ["وینستون-سیلم", "وینستون-سِیلم"],
    country: "US",
    lng: -80.26049166666667,
    lat: 36.10276388888889
  },
  {
    names: ["لاوفن آم نکا", "Lauffen"],
    country: "DE",
    lng: 9.15,
    lat: 49.083333333333336
  },
  {
    names: ["باردزراوان", "Բարձրավան"],
    country: "AM",
    lng: 46.32972222222222,
    lat: 39.397777777777776
  },
  {
    names: ["استان سوددانمارک", "Region Syddanmark"],
    country: "DK",
    lng: 9.666666666666666,
    lat: 55.333333333333336
  },
  {
    names: ["جراشن، آرارات", "جراشن", "Ջրաշեն"],
    country: "AM",
    lng: 44.513333333333335,
    lat: 40.05472222222222
  },
  { names: ["نظرآباد"], lng: 51.4639, lat: 35.4742 },
  {
    names: ["صنعا", "صنعاء", "Sanaa"],
    country: "YE",
    lng: 44.20638888888889,
    lat: 15.348333333333334
  },
  {
    names: ["آنیپمزا", "Անիպեմզա"],
    country: "AM",
    lng: 43.60416666666667,
    lat: 40.448611111111106
  },
  {
    names: ["باد مرگنت‌هایم"],
    country: "DE",
    lng: 9.766666666666667,
    lat: 49.5
  },
  {
    names: ["آیو", "Aue"],
    country: "DE",
    lng: 12.700555555555555,
    lat: 50.588055555555556
  },
  {
    names: ["تالنه", "Talne", "Тальне"],
    country: "UA",
    lng: 30.704166666666666,
    lat: 48.88861111111111
  },
  {
    names: ["کاماریس", "Կամարիս"],
    country: "AM",
    lng: 44.693888888888885,
    lat: 40.23583333333333
  },
  { names: ["گراده‌لگن"], country: "DE", lng: 11.3925, lat: 52.52638888888889 },
  {
    names: ["موگادیشو", "Mogadishu", "مقدیشو"],
    country: "SO",
    lng: 45.35,
    lat: 2.033333333333333
  },
  {
    names: ["یشیل‌یورت", "Yeşilyurt"],
    country: "TR",
    lng: 28.45,
    lat: 37.31666666666667
  },
  {
    names: ["کایزرسلاوترن"],
    country: "DE",
    lng: 7.768888888888889,
    lat: 49.44472222222222
  },
  {
    names: ["ثاندر بی", "Thunder Bay"],
    country: "CA",
    lng: -89.2461111111111,
    lat: 48.382222222222225
  },
  {
    names: ["هووک", "Հովք"],
    country: "AM",
    lng: 45.0225,
    lat: 40.79111111111111
  },
  {
    names: ["اردک (شهر)", "اردک"],
    country: "TR",
    lng: 27.793055555555558,
    lat: 40.39861111111111
  },
  {
    names: ["شاملوغ", "Շամլուղ"],
    country: "AM",
    lng: 44.7075,
    lat: 41.168055555555554
  },
  { names: ["فرایبورگ"], country: "DE", lng: 7.85, lat: 47.983333333333334 },
  {
    names: ["اسماعیل (ترکیه)", "İsmil"],
    country: "TR",
    lng: 33.05,
    lat: 37.71666666666667
  },
  {
    names: ["برکاشات", "Բերքաշատ"],
    country: "AM",
    lng: 43.916666666666664,
    lat: 40.05
  },
  {
    names: ["مراکش (شهر)", "مراکش", "Merrakec"],
    country: "MA",
    lng: -8.866666666666667,
    lat: 30.466666666666665
  },
  {
    names: ["شوارتسنبورن (کنول)", "Schwarzenborn"],
    country: "DE",
    lng: 9.433333333333334,
    lat: 50.916666666666664
  },
  {
    names: ["سوسورلوک"],
    country: "TR",
    lng: 28.160277777777775,
    lat: 39.913888888888884
  },
  {
    names: ["برمرفورده", "Bremervörde"],
    country: "DE",
    lng: 9.133333333333333,
    lat: 53.483333333333334
  },
  {
    names: ["نتیشین", "Netishyn", "Нетішин"],
    country: "UA",
    lng: 26.633333333333333,
    lat: 50.35
  },
  {
    names: ["کاغتسراشن", "Քաղցրաշեն"],
    country: "AM",
    lng: 44.61666666666667,
    lat: 39.96666666666667
  },
  { names: ["مارک‌اشتفل"], country: "DE", lng: 10.116666666666667, lat: 49.7 },
  {
    names: ["هورزنس", "Horsens"],
    country: "DK",
    lng: 9.833333333333334,
    lat: 55.86666666666667
  },
  {
    names: ["گیورگه", "Gheorgheni", "Gyergyószentmiklós"],
    country: "RO",
    lng: 25.59,
    lat: 46.72
  },
  {
    names: ["نویاکرت", "Նոյակերտ"],
    country: "AM",
    lng: 44.66694444444444,
    lat: 39.81666666666667
  },
  { names: ["تورگلو"], country: "DE", lng: 14, lat: 53.61666666666667 },
  {
    names: ["ویکتوریا (سیشل)", "ویکتوریا", "Victoria"],
    country: "SC",
    lng: 55.45444444444445,
    lat: -4.623611111111112
  },
  {
    names: ["لایپزیگ"],
    country: "DE",
    lng: 12.383333333333333,
    lat: 51.333333333333336
  },
  {
    names: ["کاغسی", "Քաղսի"],
    country: "AM",
    lng: 44.74111111111111,
    lat: 40.480555555555554
  },
  {
    names: ["نارک، آرارات", "نارک", "Նարեկ"],
    country: "AM",
    lng: 44.61666666666667,
    lat: 40.016666666666666
  },
  {
    names: ["کاوکاسیا (انتیوکیا)", "Caucasia, Antioquia"],
    country: "CO",
    lng: -75.2,
    lat: -7.983333333333333
  },
  {
    names: ["مس‌اشتتن"],
    country: "DE",
    lng: 8.962499999999999,
    lat: 48.18055555555555
  },
  {
    names: ["بنیامین، ارمنستان", "بنیامین", "Բենիամին"],
    country: "AM",
    lng: 43.85,
    lat: 40.68333333333333
  },
  {
    names: ["ردا-ویدنبورک", "Rheda-Wiedenbrück"],
    country: "DE",
    lng: 8.3,
    lat: 51.84166666666667
  },
  {
    names: ["شریزهایم"],
    country: "DE",
    lng: 8.659166666666668,
    lat: 49.47361111111111
  },
  {
    names: ["کرایووا", "(به رومانیایی: Craiova)"],
    country: "RO",
    lng: 23.816666666666666,
    lat: 44.333333333333336
  },
  {
    names: ["یوبرلاندیا", "Uberlândia"],
    country: "BR",
    lng: -48.28861111111111,
    lat: -18.923055555555557
  },
  { names: ["گرنادا"], lng: -61.75, lat: 12.05 },
  {
    names: ["آق‌تپه (ترکیه)", "Aktepe"],
    country: "TR",
    lng: 36.483333333333334,
    lat: 36.7
  },
  { names: ["خرم‌آباد", "خورمووه"], lng: 48.35, lat: 33.48 },
  {
    names: ["دبت، ارمنستان", "دبت", "Դեբետ"],
    country: "AM",
    lng: 44.649166666666666,
    lat: 40.9175
  },
  {
    names: ["اولان‌باتور", "(الفبای سیریلیک:Улаанбаатар)"],
    country: "MN",
    lng: 106.91666666666667,
    lat: 47.916666666666664
  },
  { names: ["عمان"], lng: 58.55, lat: 23.6 },
  {
    names: ["بوزکیر", "Bozkır"],
    country: "TR",
    lng: 32.25,
    lat: 37.18333333333333
  },
  { names: ["اواچو", "Huacho"], country: "PE", lng: -77.6, lat: -11.1 },
  { names: ["ژنین، لهستان", "ژنین"], country: "PL", lng: 17.7, lat: 52.85 },
  {
    names: ["گرلیتز"],
    country: "DE",
    lng: 14.987222222222222,
    lat: 51.15277777777778
  },
  {
    names: ["لرنانیست", "Լեռնանիստ"],
    country: "AM",
    lng: 44.79805555555556,
    lat: 40.4675
  },
  {
    names: ["مانایوره (لا گواخیرا)", "Manaure"],
    country: "CO",
    lng: 72.44944444444445,
    lat: 11.779166666666667
  },
  {
    names: ["گریس فیورد", "ᐊᐅᔪᐃᑦᑐᖅ", "Aujuittuq"],
    country: "CA",
    lng: -82.8938888888889,
    lat: 76.4175
  },
  {
    names: ["اوماها، نبراسکا", "City of Omaha"],
    country: "US",
    lng: -96,
    lat: 41.25
  },
  { names: ["نکااشتاینناخ"], country: "DE", lng: 8.833333333333334, lat: 49.4 },
  {
    names: ["ویزه (ترکیه)", "Vize"],
    country: "TR",
    lng: 27.76527777777778,
    lat: 41.57361111111111
  },
  {
    names: ["واگادوگو"],
    country: "BF",
    lng: -1.5352777777777777,
    lat: 12.357222222222221
  },
  {
    names: ["پیوریا، آریزونا"],
    country: "US",
    lng: -112.23861111111111,
    lat: 33.5825
  },
  {
    names: ["کلهایم"],
    country: "DE",
    lng: 11.866666666666667,
    lat: 48.916666666666664
  },
  {
    names: ["آلب‌اشتاد"],
    country: "DE",
    lng: 9.023888888888889,
    lat: 48.21194444444445
  },
  { names: ["مانشان", "马鞍山市"], country: "CN", lng: 118.35, lat: 31.7 },
  {
    names: ["سلتشوبدن", "Saltsjöbaden"],
    country: "SE",
    lng: 18.287222222222223,
    lat: 59.28611111111111
  },
  {
    names: ["فوکویوکا", "شهر فوکویوکا", "福岡"],
    country: "JP",
    lng: 130.4,
    lat: 33.583333333333336
  },
  {
    names: ["آبوویان", "Աբովյան"],
    country: "AM",
    lng: 44.62555555555556,
    lat: 40.27388888888889
  },
  {
    names: ["ترگو ژی", "Târgu Jiu"],
    country: "RO",
    lng: 23.27472222222222,
    lat: 45.034166666666664
  },
  {
    names: ["رادبرگ"],
    country: "DE",
    lng: 13.916666666666666,
    lat: 51.11666666666667
  },
  {
    names: ["دربند (روسیه)", "دربند", "Дербент"],
    country: "RU",
    lng: 48.3,
    lat: 42.05
  },
  { names: ["سرپل ذهاب"], lng: 45.8647222, lat: 34.4613889 },
  { names: ["ماتورین"], country: "", lng: -63.183, lat: 9.75 },
  { names: ["لماتسش"], country: "DE", lng: 13.3, lat: 51.2 },
  {
    names: ["مولهایم آم ماین"],
    country: "DE",
    lng: 8.916666666666666,
    lat: 50.11666666666667
  },
  {
    names: ["لر، نیدرزاکسن", "Leer"],
    country: "DE",
    lng: 7.452777777777778,
    lat: 53.23083333333334
  },
  { names: ["کیشیناو"], country: "MD", lng: 28.916666666666668, lat: 47 },
  {
    names: ["جراشن، آرماویر", "جراشن", "Ջրաշեն"],
    country: "AM",
    lng: 44.016666666666666,
    lat: 40.083333333333336
  },
  {
    names: ["زاگرب", "Zagreb"],
    country: "HR",
    lng: 15.983333333333333,
    lat: 45.81666666666667
  },
  {
    names: ["واحات البحریه"],
    country: "EG",
    lng: 28.86238888888889,
    lat: 28.35148888888889
  },
  {
    names: ["بیستریتسا", "Bistriţa"],
    country: "RO",
    lng: 24.5,
    lat: 47.13333333333333
  },
  {
    names: ["ونکنیتسا"],
    country: "PL",
    lng: 14.739166666666666,
    lat: 51.538333333333334
  },
  {
    names: ["آکناشن", "Ակնաշեն"],
    country: "AM",
    lng: 44.28611111111111,
    lat: 40.09583333333334
  },
  { names: ["تتنانگ"], country: "DE", lng: 9.5875, lat: 47.670833333333334 },
  {
    names: ["ابجورال", "Abejorral"],
    country: "CO",
    lng: -75.43333333333334,
    lat: 5.8
  },
  { names: ["پوردنونه"], country: "IT", lng: 12.65, lat: 45.96666666666667 },
  {
    names: ["گدنیا", "Gdynia"],
    country: "PL",
    lng: 18.533333333333335,
    lat: 54.5
  },
  {
    names: ["نسیو", "Năsăud"],
    country: "RO",
    lng: 24.406666666666666,
    lat: 47.28333333333333
  },
  { names: ["اومیو"], country: "SE", lng: 20.26388888888889, lat: 63.825 },
  {
    names: ["موندرکینگن"],
    country: "DE",
    lng: 9.643888888888888,
    lat: 48.23527777777778
  },
  {
    names: ["وایادولید", "(به اسپانیایی: Valladolid)"],
    country: "ES",
    lng: -4.716666666666667,
    lat: 41.63333333333333
  },
  {
    names: ["دالار، ارمنستان", "دالار", "Դալար"],
    country: "AM",
    lng: 44.53638888888889,
    lat: 39.966944444444444
  },
  {
    names: ["آرتیمت", "Արտիմետ"],
    country: "AM",
    lng: 44.26638888888889,
    lat: 40.15138888888889
  },
  {
    names: ["سفله", "Säffle"],
    country: "SE",
    lng: 12.933333333333334,
    lat: 59.13333333333333
  },
  {
    names: ["هرتسوگن‌آوراخ", "Herzogenaurach"],
    country: "DE",
    lng: 10.883333333333333,
    lat: 49.56666666666667
  },
  {
    names: ["هارژیس", "Հարժիս"],
    country: "AM",
    lng: 46.22166666666667,
    lat: 39.43333333333333
  },
  {
    names: ["مونتسنبرگ (هسن)", "Münzenberg"],
    country: "DE",
    lng: 8.776111111111112,
    lat: 50.45333333333333
  },
  {
    names: ["نیگاتا", "新潟"],
    country: "JP",
    lng: 139.0363888888889,
    lat: 37.91611111111111
  },
  {
    names: ["بارانکاورمخا", "Barrancabermeja"],
    country: "CO",
    lng: -73.85,
    lat: 7.066666666666666
  },
  {
    names: ["مینسک", "مینسْک", "Мінск"],
    country: "BY",
    lng: 27.566666666666666,
    lat: 53.9
  },
  {
    names: ["چیفته‌لر", "Çifteler"],
    country: "TR",
    lng: 31.033333333333335,
    lat: 39.38333333333333
  },
  {
    names: ["ییلدیزلی"],
    country: "TR",
    lng: 36.598333333333336,
    lat: 39.86416666666667
  },
  {
    names: ["تاوزند اوکس"],
    country: "US",
    lng: -118.875,
    lat: 34.18944444444444
  },
  {
    names: ["خارطوم", "الخرطوم"],
    country: "SD",
    lng: 32.533055555555556,
    lat: 15.633055555555556
  },
  { names: ["راتینگن"], country: "DE", lng: 6.85, lat: 51.3 },
  {
    names: ["کوزوجولو", "Kuzuculu", "Kuzulu"],
    country: "TR",
    lng: 36.233333333333334,
    lat: 36.88333333333333
  },
  {
    names: ["تریسته", "Trst", "Trieste"],
    country: "IT",
    lng: 13.8,
    lat: 45.63333333333333
  },
  {
    names: ["روث بای نورنبرگ", "Roth"],
    country: "DE",
    lng: 11.091111111111111,
    lat: 49.24611111111111
  },
  { names: ["یالیوره", "Gällivare"], country: "SE", lng: 20.66, lat: 67.13 },
  {
    names: ["بیترفلد-ولفن", "Bitterfeld-Wolfen"],
    country: "DE",
    lng: 12.316666666666666,
    lat: 51.61666666666667
  },
  {
    names: ["پامباک، لوری", "پامباک", "Փամբակ"],
    country: "AM",
    lng: 44.55611111111111,
    lat: 40.836111111111116
  },
  { names: ["آرژانتین"], lng: 13.4, lat: 52.516666666666666 },
  {
    names: ["ادرنه", "Edirne"],
    country: "TR",
    lng: 26.566666666666666,
    lat: 41.666666666666664
  },
  {
    names: ["بافلو، نیویورک", "بافلو", "City of Buffalo"],
    country: "US",
    lng: -78.84944444444444,
    lat: 42.90472222222222
  },
  {
    names: ["آرتانیش", "Արտանիշ"],
    country: "AM",
    lng: 45.364444444444445,
    lat: 40.49722222222222
  },
  {
    names: ["سری جایاواردنپورا کوته", "ஸ்ரீ ஜயவர்த்தனபுரம் கோட்டே"],
    country: "LK",
    lng: 79.88777777777779,
    lat: 6.910833333333334
  },
  {
    names: ["هاپاراندا"],
    country: "SE",
    lng: 24.133333333333333,
    lat: 65.83333333333333
  },
  {
    names: ["ورین بازمابرد", "Վերին Բազմաբերդ"],
    country: "AM",
    lng: 44.016666666666666,
    lat: 40.36666666666667
  },
  {
    names: ["هلسینگبوری", "Helsingborg"],
    country: "SE",
    lng: 12.716666666666667,
    lat: 56.05
  },
  {
    names: ["دیردورف"],
    country: "DE",
    lng: 7.6594444444444445,
    lat: 50.54888888888889
  },
  {
    names: ["باد ویلدونگن"],
    country: "DE",
    lng: 9.116666666666667,
    lat: 51.11666666666667
  },
  { names: ["آیگپات", "Այգեպատ"], country: "AM", lng: 44.6, lat: 39.95 },
  {
    names: ["گوشنیتز"],
    country: "DE",
    lng: 12.432777777777778,
    lat: 50.890277777777776
  },
  {
    names: ["باردزراشن، آرارات", "باردزراشن", "Բարձրաշեն"],
    country: "AM",
    lng: 44.578611111111115,
    lat: 40.08527777777778
  },
  {
    names: ["ویلکووه", "Vylkove", "Вилкове"],
    country: "UA",
    lng: 29.583333333333332,
    lat: 45.4
  },
  {
    names: ["تولوز", "Toulouse"],
    country: "FR",
    lng: 1.443888888888889,
    lat: 43.60444444444445
  },
  {
    names: ["آلسفلد"],
    country: "DE",
    lng: 9.271111111111113,
    lat: 50.75111111111111
  },
  {
    names: ["تاکاماتسو، کاگاوا", "Takamatsu", "高松"],
    country: "JP",
    lng: 134.05,
    lat: 34.35
  },
  {
    names: ["تورانس، کالیفرنیا", "تورانس", "City of Torrance"],
    country: "US",
    lng: -118.34138888888889,
    lat: 33.834722222222226
  },
  {
    names: ["لار، بادن-وورتمبرگ", "Lahr"],
    country: "DE",
    lng: 7.872222222222223,
    lat: 48.33916666666667
  },
  { names: ["کانادا"], lng: -75.66666666666667, lat: 45.4 },
  {
    names: ["باد برام‌اشتت"],
    country: "DE",
    lng: 9.884444444444444,
    lat: 53.91861111111111
  },
  {
    names: ["ترنتو"],
    country: "IT",
    lng: 11.116666666666667,
    lat: 46.06666666666667
  },
  {
    names: ["وانزلبن-وورده"],
    country: "DE",
    lng: 11.433333333333334,
    lat: 52.06666666666667
  },
  {
    names: ["لوکاشین", "Լուկաշին"],
    country: "AM",
    lng: 44.01861111111111,
    lat: 40.17583333333333
  },
  {
    names: ["هالیدزور", "Հալիձոր"],
    country: "AM",
    lng: 46.29527777777778,
    lat: 39.41027777777778
  },
  {
    names: ["انکوریج", "Anchorage"],
    country: "US",
    lng: -149.9,
    lat: 61.21666666666667
  },
  {
    names: ["کایسدونیا", "Caicedonia"],
    country: "CO",
    lng: -75.83333333333333,
    lat: 4.333333333333333
  },
  {
    names: ["آیگستان", "Այգեստան"],
    country: "AM",
    lng: 44.5575,
    lat: 40.03055555555555
  },
  {
    names: ["راگوسا", "Ragusa"],
    country: "IT",
    lng: 14.75,
    lat: 36.93333333333333
  },
  {
    names: ["حلب", "حَلب"],
    country: "SY",
    lng: 37.166666666666664,
    lat: 36.21666666666667
  },
  {
    names: ["ساری‌گل (شهر)", "Sarıgöl"],
    country: "TR",
    lng: 28.7,
    lat: 38.233333333333334
  },
  {
    names: ["زدا", "Զեդեա"],
    country: "AM",
    lng: 45.391666666666666,
    lat: 39.68194444444444
  },
  {
    names: ["هوروخیف", "Horokhiv"],
    country: "UA",
    lng: 24.765,
    lat: 50.49944444444444
  },
  {
    names: ["شوالم‌اشتات"],
    country: "DE",
    lng: 9.216666666666667,
    lat: 50.93333333333333
  },
  {
    names: ["ساسونیک", "Սասունիկ"],
    country: "AM",
    lng: 44.338055555555556,
    lat: 40.24722222222222
  },
  {
    names: ["سیکه", "Syke"],
    country: "DE",
    lng: 8.826944444444445,
    lat: 52.91305555555555
  },
  {
    names: ["بیله هرکولانه", "Băile Herculane"],
    country: "RO",
    lng: 22.414166666666667,
    lat: 44.87861111111111
  },
  {
    names: ["کاراپینار", "Karapınar"],
    country: "TR",
    lng: 33.55,
    lat: 37.71666666666667
  },
  { names: ["نیتناو"], country: "DE", lng: 12.266666666666667, lat: 49.2 },
  { names: ["بوتزو"], country: "DE", lng: 11.983333333333333, lat: 53.85 },
  {
    names: ["آسونسیون", "Asunción"],
    country: "PY",
    lng: -57.666666666666664,
    lat: 25.266666666666666
  },
  { names: ["ایکیتوس"], country: "PE", lng: -73.25, lat: -3.7333333333333334 },
  {
    names: ["یناکییف", "Yenakiieve", "Єнакієве"],
    country: "UA",
    lng: 38.2,
    lat: 48.21666666666667
  },
  {
    names: [
      "پیر، داکوتای جنوبی",
      "پیِر، داکوتای جنوبی",
      "Pierre, South Dakota"
    ],
    country: "US",
    lng: -100.33638888888889,
    lat: 44.36805555555556
  },
  {
    names: ["گرسفلد (رون)", "Gersfeld"],
    country: "DE",
    lng: 9.916666666666666,
    lat: 50.45
  },
  {
    names: ["نورمن، اکلاهما", "Norman, Oklahoma"],
    country: "US",
    lng: -97.41666666666667,
    lat: 35.21666666666667
  },
  {
    names: ["سانتاندر", "(به اسپانیایی: Santander)"],
    country: "ES",
    lng: -3.8049999999999997,
    lat: 43.46277777777778
  },
  {
    names: ["کامپوس", "Κάμπος"],
    country: "CY",
    lng: 32.73222222222223,
    lat: 35.04055555555556
  },
  { names: ["چوپا"], country: "DE", lng: 13.066666666666666, lat: 50.75 },
  {
    names: ["کومرو", "Kumru"],
    country: "TR",
    lng: 37.266666666666666,
    lat: 40.86666666666667
  },
  {
    names: ["اوستروه", "Ostroh", "Острог", "Ostróg"],
    country: "UA",
    lng: 26.516666666666666,
    lat: 50.333333333333336
  },
  {
    names: ["آردشن"],
    country: "TR",
    lng: 40.81666666666667,
    lat: 41.18333333333333
  },
  {
    names: ["بیگادیچ", "Bigadiç"],
    country: "TR",
    lng: 28.13111111111111,
    lat: 39.3925
  },
  { names: ["ارندزی"], country: "DE", lng: 11.4867, lat: 52.8767 },
  { names: ["هورودنکا"], country: "UA", lng: 25.50027777777778, lat: 48.6675 },
  {
    names: ["نمورو، هوکایدو", "Nemuro", "根室"],
    country: "JP",
    lng: 145.58333333333334,
    lat: 43.333333333333336
  },
  {
    names: ["رویتلینگن"],
    country: "DE",
    lng: 9.216666666666667,
    lat: 48.483333333333334
  },
  {
    names: ["رتنبورگ آن در وومه"],
    country: "DE",
    lng: 9.396944444444443,
    lat: 53.106944444444444
  },
  {
    names: ["آکونک، کوتایک", "آکونک", "Ակունք"],
    country: "AM",
    lng: 44.683611111111105,
    lat: 40.26916666666666
  },
  { names: ["بنها"], country: "EG", lng: 31.1875, lat: 30.460833333333333 },
  {
    names: ["میزیل", "Mizil"],
    country: "RO",
    lng: 26.440555555555555,
    lat: 45
  },
  {
    names: ["فبورگ آن در دانوب", "Vohburg a.d.Donau"],
    country: "DE",
    lng: 11.616666666666667,
    lat: 48.766666666666666
  },
  {
    names: ["خوزناوار", "Խոզնավար"],
    country: "AM",
    lng: 46.35583333333334,
    lat: 39.62138888888889
  },
  {
    names: ["نوووهراد-وولینسکیی", "Novohrad-Volynskyi", "Новоград-Волинський"],
    country: "UA",
    lng: 27.633333333333333,
    lat: 50.583333333333336
  },
  {
    names: ["نوی‌اشتات این زاکسن"],
    country: "DE",
    lng: 14.216666666666667,
    lat: 51.02388888888889
  },
  {
    names: ["گاردن گروو، کالیفرنیا", "City of Garden Grove"],
    country: "US",
    lng: -117.96027777777778,
    lat: 33.778888888888886
  },
  {
    names: ["پوگانل", "Pogoanele"],
    country: "RO",
    lng: 27,
    lat: 44.916666666666664
  },
  {
    names: ["ریورساید، کالیفرنیا", "ریورساید"],
    country: "",
    lng: -117.39612777777778,
    lat: 33.94806388888889
  },
  {
    names: ["بالتیمور", "Baltimore"],
    country: "US",
    lng: -76.61666666666666,
    lat: 39.28333333333333
  },
  {
    names: ["سانتاکروس (نارینیو)", "Santacruz"],
    country: "CO",
    lng: -77.67722222222223,
    lat: 1.2219444444444445
  },
  {
    names: ["ارگانی"],
    country: "TR",
    lng: 39.76166666666666,
    lat: 38.26916666666666
  },
  {
    names: ["الابیض (سودان)", "الابیض"],
    country: "SD",
    lng: 30.216666666666665,
    lat: 13.183333333333334
  },
  {
    names: ["ورناو (نکا)"],
    country: "DE",
    lng: 9.422222222222222,
    lat: 48.68861111111111
  },
  {
    names: ["زولوتونوشا", "Zolotonosha", "Золотоноша"],
    country: "",
    lng: 32.03333333333333,
    lat: 49.666666666666664
  },
  { names: ["وزیرکوپرو", "Vezirköprü"], country: "TR", lng: 35.45, lat: 41.15 },
  {
    names: ["نوفوسلتسوفو", "Նովոսելցովո"],
    country: "AM",
    lng: 44.266666666666666,
    lat: 41.06666666666667
  },
  {
    names: ["کیتو", "Quito"],
    country: "EC",
    lng: -78.58333333333333,
    lat: -0.25
  },
  { names: ["فراشبند", "فَرّوشبَند"], lng: 52.5, lat: 28.52 },
  { names: ["ویسبادن"], country: "DE", lng: 8.241377, lat: 50.082054 },
  {
    names: ["سکورا", "Skara"],
    country: "SE",
    lng: 13.433333333333334,
    lat: 58.38333333333333
  },
  {
    names: ["استنلی، جزایر فالکلند"],
    country: "GB",
    lng: -57.8589,
    lat: -51.692099999999996
  },
  {
    names: ["اورگوپ", "Ürgüp"],
    country: "TR",
    lng: 34.916666666666664,
    lat: 38.63333333333333
  },
  {
    names: ["کاراکاس", "Caracas"],
    country: "VE",
    lng: -66.91666666666667,
    lat: 10.5
  },
  {
    names: ["وایل آن در راین", "Weil am Rhein"],
    country: "DE",
    lng: 7.610833333333333,
    lat: 47.594722222222224
  },
  {
    names: ["خارطوم", "الخرطوم"],
    country: "SD",
    lng: 32.533055555555556,
    lat: 15.633055555555556
  },
  {
    names: ["بندر سری بگاوان", "بندر سری بڬاوان", "Bandar Seri Begawan"],
    country: "BN",
    lng: 114.94222222222223,
    lat: 4.8902777777777775
  },
  {
    names: ["نارینیو (کوندینامارکا)"],
    country: "CO",
    lng: -74.82805555555555,
    lat: 4.398055555555556
  },
  {
    names: ["لیسیچانسک", "Lysychansk", "Лисичанськ"],
    country: "UA",
    lng: 38.4,
    lat: 48.916666666666664
  },
  {
    names: ["نورفک، ویرجینیا", "Norfolk, Virginia"],
    country: "US",
    lng: -76.20694444444445,
    lat: 36.91
  },
  {
    names: ["نیوآرک، نیوجرسی", "نیوآرک", "Newark"],
    country: "US",
    lng: -74.185,
    lat: 40.73527777777778
  },
  {
    names: ["اوکلند، کالیفرنیا", "اوکلند", "Oakland"],
    country: "US",
    lng: -122.27083333333333,
    lat: 37.80444444444444
  },
  { names: ["کانواس"], country: "BR", lng: -51.18, lat: -29.92 },
  {
    names: ["کنیتلینگن"],
    country: "DE",
    lng: 8.756944444444445,
    lat: 49.02388888888889
  },
  {
    names: ["بولینتین-وله", "Bolintin-Vale"],
    country: "RO",
    lng: 25.75722222222222,
    lat: 44.447222222222216
  },
  { names: ["بویو", "Boo"], country: "SE", lng: 18.25, lat: 59.31666666666667 },
  {
    names: ["ریو دو ژانیرو"],
    lng: -43.19638888888888,
    lat: -22.90833333333333
  },
  {
    names: ["تبسه، الجزایر", "تبسه", "Tibesti / البرج"],
    country: "DZ",
    lng: 8.116666666666667,
    lat: 35.4
  },
  { names: ["اینگلفینگل"], country: "DE", lng: 9.65, lat: 49.3 },
  { names: ["کرمان", "نام محلی:کِرمون"], lng: 57.06, lat: 30.29 },
  {
    names: ["کیرشن"],
    country: "DE",
    lng: 7.883333333333333,
    lat: 50.808611111111105
  },
  {
    names: ["قیصریه (ترکیه)", "قیصریه", "Kayseri"],
    country: "TR",
    lng: 35.483333333333334,
    lat: 38.733333333333334
  },
  {
    names: ["ماچالا", "San Antonio de Machala"],
    country: "EC",
    lng: -79.96666666666667,
    lat: -3.2666666666666666
  },
  {
    names: ["ولورهمپتون", "City of Wolverhampton"],
    country: "GB",
    lng: -2.1333333333333333,
    lat: 52.583333333333336
  },
  { names: ["بوشلو"], country: "DE", lng: 10.725, lat: 48.0375 },
  {
    names: ["آردنیس", "Արդենիս"],
    country: "AM",
    lng: 43.723888888888894,
    lat: 41.078611111111115
  },
  { names: ["مونشبرگ"], country: "DE", lng: 11.766666666666667, lat: 50.2 },
  {
    names: ["باد دورهایم"],
    country: "DE",
    lng: 8.533333333333333,
    lat: 48.016666666666666
  },
  { names: ["قزوین", "کاسپین"], lng: 50, lat: 36.16 },
  {
    names: ["احمدآباد (هند)", "احمدآباد", "અમદાવાદ"],
    country: "IN",
    lng: 72.58,
    lat: 23.03
  },
  { names: ["پاستو", "Pásztó"], country: "HU", lng: 19.71442, lat: 47.9202 },
  {
    names: ["لرناگیوغ", "Լեռնագյուղ"],
    country: "AM",
    lng: 43.916666666666664,
    lat: 40.95
  },
  {
    names: ["چیکولواپان"],
    country: "MX",
    lng: -98.90111111111112,
    lat: 19.415277777777778
  },
  {
    names: ["منطقه مایوله", "Maule Region", "VII Región del Maule"],
    country: "CL",
    lng: -71.66666666666667,
    lat: -35.43333333333333
  },
  {
    names: ["کواکنبورک"],
    country: "DE",
    lng: 7.9575000000000005,
    lat: 52.67722222222222
  },
  {
    names: ["هاغتاناک، تاووش", "Հաղթանակ"],
    country: "AM",
    lng: 44.937777777777775,
    lat: 41.223888888888894
  },
  {
    names: ["ماسیو", "Maceió, Alagoas, Brasil"],
    country: "BR",
    lng: -35.735,
    lat: -9.665833333333333
  },
  {
    names: ["لوبونگ"],
    country: "PL",
    lng: 16.883333333333333,
    lat: 52.333333333333336
  },
  {
    names: ["لیندسدال", "Lindsdal"],
    country: "SE",
    lng: 16.3,
    lat: 56.733333333333334
  },
  {
    names: ["دالبی، لوند", "Dalby"],
    country: "SE",
    lng: 13.35,
    lat: 55.666666666666664
  },
  {
    names: ["تینگو ماریا", "Tingo María"],
    country: "PE",
    lng: -75.9975,
    lat: -9.295277777777777
  },
  { names: ["دهبارز"], lng: 57.1925, lat: 27.440833 },
  {
    names: ["لکهنو", "Lucknow", "लखनऊ"],
    country: "IN",
    lng: 80.947,
    lat: 26.847
  },
  {
    names: ["شوبیش هال"],
    country: "DE",
    lng: 9.737499999999999,
    lat: 49.11222222222222
  },
  {
    names: ["هراره", "Harare", "Salisbury"],
    country: "ZW",
    lng: 31.029722222222222,
    lat: -17.86388888888889
  },
  { names: ["سنندج", "سنه"], lng: 46.9989, lat: 35.3172 },
  {
    names: ["بویناونتورا (واییه دل کایوکا)", "Buenaventura"],
    country: "CO",
    lng: -77.06666666666666,
    lat: 3.8833333333333333
  },
  {
    names: ["دوسکبراداس", "Dosquebradas"],
    country: "CO",
    lng: -75.68333333333334,
    lat: 4.833333333333333
  },
  {
    names: ["شرتنز", "Schortens"],
    country: "DE",
    lng: 7.95,
    lat: 53.53333333333333
  },
  {
    names: ["سنت جانز", "سینت جانز", "St. John's"],
    country: "AG",
    lng: -61.85,
    lat: 17.116666666666667
  },
  {
    names: ["فریدینگن آن در دانوب"],
    country: "DE",
    lng: 8.932777777777778,
    lat: 48.02055555555555
  },
  {
    names: ["والتا", "Il-Belt Valletta", "Ċittà Umilissima"],
    country: "MT",
    lng: 14.5125,
    lat: 35.897777777777776
  },
  {
    names: ["هربینکا", "Гребінка"],
    country: "UA",
    lng: 32.416666666666664,
    lat: 50.11666666666667
  },
  { names: ["زنجان", "زنگان"], lng: 48.4856, lat: 36.6644 },
  {
    names: ["کامپوباسو"],
    country: "IT",
    lng: 14.666666666666666,
    lat: 41.56666666666667
  },
  {
    names: ["شوارتسنباخ آن در زاله", "Schwarzenbach a.d.Saale"],
    country: "DE",
    lng: 11.933333333333334,
    lat: 50.22083333333334
  },
  {
    names: ["ماگدبورگ"],
    country: "DE",
    lng: 11.616666666666667,
    lat: 52.13333333333333
  },
  {
    names: ["براونشوایگ"],
    country: "DE",
    lng: 10.516666666666667,
    lat: 52.266666666666666
  },
  {
    names: ["شناوان، آراگاتسوتن", "شناوان", "Շենավան"],
    country: "AM",
    lng: 44.38138888888889,
    lat: 40.48305555555556
  },
  { names: ["ایلام", "ییلام،"], lng: 46.26, lat: 33.38 },
  {
    names: ["مرگاشن", "Մրգաշեն"],
    country: "AM",
    lng: 44.54222222222222,
    lat: 40.285
  },
  {
    names: ["پورتو کارنو"],
    country: "CO",
    lng: -67.46666666666667,
    lat: 6.183333333333334
  },
  {
    names: ["لاکوییلا", "L'Aquila"],
    country: "IT",
    lng: 11.281111111111112,
    lat: 46.45805555555556
  },
  {
    names: ["نور خاچاکاپ", "Նոր Խաչակապ"],
    country: "AM",
    lng: 44.362500000000004,
    lat: 40.8425
  },
  {
    names: ["سن سباستین", "(به اسپانیایی: San Sebastián)"],
    country: "ES",
    lng: -1.9855555555555555,
    lat: 43.32138888888889
  },
  {
    names: ["لچه", "Lecce"],
    country: "IT",
    lng: 18.166666666666668,
    lat: 40.35
  },
  {
    names: ["ایوسکیرش"],
    country: "DE",
    lng: 6.791666666666667,
    lat: 50.65972222222222
  },
  {
    names: ["یالواچ", "Yalvaç"],
    country: "TR",
    lng: 31.18,
    lat: 38.29555555555555
  },
  {
    names: ["بیبراخ آن در ریس", "Biberach an der Riss"],
    country: "DE",
    lng: 9.783333333333333,
    lat: 48.1
  },
  {
    names: ["انگن، بادن-وورتمبرگ", "Engen"],
    country: "DE",
    lng: 8.77138888888889,
    lat: 47.85277777777778
  },
  {
    names: ["آرهاوی", "Arhavi"],
    country: "TR",
    lng: 41.3,
    lat: 41.333333333333336
  },
  {
    names: ["آرپونک", "Արփունք"],
    country: "AM",
    lng: 45.737500000000004,
    lat: 40.28916666666667
  },
  { names: ["الوستا", "Alvesta"], country: "SE", lng: 14.55, lat: 56.9 },
  {
    names: ["اوسترونگ"],
    country: "PL",
    lng: 18.811944444444446,
    lat: 49.71939444444445
  },
  { names: ["کرامفوش"], country: "SE", lng: 17.8, lat: 62.93333333333333 },
  { names: ["اسدآباد (همدان)"], lng: 48.11, lat: 34.78 },
  {
    names: ["ایرشاوا", "Irshava", "Іршава"],
    country: "UA",
    lng: 23.05,
    lat: 48.3
  },
  {
    names: ["سکاتسدیل، آریزونا"],
    country: "US",
    lng: -111.93333333333334,
    lat: 33.5
  },
  {
    names: ["هرهر", "هِرهِر", "Հերհեր"],
    country: "AM",
    lng: 45.53861111111111,
    lat: 39.77333333333333
  },
  { names: ["مراغه", "ماراغا"], lng: 46.16, lat: 37.24 },
  {
    names: ["باب‌الزوار، الجزایر", "باب‌الزوار", "باب‌الزوار (عربی)"],
    country: "DZ",
    lng: 3.183333333333333,
    lat: 36.71666666666667
  },
  { names: ["بندر گناوه", "گناوه"], lng: 50.516853, lat: 29.567821 },
  { names: ["گامرتینگن"], country: "DE", lng: 9.2175, lat: 48.24944444444444 },
  {
    names: ["هیلو، هاوایی"],
    country: "US",
    lng: -155.08583333333334,
    lat: 19.705555555555556
  },
  {
    names: ["شاین، وایومینگ", "Cheyenne, Wyoming"],
    country: "US",
    lng: -104.80194444444444,
    lat: 41.14555555555555
  },
  {
    names: ["اوتسونومیا، توچیگی", "اوتسونومیا", "宇都宮"],
    country: "JP",
    lng: 139.88333333333333,
    lat: 36.55
  },
  {
    names: ["دیترویت", "دیترویت، میشیگان", "Detroit"],
    country: "US",
    lng: -83.04583333333333,
    lat: 42.331388888888895
  },
  {
    names: ["ویلدس‌هاوزن", "Wildeshausen"],
    country: "DE",
    lng: 8.431388888888888,
    lat: 52.893055555555556
  },
  { names: ["بریستول"], country: "GB", lng: -2.5833333333333335, lat: 51.45 },
  {
    names: ["کوغس", "Կողես"],
    country: "AM",
    lng: 44.53472222222222,
    lat: 40.987500000000004
  },
  { names: ["بناب"], lng: 46.05, lat: 37.33 },
  {
    names: ["ودی", "Վեդի"],
    country: "AM",
    lng: 44.72777777777778,
    lat: 39.910555555555554
  },
  {
    names: ["دویتاما", "Duitama"],
    country: "CO",
    lng: -73.01666666666667,
    lat: 5.833333333333333
  },
  {
    names: ["وایکرزهایم"],
    country: "DE",
    lng: 9.899166666666666,
    lat: 49.48166666666667
  },
  { names: ["نسیم‌شهر"], lng: 51.1667, lat: 35.55 },
  {
    names: ["لنکستر، کالیفرنیا", "Lancaster"],
    country: "US",
    lng: -118.15,
    lat: 34.68333333333333
  },
  {
    names: ["گارشینگ بای مونیخ", "Garching"],
    country: "DE",
    lng: 11.65,
    lat: 48.25
  },
  { names: ["کازرون"], lng: 51.65833, lat: 29.61833 },
  {
    names: ["بودن (سوید)", "بودن"],
    country: "SE",
    lng: 21.690555555555555,
    lat: 65.82555555555555
  },
  {
    names: ["موستیسکا", "Мостиська"],
    country: "UA",
    lng: 32,
    lat: 46.96666666666667
  },
  {
    names: ["فرارا", "Ferrara"],
    country: "IT",
    lng: 11.616666666666667,
    lat: 44.833333333333336
  },
  {
    names: ["رننبورگ (تورینگن)", "Ronneburg"],
    country: "DE",
    lng: 12.180833333333332,
    lat: 50.86361111111111
  },
  {
    names: ["منطقه شینگوان (لهاسا)", "拉萨 • ལྷ་ས།"],
    country: "CN",
    lng: 91.11666666666666,
    lat: 29.65
  },
  {
    names: ["اشترلا"],
    country: "DE",
    lng: 13.225833333333334,
    lat: 51.35305555555556
  },
  {
    names: ["آرناشتاین، زاکسن-آنهالت", "Arnstein"],
    country: "DE",
    lng: 11.466666666666667,
    lat: 51.68333333333333
  },
  {
    names: ["لمگو"],
    country: "DE",
    lng: 8.911666666666667,
    lat: 52.02722222222222
  },
  {
    names: ["بلن، ختای", "بلن"],
    country: "TR",
    lng: 36.19444444444444,
    lat: 36.48888888888889
  },
  {
    names: ["لور، ارمنستان", "Լոր"],
    country: "AM",
    lng: 46.12638888888889,
    lat: 39.4125
  },
  {
    names: ["ارمنستان", "جمهوری ارمنستان"],
    lng: 44.516666666666666,
    lat: 40.18333333333333
  },
  {
    names: ["منهایم (شوابن)", "Monheim"],
    country: "DE",
    lng: 10.833333333333334,
    lat: 48.833333333333336
  },
  {
    names: ["نیتروی"],
    country: "BR",
    lng: -43.10388888888889,
    lat: -22.88277777777778
  },
  {
    names: ["بوچاچ", "Buchach", "Бучач"],
    country: "UA",
    lng: 25.4,
    lat: 49.083333333333336
  },
  { names: ["اسلامشهر"], lng: 51.26, lat: 35.56 },
  {
    names: ["آنابورگ"],
    country: "DE",
    lng: 13.045555555555556,
    lat: 51.73277777777778
  },
  { names: ["بلیزکاستل"], country: "DE", lng: 7.25, lat: 49.23305555555556 },
  {
    names: ["چورنومورسک", "Чорноморськ"],
    country: "UA",
    lng: 30.65694444444444,
    lat: 46.30166666666666
  },
  {
    names: ["دیلی سیتی، کالیفرنیا", "دیلی سیتی"],
    country: "US",
    lng: -122.46833333333333,
    lat: 37.686388888888885
  },
  { names: ["لنگرود"], lng: 50.15075936, lat: 37.19515654 },
  { names: ["وانگروویتس"], country: "PL", lng: 17.2, lat: 52.8 },
  {
    names: ["بروشتن، سوچاوا", "Broșteni"],
    country: "RO",
    lng: 25.698055555555555,
    lat: 47.244166666666665
  },
  {
    names: ["پکن", "Beijing", "北京"],
    country: "AM",
    lng: 116.39166666666668,
    lat: 39.913888888888884
  },
  {
    names: ["کون‌مینگ", "昆明市"],
    country: "CN",
    lng: 102.68333333333334,
    lat: 25.066666666666666
  },
  {
    names: ["سنتا باربارا، کالیفرنیا", "سنتا باربارا"],
    country: "US",
    lng: -119.71416666666667,
    lat: 34.42583333333333
  },
  {
    names: ["هوهر-گرنزهاوزن"],
    country: "DE",
    lng: 7.671111111111111,
    lat: 50.434999999999995
  },
  { names: ["پورت هارکورت", ""], country: "NG", lng: 7, lat: 4.75 },
  {
    names: ["بوتلشتت"],
    country: "DE",
    lng: 11.341111111111111,
    lat: 51.07416666666667
  },
  {
    names: ["دوحه", "الدوحه"],
    country: "QA",
    lng: 51.516666666666666,
    lat: 25.283333333333335
  },
  {
    names: ["شوپن‌اشتت"],
    country: "DE",
    lng: 10.778333333333334,
    lat: 52.13305555555556
  },
  {
    names: ["پویرتو تورو"],
    country: "CL",
    lng: -67.075,
    lat: -55.083333333333336
  },
  {
    names: ["گبزه", "Gebze"],
    country: "TR",
    lng: 29.433333333333334,
    lat: 40.8
  },
  {
    names: ["دزوراگیوغ، لوری", "دزوراگیوغ", "Ձորագյուղ"],
    country: "AM",
    lng: 44.60527777777778,
    lat: 40.95166666666667
  },
  {
    names: ["ینیجه‌اوبا", "Yeniceoba"],
    country: "TR",
    lng: 32.93333333333333,
    lat: 38.65
  },
  { names: ["انگینگ", "安庆市"], lng: 117.03333333333333, lat: 30.5 },
  { names: ["سیکلن", "Țicleni"], lng: 23.4, lat: 44.86666666666667 },
  {
    names: ["کالبه (زاله)"],
    country: "DE",
    lng: 11.775833333333335,
    lat: 51.90333333333333
  },
  { names: ["باش‌قلعه"], country: "TR", lng: 44.015, lat: 38.0475 },
  {
    names: ["هرینگن", "Heringen"],
    country: "DE",
    lng: 10.005555555555556,
    lat: 50.88722222222222
  },
  {
    names: ["آلوانک", "Ալվանք"],
    country: "AM",
    lng: 46.345,
    lat: 38.93833333333333
  },
  { names: ["دینگولفینگ"], country: "DE", lng: 12.5, lat: 48.63333333333333 },
  {
    names: ["لان‌اشتاین"],
    country: "DE",
    lng: 7.605555555555555,
    lat: 50.301111111111105
  },
  {
    names: ["ادمونتون", "Edmonton"],
    country: "CA",
    lng: -113.5,
    lat: 53.53333333333333
  },
  { names: ["اروگویه"], lng: -58.166666666666664, lat: -34.88333333333333 },
  {
    names: ["آراکس، آرماویر", "آراکس", "Արաքս"],
    country: "AM",
    lng: 43.950833333333335,
    lat: 40.09305555555556
  },
  {
    names: ["اشتوتگارت"],
    country: "DE",
    lng: 9.183333333333334,
    lat: 48.78333333333333
  },
  {
    names: ["تغوت، لوری", "تغوت", "Թեղուտ"],
    country: "AM",
    lng: 44.84583333333334,
    lat: 41.11805555555556
  },
  {
    names: ["البوکرکی، نیومکزیکو", "Albuquerque, New Mexico"],
    country: "US",
    lng: -106.61,
    lat: 35.11083333333333
  },
  {
    names: ["آبوجا", "Abuja"],
    country: "NG",
    lng: 7.483333333333333,
    lat: 9.066666666666666
  },
  {
    names: ["آناپلیس"],
    country: "BR",
    lng: -48.95194444444445,
    lat: -16.333888888888886
  },
  {
    names: ["کندی (سری‌لانکا)", "کندی", "මහ නුවර", "கண்டி"],
    country: "LK",
    lng: 80.635,
    lat: 7.296388888888889
  },
  {
    names: ["پنوم‌پن", "پنوم پن", "Phnom-Penh", "ភ្នំពេញ"],
    country: "KH",
    lng: 104.91666666666667,
    lat: 11.55
  },
  {
    names: ["واوب ژیخ", "والب‌ژیخ"],
    country: "PL",
    lng: 16.283333333333335,
    lat: 50.78333333333333
  },
  {
    names: ["بوگوتا", "Bogotá, D.C."],
    country: "CO",
    lng: -74.07583333333334,
    lat: 4.598055555555555
  },
  {
    names: ["مکزیکو سیتی", "Ciudad de México"],
    country: "MX",
    lng: -99.13333333333334,
    lat: 19.433333333333334
  },
  {
    names: [
      "پونتیاناک",
      "City of Pontianak",
      "Kota Pontianak (زبان اندونزیایی)",
      "ڤونتیانق (Jawi Script Malay)",
      "坤甸市 (زبان‌های چینی)"
    ],
    lng: 109.33333333333333,
    lat: 0
  },
  {
    names: ["اتولبرگ"],
    country: "DE",
    lng: 12.778333333333334,
    lat: 50.708333333333336
  },
  {
    names: ["نوکوس", "ازبکی: Nukus / Нукус", "قره‌قالپاقی: No‘kis / Нөкис"],
    country: "UZ",
    lng: 59.6,
    lat: 42.46666666666667
  },
  {
    names: [
      "لوکزامبورگ (شهر)",
      "شهر لوکزامبورگ",
      "Stad Lëtzebuerg (لوکزامبورگی)",
      "Ville de Luxembourg (فرانسوی)",
      "Stadt Luxemburg (آلمانی )"
    ],
    country: "LU",
    lng: 6.13,
    lat: 49.611666666666665
  },
  {
    names: ["والگا، استونی", "والگا"],
    country: "EE",
    lng: 26.033333333333335,
    lat: 57.78333333333333
  },
  {
    names: ["رنا (مکلنبورگ-فورپومن)"],
    country: "DE",
    lng: 11.033333333333333,
    lat: 53.766666666666666
  },
  {
    names: ["میونبه", "Mjölby"],
    country: "SE",
    lng: 15.116666666666667,
    lat: 58.333333333333336
  },
  {
    names: ["تسخینوالی"],
    country: "GE",
    lng: 43.96666666666667,
    lat: 42.233333333333334
  },
  {
    names: ["برگامو", "Bergamo"],
    country: "IT",
    lng: 9.666666666666666,
    lat: 45.7
  },
  {
    names: ["کلدیتز"],
    country: "DE",
    lng: 12.816666666666666,
    lat: 51.11666666666667
  },
  {
    names: ["آریویک، آرماویر", "آریویک", "Արևիկ"],
    country: "AM",
    lng: 44.096944444444446,
    lat: 40.10055555555556
  },
  {
    names: ["ولنتونا", "Vallentuna"],
    country: "SE",
    lng: 18.083333333333332,
    lat: 59.53333333333333
  },
  {
    names: ["هایدک", "Heideck"],
    country: "DE",
    lng: 11.116666666666667,
    lat: 49.11666666666667
  },
  {
    names: ["راچستر، نیویورک", "راچستر", "Rochester, New York"],
    country: "US",
    lng: -77.61138888888888,
    lat: 43.16555555555556
  },
  {
    names: ["نوی‌اشتات (دوزه)"],
    country: "DE",
    lng: 12.433055555555555,
    lat: 52.86666666666667
  },
  {
    names: ["شبین قره‌حصار"],
    country: "TR",
    lng: 38.42333333333333,
    lat: 40.28861111111111
  },
  {
    names: ["هاوانا", "La Habana"],
    country: "CU",
    lng: -82.38333333333334,
    lat: 23.133333333333333
  },
  { names: ["مغراشات", "Մեղրաշատ"], country: "AM", lng: 43.7, lat: 40.85 },
  {
    names: ["کواوتلا"],
    country: "MX",
    lng: -99.95583333333333,
    lat: 18.81222222222222
  },
  {
    names: ["ایسافجرویر", "Ísafjörður"],
    country: "IS",
    lng: -23.116666666666667,
    lat: 66.06666666666666
  },
  { names: ["خوتین", "Khotyn1", "Хотин"], country: "UA", lng: 26.5, lat: 48.5 },
  {
    names: ["میرزبورگ"],
    country: "DE",
    lng: 9.270833333333334,
    lat: 47.69583333333333
  },
  {
    names: ["چاپنی", "Չափնի"],
    country: "AM",
    lng: 46.45805555555556,
    lat: 39.26694444444444
  },
  { names: ["بروات"], lng: 58.3961, lat: 29.0664 },
  {
    names: ["وینر", "Weener"],
    country: "DE",
    lng: 7.356388888888889,
    lat: 53.16916666666666
  },
  {
    names: ["جراشن", "Ջրաշեն"],
    country: "AM",
    lng: 44.197222222222216,
    lat: 40.7875
  },
  {
    names: ["بورونگن", "Beverungen"],
    country: "DE",
    lng: 9.3725,
    lat: 51.66277777777778
  },
  {
    names: ["رادزن خومینسکی"],
    country: "PL",
    lng: 18.93638888888889,
    lat: 53.385555555555555
  },
  {
    names: ["هارتن‌اشتاین (زاکسن)"],
    country: "DE",
    lng: 12.671388888888888,
    lat: 50.66833333333333
  },
  {
    names: ["مکزیکو سیتی", "Ciudad de México"],
    country: "MX",
    lng: -99.13333333333334,
    lat: 19.433333333333334
  },
  { names: ["وسترویک"], country: "SE", lng: 16.633333333333333, lat: 57.75 },
  {
    names: ["کیتاکیوشو، فوکویوکا", "کیتاکیوشو", "北九州"],
    country: "JP",
    lng: 130.88333333333333,
    lat: 33.88333333333333
  },
  {
    names: ["قره‌آغاج (ترکیه)", "Karaağaç"],
    country: "TR",
    lng: 26.525,
    lat: 41.65555555555555
  },
  {
    names: ["المدیه، الجزایر", "المدیه"],
    country: "DZ",
    lng: 2.75,
    lat: 36.2675
  },
  { names: ["تمپلین"], country: "DE", lng: 13.5, lat: 53.11666666666667 },
  {
    names: ["سنت لوییس، میزوری", "سنت لوییس", "City of St. Louis"],
    country: "US",
    lng: -90.19777777777779,
    lat: 38.62722222222222
  },
  {
    names: ["متس مانتاش", "Մեծ Մանթաշ"],
    country: "AM",
    lng: 44.05083333333333,
    lat: 40.64944444444444
  },
  { names: ["ابردین", "Obar Dheathain"], country: "GB", lng: -2, lat: 57 },
  { names: ["ارکنر"], country: "DE", lng: 13.75, lat: 52.416666666666664 },
  {
    names: ["لستر", "City of Leicester"],
    country: "GB",
    lng: -1.13852,
    lat: 52.63422
  },
  {
    names: ["دزوراستان", "Ձորաստան"],
    country: "AM",
    lng: 46.35638888888889,
    lat: 39.26861111111111
  },
  {
    names: ["سو سنت‌ماری"],
    country: "CA",
    lng: -84.35,
    lat: 46.53333333333333
  },
  {
    names: ["شیدر-اشوالنبرگ"],
    country: "DE",
    lng: 9.183055555555555,
    lat: 51.88305555555556
  },
  { names: ["فولکلینگن"], country: "DE", lng: 6.833333333333333, lat: 49.25 },
  { names: ["هوربی"], country: "SE", lng: 13.65, lat: 55.85 },
  {
    names: ["آنکارا"],
    country: "TR",
    lng: 32.86666666666667,
    lat: 39.86666666666667
  },
  { names: ["شلکلینگن"], country: "DE", lng: 9.7325, lat: 48.37555555555556 },
  {
    names: ["بویوک‌یونجالی", "Büyükyoncalı", "(Büyükmanika)"],
    country: "TR",
    lng: 27.933333333333334,
    lat: 41.38333333333333
  },
  {
    names: ["ورونا", "Verona"],
    country: "IT",
    lng: 10.983333333333333,
    lat: 45.43333333333333
  },
  { names: ["میت غمر"], country: "EG", lng: 31.25, lat: 30.716666666666665 },
  {
    names: ["اوبرویزنتال"],
    country: "DE",
    lng: 12.970833333333333,
    lat: 50.41916666666666
  },
  {
    names: ["چاگوانی"],
    country: "CO",
    lng: -74.5936111111111,
    lat: 4.948611111111111
  },
  { names: ["پاریس", "شهر"], country: "FR", lng: 2.3508, lat: 48.8567 },
  {
    names: ["آنانییو", "Ananyiv", "Ананьїв"],
    country: "MD",
    lng: 29.966666666666665,
    lat: 47.71666666666667
  },
  {
    names: ["کینشاسا", "Kinshas"],
    country: "CD",
    lng: 15.322222222222223,
    lat: -4.325
  },
  { names: ["پلی‌اشتاین"], country: "DE", lng: 12.416666666666666, lat: 49.65 },
  {
    names: ["مادینا، ارمنستان", "مادینا", "Մադինա"],
    country: "AM",
    lng: 45.25111111111111,
    lat: 40.08027777777778
  },
  {
    names: ["آراد (رومانی)", "آراد", "Arad"],
    country: "RO",
    lng: 21.316666666666666,
    lat: 46.166666666666664
  },
  {
    names: ["باد کارلزهافن"],
    country: "DE",
    lng: 9.45,
    lat: 51.63333333333333
  },
  {
    names: ["امبابانه"],
    country: "SZ",
    lng: 31.133333333333333,
    lat: -26.316666666666666
  },
  {
    names: ["آنیانگ", "安阳市"],
    country: "CN",
    lng: 114.33333333333333,
    lat: 36.1
  },
  {
    names: ["سانتیاگو دوتوکومان", "Tucumán"],
    country: "AR",
    lng: -65.21666666666667,
    lat: -26.816666666666666
  },
  {
    names: ["کاربن (شهر)", "Karben"],
    country: "DE",
    lng: 8.768055555555556,
    lat: 50.23222222222223
  },
  {
    names: ["کوفو، یاماناشی", "Kōfu", "甲府"],
    country: "JP",
    lng: 138.56666666666666,
    lat: 35.666666666666664
  },
  {
    names: ["تسهدنیک", "Zehdenick"],
    country: "DE",
    lng: 13.333333333333334,
    lat: 52.983333333333334
  },
  {
    names: ["اوآخاکا د خوارز", "Oaxaca de Juárez"],
    country: "MX",
    lng: -96.72,
    lat: 17.067777777777778
  },
  {
    names: ["اسویتلووودسک", "Svitlovodsk", "Світловодськ"],
    country: "UA",
    lng: 33.24194444444444,
    lat: 49.05027777777777
  },
  { names: ["وایسنفلس"], country: "DE", lng: 11.966666666666667, lat: 51.2 },
  {
    names: ["بارتین", "Bartın"],
    country: "TR",
    lng: 32.337500000000006,
    lat: 41.63444444444444
  },
  {
    names: ["ارچیش", "Erciş"],
    country: "TR",
    lng: 43.359722222222224,
    lat: 39.03111111111111
  },
  {
    names: ["بلم (شهر)", "بلم", "Belém"],
    country: "BR",
    lng: -48.5,
    lat: -1.45
  },
  {
    names: ["وییا دل روساریو (نورته ده سانتاندر)", "Villa del Rosario"],
    country: "CO",
    lng: -72.47416666666666,
    lat: 7.833888888888889
  },
  {
    names: ["استرلینگ هایتس، میشیگان", "City of Sterling Heights"],
    country: "US",
    lng: -83.02805555555555,
    lat: 42.57972222222222
  },
  {
    names: ["رینو (برندنبورگ)"],
    country: "DE",
    lng: 12.333055555555555,
    lat: 52.75
  },
  {
    names: ["واسیلکیف", "Василькiв"],
    country: "UA",
    lng: 30.315833333333334,
    lat: 50.17833333333333
  },
  { names: ["منوف"], country: "EG", lng: 30.930805, lat: 30.465839 },
  {
    names: ["نایروبی", "Nairobi"],
    country: "KE",
    lng: 36.81666666666667,
    lat: -1.2833333333333332
  },
  { names: ["سرخس", "ساریکا"], lng: 61.1611, lat: 36.5347 },
  {
    names: ["نور گیوغ", "Նոր Գյուղ"],
    country: "AM",
    lng: 44.656388888888884,
    lat: 40.266666666666666
  },
  {
    names: ["لامبایکه، پرو", "Lambayeque"],
    country: "PE",
    lng: -79.902088,
    lat: -6.699651
  },
  {
    names: ["آدورف"],
    country: "DE",
    lng: 12.266666666666667,
    lat: 50.31666666666667
  },
  {
    names: ["بربنک، کالیفرنیا", "بربنک"],
    country: "US",
    lng: -118.32833333333333,
    lat: 34.180277777777775
  },
  {
    names: ["اسپانداریان", "Սպանդարյան"],
    country: "AM",
    lng: 44.01888888888889,
    lat: 40.665
  },
  {
    names: ["منامه", "Manama", "المنامه"],
    country: "BH",
    lng: 50.583333333333336,
    lat: 26.216666666666665
  },
  {
    names: ["پیونگ‌یانگ", "평양", "P'yŏngyang"],
    country: "KP",
    lng: 125.73805555555556,
    lat: 39.019444444444446
  },
  {
    names: ["ماینرتس‌هاگن", "Meinerzhagen"],
    country: "DE",
    lng: 7.633333333333333,
    lat: 51.11666666666667
  },
  {
    names: ["زارینجا", "Զարինջա"],
    country: "AM",
    lng: 43.78333333333333,
    lat: 40.46666666666667
  },
  {
    names: ["میلتنبرگ"],
    country: "DE",
    lng: 9.264444444444445,
    lat: 49.70388888888889
  },
  {
    names: ["آریکا", "Arica"],
    country: "CL",
    lng: -70.33333333333333,
    lat: -18.483333333333334
  },
  {
    names: ["اشپرمبرگ"],
    country: "DE",
    lng: 14.379444444444445,
    lat: 51.57166666666667
  },
  { names: ["گرفنتال"], country: "DE", lng: 11.3, lat: 50.53333333333333 },
  {
    names: ["ارلانگن"],
    country: "DE",
    lng: 11.024444444444445,
    lat: 49.59111111111111
  },
  {
    names: ["کاستریس", "Castries"],
    country: "LC",
    lng: -60.983333333333334,
    lat: 14.016666666666667
  },
  {
    names: ["لوبرانیتس"],
    country: "PL",
    lng: 18.835555555555555,
    lat: 52.54194444444444
  },
  {
    names: ["کازابلانکا", "دارالبیضا", "الدار البیضا"],
    country: "MA",
    lng: -7.583333333333333,
    lat: 33.53333333333333
  },
  { names: ["نجف‌شهر"], lng: 55.7265305, lat: 29.4027148 },
  {
    names: ["گرودیتس"],
    country: "DE",
    lng: 13.449722222222222,
    lat: 51.416666666666664
  },
  {
    names: ["گتازات", "Գետազատ"],
    country: "AM",
    lng: 44.56388888888888,
    lat: 40.03805555555555
  },
  {
    names: ["فرل"],
    country: "DE",
    lng: 8.516666666666667,
    lat: 51.88305555555556
  },
  {
    names: ["باد زگبرگ"],
    country: "DE",
    lng: 10.316666666666666,
    lat: 53.916666666666664
  },
  { names: ["کنگاور", "که‌نگاوه‌ر"], lng: 47.96, lat: 34.5 },
  {
    names: ["آکناغبیور", "Ակնաղբյուր"],
    country: "AM",
    lng: 45.156388888888884,
    lat: 40.958333333333336
  },
  {
    names: ["وونزیدل"],
    country: "DE",
    lng: 12.016666666666667,
    lat: 50.016666666666666
  },
  {
    names: ["لیچک، سیونیک", "لیچک", "Լիճք"],
    country: "AM",
    lng: 46.174166666666665,
    lat: 39.05611111111111
  },
  {
    names: ["اشنیبرگ (ارتسگبریگه)", "Schneeberg"],
    country: "DE",
    lng: 12.645555555555555,
    lat: 50.594166666666666
  },
  {
    names: ["ترونی", "تُرونی", "Toruń"],
    country: "PL",
    lng: 18.616666666666667,
    lat: 53.016666666666666
  },
  {
    names: ["آمورباخ", "Amorbach"],
    country: "DE",
    lng: 9.216666666666667,
    lat: 49.63333333333333
  },
  {
    names: ["لوبس", "Łobez"],
    country: "PL",
    lng: 15.616666666666667,
    lat: 53.63333333333333
  },
  {
    names: ["تیرپ", "Tierp"],
    country: "SE",
    lng: 17.5,
    lat: 60.333333333333336
  },
  {
    names: ["لوبلین"],
    country: "PL",
    lng: 22.57027777777778,
    lat: 51.24805555555556
  },
  {
    names: ["وادرن"],
    country: "DE",
    lng: 6.866666666666667,
    lat: 49.516666666666666
  },
  { names: ["ویهرووو"], country: "PL", lng: 18.25, lat: 54.6 },
  { names: ["الفاشر"], country: "SD", lng: 25.35, lat: 13.630555555555556 },
  {
    names: ["داربی، انگلستان", "داربی", "Derby"],
    country: "GB",
    lng: -1.4758333333333336,
    lat: 52.92194444444444
  },
  { names: ["هشترود"], lng: 48.2167, lat: 37.4 },
  {
    names: ["کاراشن", "Քարաշեն"],
    country: "AM",
    lng: 46.408055555555556,
    lat: 39.54
  },
  {
    names: ["شونا ایم شوارتزوالد"],
    country: "DE",
    lng: 7.894166666666666,
    lat: 47.78666666666666
  },
  {
    names: ["سارایوو", "Sarajevo"],
    country: "BA",
    lng: 18.416666666666668,
    lat: 43.86666666666667
  },
  {
    names: ["اوبر-رام‌اشتات"],
    country: "DE",
    lng: 8.75,
    lat: 49.833333333333336
  },
  {
    names: ["ناوور", "Նավուր"],
    country: "AM",
    lng: 45.3175,
    lat: 40.86138888888889
  },
  {
    names: ["سن کارلوس د ریو نگرو"],
    country: "VE",
    lng: -67.0611111111111,
    lat: 1.92
  },
  {
    names: ["ماتاموروس، کواویلا", "ماتاموروس"],
    country: "MX",
    lng: -103.23,
    lat: 25.529166666666665
  },
  {
    names: ["شاغاپ", "Շաղափ"],
    country: "AM",
    lng: 44.9,
    lat: 39.86666666666667
  },
  {
    names: ["باتومی", "ბათუმი"],
    country: "GE",
    lng: 41.641666666666666,
    lat: 41.645833333333336
  },
  {
    names: ["چیچیهار", "Qiqihar", "齐齐哈尔市"],
    country: "CN",
    lng: 123.91666666666667,
    lat: 47.35
  },
  {
    names: ["آنابرگ-بوخ‌هولتس"],
    country: "DE",
    lng: 13.002222222222223,
    lat: 50.580000000000005
  },
  {
    names: ["اشپروکهاول", "Sprockhövel"],
    country: "DE",
    lng: 7.25,
    lat: 51.36666666666667
  },
  {
    names: ["بیوراکان", "Բյուրական"],
    country: "AM",
    lng: 44.27027777777778,
    lat: 40.34
  },
  {
    names: ["کیپ کورال، فلوریدا", "City of Cape Coral, Florida"],
    country: "US",
    lng: -81.9825,
    lat: 26.639722222222222
  },
  { names: ["میاندوآب"], lng: 46.10232, lat: 36.97 },
  {
    names: ["خنت", "خِنت (گِنت، گان)", "Gent"],
    country: "BE",
    lng: 3.7333333333333334,
    lat: 51.05
  },
  { names: ["بولو"], country: "TR", lng: 31.6, lat: 40.733333333333334 },
  {
    names: ["گوزدنگتسا"],
    country: "PL",
    lng: 15.095555555555556,
    lat: 51.43888888888888
  },
  {
    names: ["هولویکن", "Höllviken"],
    country: "SE",
    lng: 12.95,
    lat: 55.416666666666664
  },
  { names: ["پلدختر", "پاپیل"], lng: 47.7136, lat: 33.1536 },
  { names: ["سان مارینو"], lng: 12.033333333333333, lat: 43.93333333333333 },
  {
    names: ["بریجپورت، کنتیکت", "Bridgeport, Connecticut"],
    country: "US",
    lng: -73.19555555555556,
    lat: 41.186388888888885
  },
  {
    names: ["محله الکبری", "المحله الکبری"],
    country: "EG",
    lng: 31.167,
    lat: 30.967
  },
  {
    names: ["واکانای، هوکایدو", "Wakkanai", "稚内"],
    country: "JP",
    lng: 141.67305555555555,
    lat: 45.41566666666667
  },
  {
    names: ["اوری (رومانی)", "Avrig"],
    country: "RO",
    lng: 24.37472222222222,
    lat: 45.70805555555556
  },
  {
    names: ["التسه"],
    country: "DE",
    lng: 9.733333333333333,
    lat: 52.11666666666667
  },
  {
    names: ["گودنزبرگ"],
    country: "DE",
    lng: 9.366666666666667,
    lat: 51.18333333333333
  },
  {
    names: ["بانکوک", "Bangkok", "کرونگ تپ ماها ناکون"],
    country: "AM",
    lng: 100.49388888888889,
    lat: 13.752222222222223
  },
  { names: ["انتاکیه"], country: "TR", lng: 36.15, lat: 36.2 },
  {
    names: ["پالم‌بانگ", "Kota Palembang"],
    country: "ID",
    lng: 104.75673333333333,
    lat: -2.9911083333333335
  },
  {
    names: ["یازی‌کونک", "Yazıkonak", "(Vertetil)"],
    country: "TR",
    lng: 39.3,
    lat: 38.61666666666667
  },
  {
    names: ["تمپا، فلوریدا", "Tampa, Florida"],
    country: "US",
    lng: -82.46472222222222,
    lat: 27.97083333333333
  },
  {
    names: ["پورتسموث", "Portsmouth"],
    country: "GB",
    lng: -1.0833333333333333,
    lat: 50.81666666666667
  },
  {
    names: ["هارتسگروده"],
    country: "DE",
    lng: 11.144166666666667,
    lat: 51.64222222222222
  },
  {
    names: ["ارباخ در اودنوالد", "ارباخ"],
    country: "DE",
    lng: 8.995833333333332,
    lat: 49.65833333333333
  },
  {
    names: ["رادن", "Rahden"],
    country: "DE",
    lng: 8.616666666666667,
    lat: 52.416666666666664
  },
  {
    names: ["فرسین", "Frasin"],
    country: "RO",
    lng: 25.781944444444445,
    lat: 47.51833333333333
  },
  { names: ["دارمشتات"], country: "DE", lng: 8.65, lat: 49.86666666666667 },
  {
    names: ["ارلامونده"],
    country: "DE",
    lng: 11.53138888888889,
    lat: 50.775277777777774
  },
  {
    names: ["سن استانیسلاو"],
    country: "PY",
    lng: -56.43333333333333,
    lat: -24.65
  },
  {
    names: ["سیوداد هیدالگو، میچوآکان", "Taximaroa"],
    country: "MX",
    lng: -100.55361111111111,
    lat: 19.691666666666666
  },
  {
    names: ["توکیو"],
    country: "JP",
    lng: 139.71499999999997,
    lat: 35.70055555555556
  },
  {
    names: ["باشیسکله"],
    country: "TR",
    lng: 30.516666666666666,
    lat: 40.68333333333333
  },
  {
    names: ["آرتاوان", "Արտավան"],
    country: "AM",
    lng: 45.61666666666667,
    lat: 39.6575
  },
  { names: ["پارسبرگ"], country: "DE", lng: 11.716666666666667, lat: 49.15 },
  {
    names: ["ونتورا، کالیفرنیا", "ونچورا"],
    country: "US",
    lng: -119.22777777777777,
    lat: 34.275
  },
  {
    names: ["چه‌پن", "Chepén, La Libertad, Perú"],
    country: "PE",
    lng: -79.42983611111111,
    lat: -7.227130555555556
  },
  { names: ["نوردهاوزن"], country: "DE", lng: 10.79111111111111, lat: 51.505 },
  {
    names: ["پویرتو مونتت"],
    country: "CL",
    lng: -72.93333333333334,
    lat: -41.46666666666667
  },
  {
    names: ["انجامنا", "نجامنا", "Ndjamena"],
    country: "TD",
    lng: 15.049166666666666,
    lat: 12.113055555555555
  },
  {
    names: ["لیشتانو (بادن)", "Lichtenau"],
    country: "DE",
    lng: 8.005,
    lat: 48.726111111111116
  },
  {
    names: ["لانجآغبیور", "Լանջաղբյուր"],
    country: "AM",
    lng: 45.144444444444446,
    lat: 40.27305555555555
  },
  {
    names: ["سان خوآن", "San Juan, Puerto Rico"],
    country: "US",
    lng: -66.06666666666666,
    lat: 17.45
  },
  {
    names: ["روستوک"],
    country: "DE",
    lng: 12.133333333333333,
    lat: 54.083333333333336
  },
  {
    names: ["کوچابامبا"],
    country: "BO",
    lng: -66.16666666666667,
    lat: -17.383333333333333
  },
  {
    names: ["ولاهیتس", "Vlăhița", "Szentegyháza"],
    country: "RO",
    lng: 25.529999999999998,
    lat: 46.35
  },
  { names: ["آباده"], lng: 52.67, lat: 31.18 },
  { names: ["اشتافنهاگن"], country: "DE", lng: 12.9, lat: 53.7 },
  {
    names: ["قره‌آغاج شرقی", "Şarkikaraağaç"],
    country: "TR",
    lng: 31.365833333333335,
    lat: 38.08027777777778
  },
  { names: ["هکلینگن"], country: "DE", lng: 11.516666666666667, lat: 51.85 },
  {
    names: ["تاکنا", "San Pedro de Tacna"],
    country: "PE",
    lng: -70.24833333333333,
    lat: -18.055555555555557
  },
  {
    names: ["هشینگن"],
    country: "DE",
    lng: 8.963333333333333,
    lat: 48.35166666666667
  },
  {
    names: ["فورشهایم (اوبرفرانکن)", "Forchheim"],
    country: "DE",
    lng: 11.058055555555557,
    lat: 49.719722222222224
  },
  { names: ["اردینگ"], country: "DE", lng: 11.9, lat: 48.28333333333333 },
  { names: ["کرانیشفلد"], country: "DE", lng: 11.2, lat: 50.85 },
  {
    names: ["هاگفوش", "Hagfors"],
    country: "SE",
    lng: 13.65,
    lat: 60.03333333333333
  },
  { names: ["اوستکا"], country: "PL", lng: 16.85, lat: 54.583333333333336 },
  {
    names: ["لهواز", "Լեհվազ"],
    country: "AM",
    lng: 46.21027777777778,
    lat: 38.94472222222222
  },
  {
    names: ["کالاما (شیلی)", "کالاما"],
    country: "CL",
    lng: -68.93333333333334,
    lat: -22.466666666666665
  },
  {
    names: ["آیگوت", "Այգուտ"],
    country: "AM",
    lng: 45.17361111111111,
    lat: 40.68444444444444
  },
  { names: ["کراچی"], country: "", lng: 67.01, lat: 24.860000000000003 },
  {
    names: ["پروم"],
    country: "DE",
    lng: 6.424444444444445,
    lat: 50.20805555555556
  },
  {
    names: ["مارک‌گرونینگن"],
    country: "DE",
    lng: 9.080833333333333,
    lat: 48.90472222222222
  },
  {
    names: ["پرتا وستفالیکا", "Porta Westfalica"],
    country: "DE",
    lng: 8.933333333333334,
    lat: 52.21666666666667
  },
  {
    names: ["آلتدورف نزدیک نورنبرگ", "Altdorf b.Nürnberg"],
    country: "DE",
    lng: 11.356944444444444,
    lat: 49.3875
  },
  {
    names: ["تروسکاویک", "Truskavets", "Трускавець", "Truskawiec"],
    country: "UA",
    lng: 23.505,
    lat: 49.28055555555555
  },
  {
    names: ["پورت‌لوییس", "پورت لوییس", "Port Louis"],
    country: "MU",
    lng: 57.516666666666666,
    lat: -20.166666666666668
  },
  { names: ["تایباد", "طی باد"], lng: 60.7756, lat: 34.74 },
  {
    names: ["کزون سیتی", "Lungsod Quezon"],
    country: "PH",
    lng: 121.03333333333333,
    lat: 14.633333333333333
  },
  {
    names: ["استکهلم"],
    country: "SE",
    lng: 18.06861111111111,
    lat: 59.32944444444445
  },
  {
    names: ["اوتووتسک"],
    country: "PL",
    lng: 21.266666666666666,
    lat: 52.11666666666667
  },
  {
    names: ["اینچیون", "اینچون", "인천광역시", "仁川廣域市"],
    country: "KR",
    lng: 126.63333333333334,
    lat: 37.483333333333334
  },
  { names: ["اشکویدیتس"], country: "DE", lng: 12.216666666666667, lat: 51.4 },
  { names: ["کوچینگ", "Kuching"], country: "MY", lng: 110.345, lat: 1.56 },
  { names: ["گغی", "Գեղի"], country: "AM", lng: 46.15555555555555, lat: 39.22 },
  {
    names: ["اسوان"],
    country: "EG",
    lng: 32.89972222222222,
    lat: 24.08888888888889
  },
  { names: ["گناباد"], lng: 58.67, lat: 34.35 },
  {
    names: ["رودیش"],
    country: "DE",
    lng: 12.416666666666666,
    lat: 50.516666666666666
  },
  {
    names: ["مندوسا، آرژانتین", "مندوزا", "Mendoza"],
    country: "AR",
    lng: -68.81666666666666,
    lat: -32.88333333333333
  },
  {
    names: ["رودزهایم آم راین", "Rüdesheim"],
    country: "DE",
    lng: 7.930555555555556,
    lat: 49.983333333333334
  },
  { names: ["برنا (زاکسن)"], country: "DE", lng: 12.5, lat: 51.11666666666667 },
  {
    names: ["ویهه"],
    country: "DE",
    lng: 11.416666666666666,
    lat: 51.266666666666666
  },
  {
    names: ["سانتا کلارا، کالیفرنیا", "سانتا کلارا"],
    country: "US",
    lng: -121.96916666666667,
    lat: 37.35444444444445
  },
  {
    names: ["چونگ‌کینگ", "Chongqing", "重庆"],
    country: "AM",
    lng: 106.56666666666666,
    lat: 29.558333333333334
  },
  {
    names: ["نوکوآلوفا", "Nukuʻalofa"],
    country: "TO",
    lng: -175.2,
    lat: -21.133333333333333
  },
  {
    names: ["بلاگودارنوی", "Բլագոդարնոյե"],
    country: "AM",
    lng: 44.18333333333333,
    lat: 41.083333333333336
  },
  {
    names: ["یوک‌سکوا"],
    country: "TR",
    lng: 44.28333333333333,
    lat: 37.56666666666667
  },
  { names: ["آیواجیک", "Ayvacık"], country: "TR", lng: 26.4, lat: 39.6 },
  {
    names: ["اولنیتس (فگتلند)", "Oelsnitz"],
    country: "DE",
    lng: 12.166666666666666,
    lat: 50.416666666666664
  },
  {
    names: ["ناپل", "Napoli", "Naples"],
    country: "IT",
    lng: 14.25,
    lat: 40.833333333333336
  },
  { names: ["کاستاریکا"], lng: -84.06666666666666, lat: 9.916666666666666 },
  {
    names: ["نووازوفسک", "Novoazovsk", "Новоазовськ"],
    country: "UA",
    lng: 38.080000000000005,
    lat: 47.11472222222223
  },
  { names: ["سقز"], lng: 46.2753, lat: 36.2453 },
  {
    names: ["ایننبورنن"],
    country: "DE",
    lng: 7.716666666666667,
    lat: 52.27777777777778
  },
  { names: ["شهربابک"], lng: 55.12103, lat: 30.117216 },
  {
    names: ["لاباک، تگزاس", "لاباک", "City of Lubbock"],
    country: "US",
    lng: -101.88666666666667,
    lat: 33.56638888888889
  },
  {
    names: ["تورونیک", "Տորունիք"],
    country: "AM",
    lng: 46.019999999999996,
    lat: 39.41138888888889
  },
  { names: ["میناب", "مینُو(minow)"], lng: 57.04, lat: 27.09 },
  {
    names: ["خورونک", "Խորոնք"],
    country: "AM",
    lng: 44.24444444444445,
    lat: 40.13583333333333
  },
  { names: ["الوند (شهر)"], lng: 50.05, lat: 36.1833 },
  {
    names: ["لنوغی", "Լենուղի"],
    country: "AM",
    lng: 43.96527777777778,
    lat: 40.12388888888889
  },
  {
    names: ["پالم بی، فلوریدا", "Palm Bay"],
    country: "US",
    lng: -80.67000833333334,
    lat: 27.997922222222222
  },
  {
    names: ["آنتاراموت", "Անտառամուտ"],
    country: "AM",
    lng: 44.55916666666666,
    lat: 40.93861111111111
  },
  {
    names: ["نوراپات", "Նորապատ"],
    country: "AM",
    lng: 44.016666666666666,
    lat: 40.13333333333333
  },
  { names: ["آستارا"], lng: 48.8761, lat: 38.4122 },
  {
    names: ["سندویکن"],
    country: "SE",
    lng: 16.783333333333335,
    lat: 60.61666666666667
  },
  {
    names: ["لیسبون"],
    country: "",
    lng: -9.139444444444443,
    lat: 38.71388888888889
  },
  {
    names: ["بیسایو", "Bissau"],
    country: "GW",
    lng: -15.566666666666666,
    lat: 11.85
  },
  {
    names: ["تویشرن"],
    country: "DE",
    lng: 12.016666666666667,
    lat: 51.11666666666667
  },
  {
    names: ["کرگلینگن"],
    country: "DE",
    lng: 10.033333333333333,
    lat: 49.46666666666667
  },
  {
    names: ["اقصر", "اَلْاُقْصُر"],
    country: "EG",
    lng: 32.65,
    lat: 25.683333333333334
  },
  {
    names: ["ماناگویه", "ماناگوآ", "Santiago de Managua"],
    country: "NI",
    lng: -86.25138888888888,
    lat: 12.136388888888888
  },
  {
    names: ["مونتریا", "Montería"],
    country: "CO",
    lng: -75.88333333333334,
    lat: 8.75
  },
  {
    names: ["گلوک‌اشتات"],
    country: "DE",
    lng: 9.421944444444444,
    lat: 53.791666666666664
  },
  {
    names: ["نیوهیون، کنتیکت", "New Haven, Connecticut"],
    country: "US",
    lng: -72.92361111111111,
    lat: 41.309999999999995
  },
  {
    names: ["آیگزارد", "Այգեզարդ"],
    country: "AM",
    lng: 44.60888888888889,
    lat: 39.94583333333333
  },
  { names: ["واتیکان"], lng: -12.45, lat: 41.9 },
  {
    names: ["ایشخاناسار", "Իշխանասար"],
    country: "AM",
    lng: 46.04361111111111,
    lat: 39.559999999999995
  },
  {
    names: ["ژانژو", "株洲市"],
    country: "CN",
    lng: 113.13333333333334,
    lat: 27.85
  },
  { names: ["تورقوتلو", "Turgutlu"], country: "TR", lng: 27.7, lat: 38.5 },
  {
    names: ["کمپولون", "Câmpulung"],
    country: "RO",
    lng: 25.04638888888889,
    lat: 45.26777777777777
  },
  {
    names: ["جیمبولیا", "Jimbolia"],
    country: "RO",
    lng: 20.72222222222222,
    lat: 45.791666666666664
  },
  {
    names: ["کیزیل‌پینار", "Kızılpınar"],
    country: "TR",
    lng: 27.966666666666665,
    lat: 41.266666666666666
  },
  {
    names: ["سان خوآن", "San Juan, Puerto Rico"],
    country: "US",
    lng: -66.06666666666666,
    lat: 17.45
  },
  {
    names: ["بوت‌اشتت"],
    country: "DE",
    lng: 11.416666666666666,
    lat: 51.11666666666667
  },
  { names: ["پکینگ"], country: "DE", lng: 13.316666666666666, lat: 48.4 },
  { names: ["زنجان", "زنگان"], lng: 48.4856, lat: 36.6644 },
  {
    names: ["کسفلد", "Coesfeld"],
    country: "DE",
    lng: 7.1675,
    lat: 51.94583333333333
  },
  {
    names: ["مرادیه"],
    country: "TR",
    lng: 43.768055555555556,
    lat: 38.99472222222222
  },
  {
    names: ["باد اوین‌هاوزن", "Bad Oeynhausen"],
    country: "DE",
    lng: 8.8,
    lat: 52.2
  },
  {
    names: ["فوندوله", "Fundulea"],
    country: "RO",
    lng: 26.51527777777778,
    lat: 44.45277777777778
  },
  {
    names: ["کلمبیا، کارولینای جنوبی", "Columbia, South Carolina"],
    country: "US",
    lng: -81.04416666666667,
    lat: 34.00055555555556
  },
  { names: ["راشتات"], country: "DE", lng: 8.2, lat: 48.85 },
  { names: ["ونگروو"], country: "PL", lng: 22.016666666666666, lat: 52.4 },
  { names: ["تونجلی"], country: "TR", lng: 39.55, lat: 39.11666666666667 },
  {
    names: ["آتن", "Αθήνα"],
    country: "GR",
    lng: 23.727805555555555,
    lat: 37.98397222222222
  },
  {
    names: ["ژدانیفکا", "Zhdanivka", "Жданівка"],
    country: "UA",
    lng: 38.26083333333333,
    lat: 48.1375
  },
  {
    names: ["تیرشن‌رویس"],
    country: "DE",
    lng: 12.333333333333334,
    lat: 49.88333333333333
  },
  {
    names: ["پاناماسیتی", "Panamá"],
    country: "PA",
    lng: -79.51666666666667,
    lat: 8.983333333333333
  },
  {
    names: ["اوترادنی، اوبلاست سامارا", "Отрадный"],
    country: "RU",
    lng: 51.35,
    lat: 53.36666666666667
  },
  {
    names: ["دگندورف"],
    country: "DE",
    lng: 12.966666666666667,
    lat: 48.833333333333336
  },
  {
    names: ["اشتات‌لون", "Stadtlohn"],
    country: "DE",
    lng: 6.915,
    lat: 51.9925
  },
  {
    names: ["هور (سوید)", "هور"],
    country: "SE",
    lng: 13.547222222222222,
    lat: 55.93611111111111
  },
  {
    names: ["خابو"],
    country: "SE",
    lng: 13.716666666666667,
    lat: 55.63333333333333
  },
  {
    names: ["آربولتس", "Arboletes"],
    country: "CO",
    lng: -76.43333333333334,
    lat: 8.866666666666667
  },
  { names: ["آشافنبورگ"], country: "DE", lng: 9.15, lat: 49.96666666666667 },
  { names: ["اورنجستاد", "Oranjestad"], lng: -70.037, lat: 12.519 },
  { names: ["گلبهار (شهر)"], lng: 59.171836, lat: 36.570357 },
  {
    names: ["ام‌القیوین", "ام‌القوین", "اماره امّ القیوین"],
    country: "AE",
    lng: 55.94,
    lat: 25.98638888888889
  },
  {
    names: ["بافلو، نیویورک", "بافلو", "City of Buffalo"],
    country: "US",
    lng: -78.84944444444444,
    lat: 42.90472222222222
  },
  {
    names: ["آوریش", "", "Aurich"],
    country: "DE",
    lng: 7.483611111111111,
    lat: 53.47138888888889
  },
  {
    names: ["باندا آسه", "بند اچیه"],
    country: "ID",
    lng: 95.31666666666666,
    lat: 5.55
  },
  {
    names: ["فتحیه", "Fethiye"],
    country: "TR",
    lng: 29.123055555555556,
    lat: 36.65138888888889
  },
  {
    names: ["وارن (موریتز)"],
    country: "DE",
    lng: 12.683333333333334,
    lat: 53.516666666666666
  },
  { names: ["فادوتس", "Vaduz"], country: "LI", lng: 9.521, lat: 47.141 },
  {
    names: ["کیمبرلی (آفریقای جنوبی)", "کیمبرلی", "Kimberley"],
    country: "ZA",
    lng: 24.771944444444443,
    lat: -28.741944444444446
  },
  {
    names: ["آزات، ارمنستان", "آزات", "Ազատ"],
    country: "AM",
    lng: 45.87166666666667,
    lat: 40.17777777777778
  },
  {
    names: ["ووهان", "武汉市"],
    country: "CN",
    lng: 114.28333333333333,
    lat: 30.583333333333332
  },
  {
    names: ["چاگواناس", "Borough of Chaguanas Chaguanas"],
    country: "TT",
    lng: -61.38333333333333,
    lat: 10.5
  },
  {
    names: ["زیگمارینگن"],
    country: "DE",
    lng: 9.216388888888888,
    lat: 48.086666666666666
  },
  {
    names: ["لا پلاتا، اویلا", "La Plata, Huila", "San Sebastian de la Plata"],
    country: "CO",
    lng: -75.9075,
    lat: 2.39
  },
  {
    names: ["کانیف", "Kaniv", "Канів"],
    country: "UA",
    lng: 31.466666666666665,
    lat: 49.75
  },
  { names: ["اندیمشک"], lng: 48.5945, lat: 32.8717 },
  { names: ["لاوباخ"], country: "DE", lng: 8.99, lat: 50.53333333333333 },
  {
    names: ["هوویت", "Հովիտ"],
    country: "AM",
    lng: 44,
    lat: 40.766666666666666
  },
  {
    names: ["هایلیگن‌هاوس"],
    country: "DE",
    lng: 6.966666666666667,
    lat: 51.31666666666667
  },
  {
    names: ["آخالتسیخه", "گرجی: ახალციხე؛"],
    country: "GE",
    lng: 42.986111111111114,
    lat: 41.638888888888886
  },
  {
    names: ["کورتیچ", "Curtici"],
    country: "RO",
    lng: 21.30611111111111,
    lat: 46.341944444444444
  },
  {
    names: ["نووه دوور گدانسکی"],
    country: "PL",
    lng: 19.116666666666667,
    lat: 54.21666666666667
  },
  {
    names: ["کیل"],
    country: "DE",
    lng: 10.140555555555554,
    lat: 54.32527777777778
  },
  {
    names: ["تلالنپنتلا د باز، استادو د مخیکو", "Tlalnepantla de Baz"],
    country: "MX",
    lng: -99.19472222222223,
    lat: 19.53666666666667
  },
  {
    names: ["بوچا", "Буча"],
    country: "UA",
    lng: 30.226713888888888,
    lat: 50.557541666666665
  },
  {
    names: ["سان‌فرانسیسکو دل رینکون", "سان فرانسیسکو دل رینکون"],
    lng: -101.86,
    lat: 21.022777777777776
  },
  {
    names: ["البوکرکی، نیومکزیکو", "Albuquerque, New Mexico"],
    country: "US",
    lng: -106.61,
    lat: 35.11083333333333
  },
  {
    names: ["راچستر، نیویورک", "راچستر", "Rochester, New York"],
    country: "US",
    lng: -77.61138888888888,
    lat: 43.16555555555556
  },
  {
    names: ["مونکالیری", "Moncalieri"],
    country: "IT",
    lng: 7.683333333333334,
    lat: 45
  },
  {
    names: ["ساوانا، جورجیا", "ساوانا, جورجیا", "Savannah, Georgia"],
    country: "US",
    lng: -81.0911111111111,
    lat: 32.08111111111111
  },
  {
    names: ["موندو"],
    country: "TD",
    lng: 16.083333333333332,
    lat: 8.566666666666666
  },
  {
    names: ["ابو قرقاص", "Abu Qirqas"],
    country: "EG",
    lng: 30.833333333333332,
    lat: 27.933333333333334
  },
  {
    names: ["روشیوری ده وده", "Roşiorii de Vede"],
    country: "RO",
    lng: 24.99416666666667,
    lat: 44.11138888888889
  },
  {
    names: ["لوپه", "Lupeni"],
    country: "RO",
    lng: 23.238333333333333,
    lat: 45.36027777777778
  },
  {
    names: ["لا پلاتا", "La Plata"],
    country: "AR",
    lng: -57.95444444444445,
    lat: -34.92111111111111
  },
  {
    names: ["ماتانزاس", "(San Carlos y San Severino de Matanzas)"],
    country: "CU",
    lng: -81.57527777777777,
    lat: 23.051111111111112
  },
  { names: ["والنفلدز"], country: "DE", lng: 11.473333333333333, lat: 50.2675 },
  { names: ["آلانیا (ترکیه)", "آلانیا"], country: "TR", lng: 32, lat: 36.55 },
  {
    names: ["لاوخا آن در اوتراشتوت"],
    country: "DE",
    lng: 11.679722222222221,
    lat: 51.22361111111111
  },
  {
    names: ["جرج‌تاون، جزایر کیمن", "George Town"],
    country: "KY",
    lng: -81.3863,
    lat: 19.3034
  },
  {
    names: ["آگریجنتو", "Agrigento"],
    country: "IT",
    lng: 13.583333333333334,
    lat: 37.31666666666667
  },
  {
    names: ["تکاماک"],
    country: "MX",
    lng: -98.96833333333333,
    lat: 19.713055555555556
  },
  {
    names: ["لولیو"],
    country: "SE",
    lng: 22.153888888888886,
    lat: 65.58444444444444
  },
  {
    names: ["بلطیم"],
    country: "EG",
    lng: 31.091666666666665,
    lat: 31.599166666666665
  },
  {
    names: ["هورزو", "Horezu"],
    country: "RO",
    lng: 23.991666666666667,
    lat: 45.14333333333333
  },
  {
    names: ["نادویرنا", "Надвірна"],
    country: "UA",
    lng: 24.583333333333332,
    lat: 48.63333333333333
  },
  {
    names: ["زلاتنا", "Zlatna"],
    country: "RO",
    lng: 23.22111111111111,
    lat: 46.15888888888889
  },
  {
    names: ["سیوداد بولیوار", "Ciudad Bolívar"],
    country: "VE",
    lng: -63.527499999999996,
    lat: 8.0875
  },
  {
    names: ["متس پارنی", "Մեծ Պառնի"],
    country: "AM",
    lng: 44.10916666666667,
    lat: 40.83722222222222
  },
  {
    names: ["آمروسیفسکی", "Amvrosiivka", "Амвросіївка"],
    country: "UA",
    lng: 38.483333333333334,
    lat: 47.78333333333333
  },
  {
    names: ["ریگا", "Riga"],
    country: "LV",
    lng: 24.10638888888889,
    lat: 56.94888888888889
  },
  { names: ["ژنو", "Geneva"], lng: 6.09, lat: 46.12 },
  {
    names: ["کوتبوس"],
    country: "DE",
    lng: 14.334166666666667,
    lat: 51.760555555555555
  },
  {
    names: ["امیرداغ", "Emirdağ"],
    country: "TR",
    lng: 31.15,
    lat: 39.016666666666666
  },
  {
    names: ["داران"],
    country: "IR",
    lng: 50.41277777777778,
    lat: 32.98861111111111
  },
  {
    names: ["باد فالینگ بوستل"],
    country: "DE",
    lng: 9.696666666666667,
    lat: 52.8675
  },
  {
    names: ["پوپایان", "Popayán"],
    country: "CO",
    lng: -76.60916666666667,
    lat: 2.454166666666667
  },
  {
    names: ["واگادوگو"],
    country: "BF",
    lng: -1.5352777777777777,
    lat: 12.357222222222221
  },
  {
    names: ["ترانوس (سوید)", "ترانوس"],
    country: "SE",
    lng: 14.966666666666667,
    lat: 58.03333333333333
  },
  {
    names: ["سن فرناندو د آتاباپو"],
    country: "VE",
    lng: -67.66666666666667,
    lat: 4.05
  },
  {
    names: ["اونشت", "Onești"],
    country: "RO",
    lng: 26.769166666666667,
    lat: 46.25861111111111
  },
  {
    names: ["پوتبوس"],
    country: "DE",
    lng: 13.483333333333333,
    lat: 54.333333333333336
  },
  {
    names: ["کواتزاکوالکوس"],
    country: "MX",
    lng: -94.43333333333334,
    lat: 18.15
  },
  {
    names: ["خاموندی (واییه دل کایوکا)", "Jamundí"],
    country: "CO",
    lng: -76.55,
    lat: 3.2666666666666666
  },
  { names: ["دورود"], lng: 48.7, lat: 33.4 },
  {
    names: ["وورث آم ماین"],
    country: "DE",
    lng: 9.1575,
    lat: 49.796388888888885
  },
  {
    names: ["جاجوراوان", "Ջաջուռավան"],
    country: "AM",
    lng: 43.95,
    lat: 40.875
  },
  {
    names: ["هاگنباخ"],
    country: "DE",
    lng: 8.248333333333333,
    lat: 49.02055555555555
  },
  {
    names: ["تفلیس", "თბილისი", "تْبیلیسی"],
    country: "GE",
    lng: 44.78333333333333,
    lat: 41.71666666666667
  },
  {
    names: ["آرنشتات"],
    country: "DE",
    lng: 10.946388888888889,
    lat: 50.83416666666667
  },
  {
    names: ["هارتسهایم آم ماین"],
    country: "DE",
    lng: 8.466666666666667,
    lat: 50.06666666666667
  },
  { names: ["هادامار"], country: "DE", lng: 8.05, lat: 50.45 },
  {
    names: ["واکایاما (شهر)", "Wakayama", "和歌山"],
    country: "JP",
    lng: 135.16666666666666,
    lat: 34.233333333333334
  },
  { names: ["بویین‌زهرا", "بویین"], lng: 49.7667, lat: 35.9 },
  {
    names: ["میامی", "City of Miami"],
    country: "US",
    lng: -80.22416666666666,
    lat: 25.78777777777778
  },
  {
    names: ["لافایت، لوییزیانا", "Ville de Lafayette"],
    country: "",
    lng: -92.03333333333333,
    lat: 30.216666666666665
  },
  {
    names: ["هایگر"],
    country: "DE",
    lng: 8.203888888888889,
    lat: 50.742222222222225
  },
  {
    names: ["ولتسهایم"],
    country: "DE",
    lng: 9.634444444444444,
    lat: 48.874722222222225
  },
  {
    names: ["سرته", "Cereté"],
    country: "CO",
    lng: -75.78333333333333,
    lat: 8.883333333333333
  },
  {
    names: ["اینیو"],
    country: "RO",
    lng: 21.836944444444445,
    lat: 46.42583333333333
  },
  {
    names: ["هرینگن/هلمه", "Heringen"],
    country: "DE",
    lng: 10.880833333333333,
    lat: 51.447222222222216
  },
  {
    names: ["اولسان", "울산", "蔚山"],
    country: "KR",
    lng: 129.31666666666666,
    lat: 35.55
  },
  {
    names: ["اینتورسورا بوزیولو", "Întorsura Buzăului"],
    country: "RO",
    lng: 26.034166666666668,
    lat: 45.672777777777775
  },
  {
    names: ["فلورانس", "Firenze"],
    country: "IT",
    lng: 11.25,
    lat: 43.78333333333333
  },
  {
    names: ["باد کوستریتز"],
    country: "DE",
    lng: 12.009722222222223,
    lat: 50.93055555555555
  },
  {
    names: ["ماسیو", "Maceió, Alagoas, Brasil"],
    country: "BR",
    lng: -35.735,
    lat: -9.665833333333333
  },
  {
    names: ["ساونا", "Savona"],
    country: "IT",
    lng: 8.483333333333333,
    lat: 44.3
  },
  { names: ["اوفنهایم"], country: "DE", lng: 10.25, lat: 49.516666666666666 },
  {
    names: ["پرت آو اسپاین", "Port of Spain"],
    country: "TT",
    lng: -61.516666666666666,
    lat: 10.666666666666666
  },
  {
    names: ["کبک (شهر)", "Quebec City"],
    country: "CA",
    lng: -71.21666666666667,
    lat: 46.81666666666667
  },
  { names: ["برهانیه", "Burhaniye"], country: "TR", lng: 26.95, lat: 39.5 },
  {
    names: ["فالکن‌اشتاین، زاکسن", "Falkenstein"],
    country: "DE",
    lng: 12.366666666666667,
    lat: 50.46666666666667
  },
  {
    names: ["گاگناو", "Gaggenau"],
    country: "DE",
    lng: 8.319444444444445,
    lat: 48.803888888888885
  },
  {
    names: ["لیب‌اشتات"],
    country: "DE",
    lng: 13.855555555555556,
    lat: 50.86472222222223
  },
  {
    names: ["ساری‌قایه", "Sarıkaya"],
    country: "TR",
    lng: 35.38333333333333,
    lat: 39.5
  },
  { names: ["جزایر کیمن"], lng: -81.4, lat: 19.333333333333332 },
  {
    names: ["لینکلن، نبراسکا", "Lincoln, Nebraska"],
    country: "US",
    lng: -96.67527777777778,
    lat: 40.80972222222222
  },
  {
    names: ["وردوا"],
    country: "DE",
    lng: 12.383333333333333,
    lat: 50.733333333333334
  },
  {
    names: ["نوکولایه‌لایه", "Nukulaelae"],
    country: "TV",
    lng: 179.85222222222222,
    lat: -9.381111111111112
  },
  {
    names: ["شرم‌الشیخ", "Sharm el-Sheikh", "شرم الشیخ"],
    country: "EG",
    lng: 34.32972222222222,
    lat: 27.91222222222222
  },
  {
    names: ["شورژا", "Շորժա"],
    country: "AM",
    lng: 45.27444444444444,
    lat: 40.50111111111111
  },
  {
    names: ["واغاتور", "Վաղատուր"],
    country: "AM",
    lng: 46.36805555555556,
    lat: 39.60333333333333
  },
  {
    names: ["کورک (ایرلند)", "کورک", "Corcaigh"],
    country: "IE",
    lng: -8.47,
    lat: 51.897222
  },
  {
    names: ["هرنانداریاس", "Hernandarias"],
    country: "PY",
    lng: -54.75,
    lat: -25.366666666666667
  },
  {
    names: ["اشنیفلد (کرایز پیننبرگ)", "Schenefeld"],
    country: "DE",
    lng: 9.823333333333332,
    lat: 53.60277777777778
  },
  {
    names: ["وولکن (رومانی)", "Vulcan"],
    country: "RO",
    lng: 23.29138888888889,
    lat: 45.38111111111111
  },
  {
    names: ["اسپانداریان، سیوینک", "Սպանդարյան"],
    country: "AM",
    lng: 45.90472222222222,
    lat: 39.62166666666667
  },
  {
    names: ["جرارات، کوتایک", "جارارات", "Ջրառատ"],
    country: "AM",
    lng: 44.7575,
    lat: 40.55333333333333
  },
  {
    names: ["لوساکونک", "Լուսակունք"],
    country: "AM",
    lng: 45.68333333333333,
    lat: 40.166666666666664
  },
  {
    names: ["پسکارا", "Pescara"],
    country: "IT",
    lng: 14.201388888888888,
    lat: 42.46388888888889
  },
  {
    names: ["کشاپ", "Keşap"],
    country: "TR",
    lng: 38.516666666666666,
    lat: 40.916666666666664
  },
  { names: ["سورناوان", "Սուրենավան"], country: "AM", lng: 44.8, lat: 39.75 },
  {
    names: ["پیتالیتو", "Pitalito"],
    country: "CO",
    lng: -76.03333333333333,
    lat: 1.8666666666666667
  },
  {
    names: ["احمدلی (ترکیه)", "Ahmetli"],
    country: "TR",
    lng: 28.683333333333334,
    lat: 38.61666666666667
  },
  {
    names: ["هربرشتینگن"],
    country: "DE",
    lng: 10.173888888888888,
    lat: 48.625277777777775
  },
  {
    names: ["هارزه‌وینکل"],
    country: "DE",
    lng: 8.233055555555556,
    lat: 51.96666666666667
  },
  { names: ["رینک"], country: "DE", lng: 9.633333333333333, lat: 50.1 },
  {
    names: ["تیخوانا", "Tijuana"],
    country: "MX",
    lng: -117.03333333333333,
    lat: 32.525
  },
  {
    names: ["لوساشوغ", "Լուսաշող"],
    country: "AM",
    lng: 44.97833333333333,
    lat: 39.848333333333336
  },
  { names: ["برشینگ"], country: "DE", lng: 11.433333333333334, lat: 49.1 },
  {
    names: ["نواکشوت", "نواکشوط", "Nouakchott"],
    country: "MR",
    lng: -15.95,
    lat: 18.1
  },
  {
    names: ["زویست، آلمان", "Soest"],
    country: "DE",
    lng: 8.109166666666667,
    lat: 51.571111111111115
  },
  {
    names: ["برناکوت", "Բռնակոթ"],
    country: "AM",
    lng: 45.973055555555554,
    lat: 39.496944444444445
  },
  {
    names: ["جیجل، الجزایر", "جیجل"],
    country: "DZ",
    lng: 5.766666666666667,
    lat: 36.81666666666667
  },
  { names: ["دمیرجی", "Demirci"], country: "TR", lng: 28.65, lat: 39.05 },
  { names: ["جاماییکا"], lng: -76.8, lat: 17.983333333333334 },
  {
    names: ["تپاتیتلان"],
    country: "MX",
    lng: -102.73339722222222,
    lat: 20.66671388888889
  },
  {
    names: ["نوی‌اشتات این هل‌اشتاین"],
    country: "DE",
    lng: 10.815833333333334,
    lat: 54.10722222222223
  },
  {
    names: ["چینچینا", "Chinchiná, Caldas"],
    country: "CO",
    lng: -75.6036111111111,
    lat: 4.9825
  },
  { names: ["شادگان", "الدورق[1]"], lng: 48.6647, lat: 30.6497 },
  {
    names: ["ده (رومانی)", "Dej"],
    country: "RO",
    lng: 23.80527777777778,
    lat: 47.08722222222222
  },
  {
    names: ["مردزاوان", "Մերձավան"],
    country: "AM",
    lng: 44.39972222222222,
    lat: 40.17972222222222
  },
  {
    names: ["آرجوت", "Արջուտ"],
    country: "AM",
    lng: 44.382222222222225,
    lat: 40.863055555555555
  },
  {
    names: ["ال مونته، کالیفرنیا", "ال مونته", "City of El Monte"],
    country: "US",
    lng: -118.0275,
    lat: 34.07333333333334
  },
  { names: ["شیلی"], lng: -70.66666666666667, lat: -33.43333333333333 },
  {
    names: ["کالا، تورینگن"],
    country: "DE",
    lng: 11.5875,
    lat: 50.80083333333333
  },
  { names: ["آشرسلبن"], country: "DE", lng: 11.466666666666667, lat: 51.75 },
  {
    names: ["سرس، ارمنستان"],
    country: "AM",
    lng: 45.47972222222222,
    lat: 39.562777777777775
  },
  {
    names: ["تل‌آویو", "תל אביב-יפו (عبری )", "تل اَبیب-یافا (عربی )"],
    country: "IL",
    lng: 34.78333333333333,
    lat: 32.06666666666667
  },
  {
    names: ["پرتوریا", "Pretoria"],
    country: "ZA",
    lng: 28.186944444444446,
    lat: -25.753333333333334
  },
  { names: ["خواف"], lng: 60.145169, lat: 34.572229 },
  {
    names: ["بویزنبورگ"],
    country: "DE",
    lng: 10.716666666666667,
    lat: 53.36666666666667
  },
  {
    names: ["گابورون", "Gaborone"],
    country: "BW",
    lng: 25.91222222222222,
    lat: -24.658055555555553
  },
  {
    names: ["هایگرلخ"],
    country: "DE",
    lng: 8.805000000000001,
    lat: 48.36472222222223
  },
  {
    names: ["تورز", "Torez", "Торез"],
    country: "UA",
    lng: 38.62638888888889,
    lat: 48.02194444444444
  },
  {
    names: ["کالداس (انتیوکیا)", "Caldas, Antioquia"],
    country: "CO",
    lng: -75.6375,
    lat: 6.09
  },
  {
    names: ["هاتسیک", "Հացիկ"],
    country: "AM",
    lng: 43.87416666666667,
    lat: 40.847500000000004
  },
  {
    names: ["البلنگ", "Elbląg"],
    country: "PL",
    lng: 19.4,
    lat: 54.166666666666664
  },
  {
    names: ["نووه استاف"],
    country: "PL",
    lng: 19.013333333333332,
    lat: 54.135555555555555
  },
  {
    names: ["آرموتالان", "Armutalan"],
    country: "TR",
    lng: 28.233333333333334,
    lat: 36.85
  },
  {
    names: ["کاسا گرانده، پرو", "Casa Grande"],
    country: "PE",
    lng: -79.18814444444445,
    lat: -7.744583333333334
  },
  {
    names: ["ردوتس", "Rădăuți"],
    country: "RO",
    lng: 25.91916666666667,
    lat: 47.8425
  },
  {
    names: ["جیوگلیانو", "Giugliano in Campania"],
    country: "IT",
    lng: 14.2,
    lat: 40.93333333333333
  },
  {
    names: ["رافن‌اشتاین، آلمان", "Ravenstein"],
    country: "DE",
    lng: 9.507777777777777,
    lat: 49.401111111111106
  },
  {
    names: ["دیلیجان"],
    country: "AM",
    lng: 44.863055555555555,
    lat: 40.740833333333335
  },
  { names: ["آنگرمونده"], country: "DE", lng: 14, lat: 53.03333333333333 },
  {
    names: ["اوستیلوه", "Ustyluh"],
    country: "UA",
    lng: 24.15694444444444,
    lat: 50.86
  },
  { names: ["شاهین‌شهر"], lng: 51.57, lat: 32.87 },
  {
    names: ["التا", "Älta"],
    country: "SE",
    lng: 18.183333333333334,
    lat: 59.25
  },
  {
    names: ["گازینگن"],
    country: "DE",
    lng: 8.646388888888888,
    lat: 47.92222222222222
  },
  {
    names: ["اسیوط"],
    country: "EG",
    lng: 31.166666666666668,
    lat: 27.183333333333334
  },
  {
    names: [
      "کامیانکا-دنیپروفسکا",
      "Kamianka-Dniprovska",
      "Кам'янка-Дніпровська"
    ],
    country: "UA",
    lng: 34.40611111111111,
    lat: 47.46277777777778
  },
  {
    names: ["یرنجاتاپ", "Երնջատափ"],
    country: "AM",
    lng: 44.46416666666667,
    lat: 40.45305555555556
  },
  {
    names: ["سیاتل، واشینگتن", "سیاتل", "Seattle"],
    country: "US",
    lng: -122.33305555555555,
    lat: 47.609722222222224
  },
  {
    names: ["میامی", "City of Miami"],
    country: "US",
    lng: -80.22416666666666,
    lat: 25.78777777777778
  },
  {
    names: ["هاربین", "哈尔滨市"],
    country: "CN",
    lng: 126.63333333333334,
    lat: 45.75
  },
  {
    names: ["چرنیوتسی", "Чернівці́"],
    country: "UA",
    lng: 25.933333333333334,
    lat: 48.3
  },
  {
    names: ["کونرن"],
    country: "DE",
    lng: 11.770833333333334,
    lat: 51.66972222222222
  },
  {
    names: ["کتسین/هاول"],
    country: "DE",
    lng: 12.845,
    lat: 52.469722222222224
  },
  { names: ["لیبرویل", "Libreville"], country: "GA", lng: 9.45, lat: 0.39 },
  {
    names: ["وورتسن"],
    country: "DE",
    lng: 12.716666666666667,
    lat: 51.36666666666667
  },
  {
    names: ["اشچیل", "Trzciel"],
    country: "PL",
    lng: 15.883333333333333,
    lat: 52.36666666666667
  },
  {
    names: ["انشوپینگ", "Enköping"],
    country: "SE",
    lng: 17.07638888888889,
    lat: 59.635555555555555
  },
  {
    names: ["آورباخ این در اوبرفالتس", "", "Auerbach i.d.OPf."],
    country: "DE",
    lng: 11.616666666666667,
    lat: 49.68333333333333
  },
  {
    names: ["آرشالویس", "Արշալույս"],
    country: "AM",
    lng: 44.21416666666667,
    lat: 40.16888888888889
  },
  {
    names: ["فرینگن‌اشتات"],
    country: "DE",
    lng: 9.211944444444443,
    lat: 48.17833333333333
  },
  {
    names: ["لانگویزن"],
    country: "DE",
    lng: 10.974444444444444,
    lat: 50.67166666666667
  },
  {
    names: ["والدکپل", "Waldkappel"],
    country: "DE",
    lng: 9.883333333333333,
    lat: 51.15
  },
  {
    names: ["هالبراشتات"],
    country: "DE",
    lng: 11.046666666666667,
    lat: 51.895833333333336
  },
  {
    names: ["لودویکه", "Ludvika"],
    country: "SE",
    lng: 15.183333333333334,
    lat: 60.13333333333333
  },
  {
    names: ["شونوالد، بایرن", "Schönwald"],
    country: "DE",
    lng: 12.083333333333334,
    lat: 50.2
  },
  {
    names: ["وینتیان", "ວຽງຈັນ", "Vientiane"],
    country: "LA",
    lng: 102.6,
    lat: 17.966666666666665
  },
  {
    names: ["باردزرونی", "Բարձրունի"],
    country: "AM",
    lng: 45.48222222222223,
    lat: 39.520833333333336
  },
  {
    names: ["خاچاردزان", "Խաչարձան"],
    country: "AM",
    lng: 45.05833333333333,
    lat: 40.719166666666666
  },
  {
    names: ["اونا", "Unna"],
    country: "DE",
    lng: 7.688888888888889,
    lat: 51.53472222222222
  },
  {
    names: ["یروانداشات", "Երվանդաշատ"],
    country: "AM",
    lng: 43.670833333333334,
    lat: 40.11472222222223
  },
  {
    names: ["لینیش", "Linnich"],
    country: "DE",
    lng: 6.267777777777778,
    lat: 50.97888888888889
  },
  {
    names: ["به‌له", "Bălan", "Balánbánya"],
    country: "RO",
    lng: 25.810000000000002,
    lat: 46.64972222222222
  },
  {
    names: ["آروابویر", "Արևաբույր"],
    country: "AM",
    lng: 44.46888888888889,
    lat: 40.03611111111111
  },
  {
    names: ["واسیلیفکا", "Vasylivka", "Василівка"],
    country: "UA",
    lng: 35.27638888888889,
    lat: 47.43416666666666
  },
  {
    names: ["چامباراک", "Ճամբարակ"],
    country: "AM",
    lng: 45.347500000000004,
    lat: 40.59527777777778
  },
  {
    names: ["لوول، ماساچوست", "City of Lowell"],
    country: "US",
    lng: -71.31472222222222,
    lat: 42.63944444444444
  },
  { names: ["آل‌اشتد"], country: "DE", lng: 11.383333333333333, lat: 51.4 },
  {
    names: ["ووهان", "武汉市"],
    country: "CN",
    lng: 114.28333333333333,
    lat: 30.583333333333332
  },
  {
    names: ["سان فرناندو (ترینیداد و توباگو)", "سان فرناندو", "San Fernando"],
    country: "TT",
    lng: -61.46666666666667,
    lat: 10.283333333333333
  },
  { names: ["شوط"], lng: 44.8169, lat: 39.2117 },
  {
    names: ["ویلمینگتن، کارولینای شمالی", "Wilmington, North Carolina"],
    country: "US",
    lng: -77.91222222222223,
    lat: 34.223333333333336
  },
  { names: ["گوتسکو"], country: "DE", lng: 13.416666666666666, lat: 53.95 },
  {
    names: ["گوساناگیوغ", "Գուսանագյուղ"],
    country: "AM",
    lng: 43.788333333333334,
    lat: 40.66916666666666
  },
  {
    names: ["دالیان", "大连市"],
    country: "CN",
    lng: 121.63916666666667,
    lat: 38.920833333333334
  },
  { names: ["بستان‌آباد", "بوستان آوا"], lng: 46.4922, lat: 37.9836 },
  {
    names: ["گوک‌سون"],
    country: "TR",
    lng: 36.49166666666667,
    lat: 38.02111111111111
  },
  {
    names: ["بایرامیچ"],
    country: "TR",
    lng: 26.616666666666667,
    lat: 39.81666666666667
  },
  { names: ["داتچا", "Datça"], country: "TR", lng: 27.6869, lat: 36.7283 },
  { names: ["نورشوپینگ"], country: "SE", lng: 16.2, lat: 58.6 },
  { names: ["هربورن"], country: "DE", lng: 8.306111111111111, lat: 50.6825 },
  {
    names: ["نور آستغابرد", "Նոր Աստղաբերդ"],
    country: "AM",
    lng: 46.10777777777778,
    lat: 39.245555555555555
  },
  { names: ["آماسیه"], country: "TR", lng: 35.833333333333336, lat: 40.65 },
  {
    names: ["اسلام‌آباد"],
    country: "PK",
    lng: 73.06666666666666,
    lat: 33.71666666666667
  },
  {
    names: ["پلاتلینگ"],
    country: "DE",
    lng: 12.866666666666667,
    lat: 48.766666666666666
  },
  { names: ["کلیکس"], country: "SE", lng: 23.166666666666668, lat: 65.85 },
  {
    names: ["آلتنا", "Altena"],
    country: "DE",
    lng: 7.666666666666667,
    lat: 51.3
  },
  { names: ["چمران (بندر ماهشهر)", "جراحی"], lng: 49.15, lat: 30.6668 },
  {
    names: ["قادرلی", "کادیرلی"],
    country: "TR",
    lng: 36.1,
    lat: 37.36972222222222
  },
  { names: ["کشالین"], country: "PL", lng: 16.183333333333334, lat: 54.2 },
  {
    names: ["سویاروی", "Суоярви"],
    country: "RU",
    lng: 32.35,
    lat: 62.083333333333336
  },
  {
    names: ["البوکرکی، نیومکزیکو", "Albuquerque, New Mexico"],
    country: "US",
    lng: -106.61,
    lat: 35.11083333333333
  },
  {
    names: ["بریزه", "Breaza"],
    country: "RO",
    lng: 25.66222222222222,
    lat: 45.18722222222222
  },
  {
    names: ["ایبیزا، اسپانیا", "ایبیزا", "(به اسپانیایی: Ibiza)"],
    country: "ES",
    lng: -1.43,
    lat: 38.98
  },
  {
    names: ["بوگوتا", "Bogotá, D.C."],
    country: "CO",
    lng: -74.07583333333334,
    lat: 4.598055555555555
  },
  {
    names: ["کلیرواتر، فلوریدا", "Clearwater"],
    country: "US",
    lng: -82.76416666666667,
    lat: 27.973611111111108
  },
  {
    names: ["بردیانسک", "Berdiansk", "Бердянськ"],
    country: "UA",
    lng: 36.78444444444444,
    lat: 46.75972222222222
  },
  {
    names: ["گوتزرو"],
    country: "DE",
    lng: 12.176388888888889,
    lat: 53.79388888888889
  },
  {
    names: ["وراکروز (شهر)", "وراکروس (وراکروس)", "Puerto de tlaxciclo"],
    country: "MX",
    lng: -96.15333333333334,
    lat: 19.190277777777776
  },
  {
    names: ["پریتتس"],
    country: "DE",
    lng: 10.282222222222224,
    lat: 54.236666666666665
  },
  {
    names: ["ددماسار", "Դդմասար"],
    country: "AM",
    lng: 43.833333333333336,
    lat: 40.35
  },
  { names: ["پاراگویه"], lng: -57.666666666666664, lat: -25.266666666666666 },
  {
    names: ["گیدونیا مونتچلیو", "Guidonia Montecelio"],
    country: "IT",
    lng: 12.716666666666667,
    lat: 42
  },
  {
    names: ["تراپانی", "Trapani"],
    country: "IT",
    lng: 12.516666666666667,
    lat: 38.016666666666666
  },
  { names: ["کاوفبویرن"], country: "DE", lng: 10.6225, lat: 47.88 },
  {
    names: ["الگن، ایلینوی", "Elgin, Illinois"],
    country: "US",
    lng: -88.28333333333333,
    lat: 42.03333333333333
  },
  { names: ["فیلیش", "Filiași"], country: "RO", lng: 23.52, lat: 44.4 },
  {
    names: ["هانگژو", "杭州市"],
    country: "CN",
    lng: 120.16666666666667,
    lat: 30.25
  },
  {
    names: ["ایکالویت", "ᐃᖃᓗᐃᑦ"],
    country: "CA",
    lng: -68.51972222222223,
    lat: 63.74861111111111
  },
  {
    names: ["جواشان", "舟山市"],
    lng: 122.40277777777779,
    lat: 30.169444444444444
  },
  { names: ["چان", "Çan"], country: "TR", lng: 27.05, lat: 40.03333333333333 },
  {
    names: ["بربنک، کالیفرنیا", "بربنک"],
    country: "US",
    lng: -118.32833333333333,
    lat: 34.180277777777775
  },
  {
    names: ["آگوستا، جورجیا", "Augusta, Georgia"],
    country: "US",
    lng: -81.97500000000001,
    lat: 33.47
  },
  { names: ["ونکوور"], country: "CA", lng: -123.1, lat: 49.25 },
  {
    names: ["کسویگ (آنهالت)", "Coswig"],
    country: "DE",
    lng: 12.433333333333334,
    lat: 51.88333333333333
  },
  {
    names: ["وست جردن، یوتا", "West Jordan, Utah"],
    country: "US",
    lng: -111.97611111111111,
    lat: 40.60638888888889
  },
  {
    names: ["بیکاز", "Bicaz"],
    country: "RO",
    lng: 26.09111111111111,
    lat: 46.91083333333333
  },
  {
    names: ["آنگغاکوت", "Անգեղակոթ"],
    country: "AM",
    lng: 45.943888888888885,
    lat: 39.56805555555556
  },
  { names: ["دومیتزش"], country: "DE", lng: 12.883333333333333, lat: 51.65 },
  {
    names: ["کایک، ارمنستان", "کایک", "Կայք"],
    country: "AM",
    lng: 44.37138888888889,
    lat: 40.58638888888889
  },
  {
    names: ["اوورای", "Uray", "Урай"],
    country: "RU",
    lng: 64.8,
    lat: 60.13333333333333
  },
  { names: ["شواینفورت"], country: "DE", lng: 10.233333333333333, lat: 50.05 },
  {
    names: ["پوتزولی", "Pozzuoli"],
    country: "IT",
    lng: 14.116666666666667,
    lat: 40.81666666666667
  },
  {
    names: ["مدجیجا", "Medgidia"],
    country: "RO",
    lng: 28.261388888888888,
    lat: 44.250277777777775
  },
  {
    names: ["باد دربورگ"],
    country: "DE",
    lng: 9.016666666666667,
    lat: 51.733333333333334
  },
  {
    names: ["تاراوای جنوبی", "Teinainano Urban Council", "South Tarawa"],
    country: "KI",
    lng: 172.98333333333332,
    lat: 1.3255555555555556
  },
  {
    names: ["دارمانشت", "Dărmăneşti"],
    country: "RO",
    lng: 26.47972222222222,
    lat: 46.37
  },
  {
    names: ["چیناری، ارمنستان", "چیناری", "Չինարի"],
    country: "AM",
    lng: 45.57194444444445,
    lat: 40.849722222222226
  },
  {
    names: ["کلوتز"],
    country: "DE",
    lng: 11.166666666666666,
    lat: 53.96666666666667
  },
  {
    names: ["توکماک، اوکراین", "Токмак"],
    country: "UA",
    lng: 35.7,
    lat: 47.25
  },
  {
    names: ["نرکین تساقکاوان", "Ներքին Ծաղկավան"],
    country: "AM",
    lng: 45.11805555555556,
    lat: 41.034166666666664
  },
  {
    names: ["هوندویارا", "Hunedoara"],
    country: "RO",
    lng: 22.92027777777778,
    lat: 45.76972222222222
  },
  { names: ["شوایگرن"], country: "DE", lng: 9.05, lat: 49.13333333333333 },
  {
    names: ["کوردوبا، آرژانتین", "کوردوبا", "Córdoba"],
    country: "AR",
    lng: -64.18333333333334,
    lat: -31.416666666666668
  },
  {
    names: ["میندن", "Minden"],
    country: "DE",
    lng: 8.916666666666666,
    lat: 52.28333333333333
  },
  { names: ["برازیلیا", "Brasília"], country: "BR", lng: -47.9, lat: 15.8 },
  {
    names: ["تسوربیرگ"],
    country: "DE",
    lng: 12.116666666666667,
    lat: 51.61666666666667
  },
  {
    names: ["ماتانزاس", "(San Carlos y San Severino de Matanzas)"],
    country: "CU",
    lng: -81.57527777777777,
    lat: 23.051111111111112
  },
  {
    names: ["ولونتر", "Voluntari"],
    country: "RO",
    lng: 26.191388888888888,
    lat: 44.4925
  },
  {
    names: ["هولتسفرد", "Hultsfred"],
    country: "SE",
    lng: 15.833333333333334,
    lat: 57.483333333333334
  },
  {
    names: ["لیورپول", "Liverpool"],
    country: "GB",
    lng: -2.9833333333333334,
    lat: 53.4
  },
  {
    names: ["الضعین"],
    country: "SD",
    lng: 26.128333333333334,
    lat: 11.460833333333333
  },
  {
    names: ["ورنیگه‌روده"],
    country: "DE",
    lng: 10.785277777777777,
    lat: 51.835
  },
  {
    names: ["التمن"],
    country: "DE",
    lng: 10.666666666666666,
    lat: 49.96666666666667
  },
  {
    names: ["گرشتهوفن"],
    country: "DE",
    lng: 10.866666666666667,
    lat: 48.416666666666664
  },
  {
    names: ["مارلو، آلمان", "Marlow"],
    country: "DE",
    lng: 12.566666666666666,
    lat: 54.13333333333333
  },
  {
    names: ["ملیک‌گیوغ", "Մելիքգյուղ"],
    country: "AM",
    lng: 44.3575,
    lat: 40.669444444444444
  },
  {
    names: ["بوبینگن", "Bobingen"],
    country: "DE",
    lng: 10.816666666666666,
    lat: 48.266666666666666
  },
  {
    names: ["پالرمو", "Palermo"],
    country: "IT",
    lng: 13.366666666666667,
    lat: 38.11666666666667
  },
  {
    names: ["آرورا، ایلینوی"],
    country: "US",
    lng: -88.28999999999999,
    lat: 41.763333333333335
  },
  {
    names: ["یغگ", "Եղեգ"],
    country: "AM",
    lng: 46.420833333333334,
    lat: 39.299166666666665
  },
  {
    names: ["ریدنبورگ"],
    country: "DE",
    lng: 11.666666666666666,
    lat: 48.96666666666667
  },
  {
    names: ["بیرکیرکارا", "Il-Kunsill Lokali ta' Birkirkara"],
    country: "MT",
    lng: 14.462499999999999,
    lat: 35.89666666666667
  },
  {
    names: ["چرکش", "Çerkeş"],
    country: "TR",
    lng: 32.88333333333333,
    lat: 40.8
  },
  { names: ["سنقر", "سنقر و کلیایی"], lng: 47.59876658, lat: 34.77572232 },
  {
    names: ["اویدو (رومانی)", "Ovidiu"],
    country: "RO",
    lng: 28.560000000000002,
    lat: 44.269999999999996
  },
  {
    names: ["اسبیرگ", "Esbjerg"],
    country: "DK",
    lng: 8.45,
    lat: 55.483333333333334
  },
  {
    names: ["برواناینگن"],
    country: "DE",
    lng: 8.448055555555555,
    lat: 47.92972222222222
  },
  {
    names: ["آرماش، ارمنستان", "آرماش", "Արմաշ"],
    country: "AM",
    lng: 44.80833333333333,
    lat: 39.766666666666666
  },
  {
    names: ["کمپه", "Câmpeni"],
    country: "RO",
    lng: 23.045555555555556,
    lat: 46.362500000000004
  },
  {
    names: ["باد روداخ"],
    country: "DE",
    lng: 10.783333333333333,
    lat: 50.333333333333336
  },
  {
    names: ["اتوایلر"],
    country: "DE",
    lng: 7.166666666666667,
    lat: 49.36666666666667
  },
  {
    names: ["اوبیهیرو، هوکایدو", "Obihiro", "帯広"],
    country: "JP",
    lng: 143.2,
    lat: 42.916666666666664
  },
  { names: ["پیرانشهر"], lng: 45.14244239, lat: 36.69698788 },
  {
    names: ["آخالتسیخه", "گرجی: ახალციხე؛"],
    country: "GE",
    lng: 42.986111111111114,
    lat: 41.638888888888886
  },
  {
    names: ["چوچکان", "Ճոճկան"],
    country: "AM",
    lng: 44.831388888888895,
    lat: 41.18611111111111
  },
  {
    names: ["خنشله، الجزایر", "خنشله"],
    country: "DZ",
    lng: 7.133333333333334,
    lat: 35.416666666666664
  },
  {
    names: ["باغچه‌سرای", "Bakhchysarai", "Bağçasaray", "Бахчисарай"],
    country: "UA",
    lng: 33.86083333333333,
    lat: 44.75277777777778
  },
  {
    names: ["پیونگ‌یانگ", "평양", "P'yŏngyang"],
    country: "KP",
    lng: 125.73805555555556,
    lat: 39.019444444444446
  },
  {
    names: ["اوورلند پارک، کانزاس", "Overland Park, Kansas"],
    country: "US",
    lng: -94.67083333333333,
    lat: 38.98222222222223
  },
  {
    names: ["لنگریش، وستفالن", "Lengerich"],
    country: "DE",
    lng: 7.866666666666667,
    lat: 52.175
  },
  {
    names: ["کاخیکا", "Cajicá"],
    country: "CO",
    lng: -74.03333333333333,
    lat: 4.916666666666667
  },
  {
    names: ["باد کرویتسناخ", "Bad Kreuznach"],
    country: "DE",
    lng: 7.866666666666667,
    lat: 49.85
  },
  {
    names: ["هنابرد", "Հնաբերդ"],
    country: "AM",
    lng: 44.144444444444446,
    lat: 40.64277777777778
  },
  { names: ["سیورک"], country: "TR", lng: 39.31666666666667, lat: 37.75 },
  {
    names: ["ماستارا", "Մաստարա"],
    country: "AM",
    lng: 43.88138888888889,
    lat: 40.44777777777777
  },
  {
    names: ["بکلیه", "Beclean"],
    country: "RO",
    lng: 24.179722222222225,
    lat: 47.17972222222222
  },
  {
    names: ["مغاواهوویت", "Մեղվահովիտ"],
    country: "AM",
    lng: 44.153888888888886,
    lat: 41.11666666666667
  },
  { names: ["استشلنو"], country: "PL", lng: 18.17, lat: 52.629444444444445 },
  {
    names: ["فراکنتال (فالتز)", "Frankenthal"],
    country: "DE",
    lng: 8.35,
    lat: 49.53333333333333
  },
  {
    names: ["اولسهمن", "Ulricehamn"],
    country: "SE",
    lng: 13.416666666666666,
    lat: 57.78333333333333
  },
  {
    names: ["هانوفر", "Hannover"],
    country: "DE",
    lng: 9.716666666666667,
    lat: 52.36666666666667
  },
  {
    names: ["هرزوگنراس", "Herzogenrath"],
    country: "DE",
    lng: 6.1,
    lat: 50.86666666666667
  },
  {
    names: ["استربروکن"],
    country: "DE",
    lng: 9.42611111111111,
    lat: 49.43083333333333
  },
  {
    names: ["سیوداد خوارس٬ چییوایوا", "سیوداد خوارس", "Ciudad Juárez"],
    country: "MX",
    lng: -106.48694444444445,
    lat: 31.739444444444445
  },
  { names: ["آکن"], country: "DE", lng: 12.05, lat: 51.85 },
  { names: ["مامونیه"], lng: 50.515, lat: 35.2983 },
  {
    names: ["راین (لش)", "Rain"],
    country: "DE",
    lng: 10.916666666666666,
    lat: 48.68333333333333
  },
  { names: ["مانیسالس", "Manizales"], country: "CO", lng: -75.55, lat: 5.1 },
  {
    names: ["آساهیکاوا، هوکایدو", "Asahikawa", "旭川"],
    country: "JP",
    lng: 142.36666666666667,
    lat: 43.766666666666666
  },
  {
    names: ["بوکسبرگ (بادن)", "Boxberg"],
    country: "DE",
    lng: 9.641666666666666,
    lat: 49.481388888888894
  },
  {
    names: ["ور (بادن)", "Wehr"],
    country: "DE",
    lng: 7.904444444444445,
    lat: 47.62972222222222
  },
  {
    names: ["امزدتن", "Emsdetten"],
    country: "DE",
    lng: 7.5344444444444445,
    lat: 52.172777777777775
  },
  { names: ["ونسبوری"], country: "SE", lng: 12.325, lat: 58.38055555555555 },
  {
    names: ["سارسال", "Zarzal"],
    country: "CO",
    lng: -76.07722222222222,
    lat: 4.398333333333333
  },
  { names: ["اورینگین"], country: "DE", lng: 9.5, lat: 49.2 },
  {
    names: ["شاکی، ارمنستان", "Շաքի"],
    country: "AM",
    lng: 45.9975,
    lat: 39.564166666666665
  },
  { names: ["تیران", "تیرون"], lng: 51.1519, lat: 32.7036 },
  {
    names: ["آرووت", "Արևուտ"],
    country: "AM",
    lng: 43.78333333333333,
    lat: 40.36666666666667
  },
  {
    names: ["نیاله", "Nyala"],
    country: "SD",
    lng: 24.876944444444444,
    lat: 12.036388888888888
  },
  { names: ["تلا", "Tamhlacht"], country: "IE", lng: -6.3572, lat: 53.2886 },
  { names: ["صدرا (شیراز)"], lng: 52.4, lat: 29.8 },
  {
    names: ["آرواشات", "Արևաշատ"],
    country: "AM",
    lng: 44.37083333333334,
    lat: 40.141666666666666
  },
  {
    names: ["ناگویا", "名古屋市"],
    country: "JP",
    lng: 136.9,
    lat: 35.18333333333333
  },
  {
    names: ["کوکوتا", "San José de Cúcuta"],
    country: "CO",
    lng: -72.5038888888889,
    lat: 7.894166666666666
  },
  {
    names: ["اسوردلوفسک، اوکراین", "Sverdlovsk", "Свердловськ (اوکراینی)"],
    country: "UA",
    lng: 39.64722222222222,
    lat: 48.07777777777778
  },
  {
    names: ["پورت الیزابت", "Port Elizabeth"],
    country: "ZA",
    lng: 25.6,
    lat: -33.95805555555556
  },
  {
    names: ["هندرسون، نوادا", "Henderson, Nevada"],
    country: "US",
    lng: -114.98333333333333,
    lat: 36.03333333333333
  },
  { names: ["مونتری"], country: "MX", lng: -100.3, lat: 25.666666666666668 },
  {
    names: ["ابوظبی"],
    country: "AE",
    lng: 54.36666666666667,
    lat: 24.466666666666665
  },
  { names: ["لاسرنا", "لا سرنا"], country: "CL", lng: -71.25, lat: -29.9 },
  {
    names: ["زوونی", "Զովունի"],
    country: "AM",
    lng: 44.50388888888889,
    lat: 40.23638888888889
  },
  {
    names: ["گوردس", "Gördes"],
    country: "TR",
    lng: 28.283333333333335,
    lat: 38.93333333333333
  },
  {
    names: ["هوشی‌مین (شهر)", "شهر هوشی‌مین", "Thành phố Hồ Chí Minh"],
    country: "VN",
    lng: 106.68194444444445,
    lat: 10.769444444444446
  },
  { names: ["گایزنفلد"], country: "DE", lng: 11.6, lat: 48.666666666666664 },
  { names: ["آخپرادزور", "Ախպրաձոր"], country: "AM", lng: 45.65, lat: 40.1 },
  {
    names: ["کسرتا", "Caserta"],
    country: "IT",
    lng: 14.333333333333334,
    lat: 41.06666666666667
  },
  {
    names: ["کورال اسپرینگز، فلوریدا", "City of Coral Springs"],
    country: "US",
    lng: -80.25916666666667,
    lat: 26.270555555555553
  },
  {
    names: ["باد تولتس"],
    country: "DE",
    lng: 11.556666666666667,
    lat: 47.76027777777778
  },
  {
    names: ["هونولولو", "Honolulu, Hawaii"],
    country: "US",
    lng: -157.82611111111112,
    lat: 21.30888888888889
  },
  {
    names: ["بی‌شهر", "Beyşehir"],
    country: "TR",
    lng: 31.733333333333334,
    lat: 37.68333333333333
  },
  {
    names: ["میلواکی، ویسکانسین", "میلواکی", "Milwaukee"],
    country: "US",
    lng: -87.95583333333333,
    lat: 43.05222222222222
  },
  {
    names: ["اشتولینگن"],
    country: "DE",
    lng: 8.445833333333333,
    lat: 47.74527777777778
  },
  {
    names: ["اشتدته", "Stade"],
    country: "DE",
    lng: 9.47638888888889,
    lat: 53.600833333333334
  },
  {
    names: ["اوختار", "Օխտար"],
    country: "AM",
    lng: 46.362500000000004,
    lat: 39.280277777777776
  },
  { names: ["مزار شریف"], country: "AF", lng: 67.11666666666666, lat: 36.7 },
  {
    names: ["نااشتتن"],
    country: "DE",
    lng: 7.858333333333333,
    lat: 50.19944444444444
  },
  {
    names: ["یرانوس", "Երանոս"],
    country: "AM",
    lng: 45.18833333333333,
    lat: 40.20416666666667
  },
  {
    names: ["واشکیفتسی", "Vashkivtsi", "Вашківці"],
    country: "UA",
    lng: 25.497777777777777,
    lat: 48.375277777777775
  },
  {
    names: ["ایپیالس", "Ipiales"],
    country: "CO",
    lng: -77.64444444444445,
    lat: 0.8302777777777778
  },
  {
    names: ["صوفیه", "София"],
    country: "BG",
    lng: 23.333333333333332,
    lat: 42.7
  },
  {
    names: ["ویندهوک", "Windhuk, ǀAiǁGams, Otjomuise"],
    country: "NA",
    lng: 17.08361111111111,
    lat: -22.57
  },
  { names: ["بندر ترکمن", "بنر"], lng: 54.1136111, lat: 36.9097222 },
  {
    names: ["گغاکرت"],
    country: "AM",
    lng: 44.242222222222225,
    lat: 40.18527777777778
  },
  {
    names: ["هردورف"],
    country: "DE",
    lng: 7.954722222222222,
    lat: 50.777499999999996
  },
  {
    names: ["ویللباداسن", "Willebadessen"],
    country: "DE",
    lng: 9.033055555555556,
    lat: 51.63305555555556
  },
  {
    names: ["ارواین، کالیفرنیا", "ارواین", "Irvine"],
    country: "US",
    lng: -117.7925,
    lat: 33.68416666666666
  },
  {
    names: ["شورنوخ", "Շուռնուխ"],
    country: "AM",
    lng: 46.39138888888889,
    lat: 39.3775
  },
  {
    names: ["موش (شهر)", "موش"],
    country: "TR",
    lng: 41.49111111111111,
    lat: 38.733333333333334
  },
  {
    names: ["اسکاندیدو، کالیفرنیا", "اسکاندیدو"],
    country: "US",
    lng: -117.08083333333333,
    lat: 33.124722222222225
  },
  {
    names: ["نویبولاخ"],
    country: "DE",
    lng: 8.696666666666667,
    lat: 48.66111111111111
  },
  {
    names: ["تگوسیگالپا", "Tegucigalpa"],
    country: "HN",
    lng: -87.21666666666667,
    lat: 14.1
  },
  {
    names: ["جینان (شاندونگ)", "济南市"],
    country: "CN",
    lng: 116.98333333333333,
    lat: 36.666666666666664
  },
  {
    names: ["هماو"],
    country: "DE",
    lng: 11.78277777777778,
    lat: 49.051944444444445
  },
  {
    names: ["اسن"],
    country: "DE",
    lng: 7.013055555555556,
    lat: 51.450833333333335
  },
  {
    names: ["رانچو کوکامونگا، کالیفرنیا", "رانچو کوکامونگا"],
    country: "US",
    lng: -117.57944444444443,
    lat: 34.123333333333335
  },
  {
    names: ["پرتوریا", "Pretoria"],
    country: "ZA",
    lng: 28.186944444444446,
    lat: -25.753333333333334
  },
  {
    names: ["ددماشن", "Դդմաշեն"],
    country: "AM",
    lng: 44.818333333333335,
    lat: 40.57055555555556
  },
  {
    names: ["تایپه", "臺北", "Taipei"],
    country: "TW",
    lng: 121.63333333333334,
    lat: 25.033333333333335
  },
  {
    names: ["تسایتس"],
    country: "DE",
    lng: 12.138333333333334,
    lat: 51.047777777777775
  },
  {
    names: ["کیورتسی", "Kivertsi"],
    country: "UA",
    lng: 25.461388888888887,
    lat: 50.83305555555556
  },
  {
    names: ["راولپندی", "Rawalpindi", "راولپنڈی"],
    country: "PK",
    lng: 73.03333333333333,
    lat: 33.6
  },
  {
    names: ["آمبون", "Kota Ambon"],
    country: "ID",
    lng: 128.16666666666666,
    lat: -3.7
  },
  {
    names: ["ویندهوک", "Windhuk, ǀAiǁGams, Otjomuise"],
    country: "NA",
    lng: 17.08361111111111,
    lat: -22.57
  },
  {
    names: ["بریج‌تاون", "Bridgetown"],
    country: "BB",
    lng: -59.632,
    lat: 13.106
  },
  {
    names: ["اسپلیت", "City of Split"],
    country: "HR",
    lng: 16.433333333333334,
    lat: 43.5
  },
  {
    names: ["دهلی نو", "New Delhi", "नई दिल्ली"],
    country: "IN",
    lng: 77.2088888888889,
    lat: 28.61388888888889
  },
  {
    names: ["مورونی", "Mūrūnī"],
    country: "KM",
    lng: 43.255692,
    lat: -11.699307
  },
  {
    names: ["تسوینگنبرگ", "Zwingenberg"],
    country: "DE",
    lng: 8.616666666666667,
    lat: 49.71666666666667
  },
  {
    names: ["کارلشته", "Karlstad"],
    country: "SE",
    lng: 13.504166666666666,
    lat: 59.37833333333333
  },
  {
    names: ["گغاشن", "Գեղաշեն"],
    country: "AM",
    lng: 44.72694444444445,
    lat: 40.23444444444444
  },
  {
    names: ["اودینه", "Udine"],
    country: "IT",
    lng: 13.233333333333333,
    lat: 46.06666666666667
  },
  {
    names: ["لنداشتول"],
    country: "DE",
    lng: 7.572222222222222,
    lat: 49.41222222222222
  },
  {
    names: ["فلورزهایم آم ماین"],
    country: "DE",
    lng: 8.433333333333334,
    lat: 50.016666666666666
  },
  {
    names: ["آچرا", "Acerra"],
    country: "IT",
    lng: 14.366666666666667,
    lat: 40.95
  },
  { names: ["مویزلویتس"], country: "DE", lng: 12.3, lat: 51.05 },
  {
    names: ["کلمبوس، جورجیا", "Columbus"],
    country: "US",
    lng: -84.94027777777778,
    lat: 32.492222222222225
  },
  {
    names: ["دکرنس"],
    country: "EG",
    lng: 31.596944444444443,
    lat: 31.08833333333333
  },
  {
    names: ["گرافینگ بای مونیخ", "Grafing b.München"],
    country: "DE",
    lng: 11.966666666666667,
    lat: 48.05
  },
  {
    names: ["قناطر خیریه", "القناطر الخیریه"],
    country: "EG",
    lng: 31.132064,
    lat: 30.193583
  },
  {
    names: ["پونو", "Puno", "San Carlos de Puno"],
    country: "PE",
    lng: -70.02361111111111,
    lat: -15.843333333333334
  },
  {
    names: ["شیامن", "厦门市"],
    country: "CN",
    lng: 118.08941944444445,
    lat: 24.47983611111111
  },
  {
    names: ["جرارات، آرماویر", "جرارات", "Ջրառատ"],
    country: "AM",
    lng: 44.26305555555555,
    lat: 40.07138888888889
  },
  {
    names: ["منفلوط"],
    country: "EG",
    lng: 30.966666666666665,
    lat: 27.316666666666666
  },
  {
    names: ["لامتزیا ترمه", "Lamezia Terme"],
    country: "IT",
    lng: 16.3,
    lat: 38.96666666666667
  },
  {
    names: ["باییا بلانکا", "Bahía Blanca"],
    country: "AR",
    lng: -62.266666666666666,
    lat: -38.71666666666667
  },
  {
    names: ["توریون (کواویلا)", "توریون", "Torreón"],
    country: "MX",
    lng: -103.44863333333333,
    lat: 25.539350000000002
  },
  {
    names: ["کاهارلیک", "Кагарлик"],
    country: "UA",
    lng: 30.809166666666666,
    lat: 49.852222222222224
  },
  {
    names: ["گرینزبورو، کارولینای شمالی"],
    country: "US",
    lng: -79.81944444444444,
    lat: 36.080000000000005
  },
  {
    names: ["اولوکیشلا", "Ulukışla"],
    country: "TR",
    lng: 34.483333333333334,
    lat: 37.53333333333333
  },
  {
    names: ["مازی‌داغی"],
    country: "TR",
    lng: 40.48638888888889,
    lat: 37.47916666666667
  },
  {
    names: ["ایوانو-فرانکیفسک", "Іва́но-Франкі́вськ"],
    country: "UA",
    lng: 24.716666666666665,
    lat: 48.916666666666664
  },
  {
    names: ["شیزویوکا", "Shizuoka", "静岡"],
    country: "JP",
    lng: 138.38333333333333,
    lat: 34.983333333333334
  },
  {
    names: ["کووارتو سنت النا", "Quartu Sant'Elena"],
    country: "IT",
    lng: 9.183333333333334,
    lat: 39.233333333333334
  },
  {
    names: ["آماسیا، شیراک", "آماسیا", "Ամասիա"],
    country: "AM",
    lng: 43.78138888888889,
    lat: 40.946666666666665
  },
  {
    names: ["ویرگس"],
    country: "DE",
    lng: 7.795277777777778,
    lat: 50.47416666666667
  },
  {
    names: ["شولینیه", "Kävlinge"],
    country: "SE",
    lng: 13.113333333333333,
    lat: 55.79388888888889
  },
  {
    names: ["چوپ، اوکراین", "Chop", "Чоп - Csap"],
    country: "UA",
    lng: 22.2,
    lat: 48.43055555555555
  },
  { names: ["توملیلا", "Tomelilla"], country: "SE", lng: 13.95, lat: 55.55 },
  {
    names: ["استربورگ (آلتمارک)"],
    country: "DE",
    lng: 11.766666666666667,
    lat: 52.78333333333333
  },
  {
    names: ["سارالانج، لوری", "سارالانج", "Սարալանջ"],
    country: "AM",
    lng: 44.09722222222222,
    lat: 40.87555555555556
  },
  {
    names: ["کاناچوت", "Կանաչուտ"],
    country: "AM",
    lng: 44.544444444444444,
    lat: 40.00888888888889
  },
  {
    names: ["ایندیپندنس، میزوری", "Independence"],
    country: "US",
    lng: -94.40666666666667,
    lat: 39.07972222222222
  },
  {
    names: ["سامبیر", "Sambir", "Самбір", "Sambor", "Самбор"],
    country: "UA",
    lng: 23.202777777777776,
    lat: 49.516666666666666
  },
  {
    names: ["اوریکن", "Uricani"],
    country: "RO",
    lng: 23.1525,
    lat: 45.33638888888889
  },
  { names: ["زینگن"], country: "DE", lng: 8.84, lat: 47.76277777777778 },
  {
    names: ["کمبریج، ماساچوست", "Cambridge, Massachusetts"],
    country: "US",
    lng: -71.11055555555555,
    lat: 42.37361111111111
  },
  {
    names: ["آنگرا دو هروییسمو"],
    country: "",
    lng: -27.22083333333333,
    lat: 38.48861111111111
  },
  {
    names: ["فورتالزا", "Fortaleza"],
    country: "BR",
    lng: -38.54277777777778,
    lat: -3.7183333333333333
  },
  {
    names: ["فورینگن (نوی-اولم)", "Vöhringen"],
    country: "DE",
    lng: 10.083333333333334,
    lat: 48.28333333333333
  },
  {
    names: ["اسلو (سوید)", "Eslöv, Sweden"],
    country: "SE",
    lng: 13.30388888888889,
    lat: 55.83916666666667
  },
  {
    names: ["رانچو کوکامونگا، کالیفرنیا", "رانچو کوکامونگا"],
    country: "US",
    lng: -117.57944444444443,
    lat: 34.123333333333335
  },
  {
    names: ["مدینه", "اَلْمَدِینَه اَلْمَنَوَّرَه"],
    country: "SA",
    lng: 39.6,
    lat: 24.466666666666665
  },
  {
    names: ["سان‌فرانسیسکو"],
    country: "US",
    lng: -122.4192,
    lat: 37.77833333333333
  },
  {
    names: ["برگدیر", "Bragadiru"],
    country: "RO",
    lng: 25.974999999999998,
    lat: 44.37083333333334
  },
  { names: ["هیرشهورن (نکا)"], country: "DE", lng: 8.9, lat: 49.45 },
  {
    names: ["فایتویل، کارولینای شمالی", "Fayetteville, North Carolina"],
    country: "US",
    lng: -78.9175,
    lat: 35.06666666666667
  },
  {
    names: ["گوآناخوآتو سیتی", "گوآناخوآتو، گوآناخوآتو"],
    country: "MX",
    lng: -101.25666666666666,
    lat: 21.017777777777777
  },
  {
    names: ["کوریس، ارمنستان", "کوریس", "Կուրիս"],
    country: "AM",
    lng: 46.18,
    lat: 38.924166666666665
  },
  {
    names: ["اچاگواس"],
    country: "VE",
    lng: -68.23333333333333,
    lat: 7.766666666666667
  },
  {
    names: ["توتوری (شهر)", "Tottori", "鳥取"],
    country: "JP",
    lng: 134.23333333333332,
    lat: 35.5
  },
  {
    names: ["لیدن", "Leiden"],
    country: "NL",
    lng: 4.483333333333333,
    lat: 52.166666666666664
  },
  { names: ["اشتهارد"], lng: 50.3722, lat: 35.7208 },
  { names: ["دومینیکا"], lng: -61.38333333333333, lat: 15.3 },
  {
    names: ["قره‌بوک", "Karabük"],
    country: "TR",
    lng: 32.63333333333333,
    lat: 41.2
  },
  {
    names: ["هنینگزدورف", "Hennigsdorf"],
    country: "DE",
    lng: 13.20361111111111,
    lat: 52.63777777777778
  },
  {
    names: ["هابو", "Habo"],
    country: "SE",
    lng: 14.066666666666666,
    lat: 57.916666666666664
  },
  {
    names: ["برنهایم (راینلند)", "Bornheim"],
    country: "DE",
    lng: 7.005,
    lat: 50.759166666666665
  },
  {
    names: ["ساراگیوغ", "Սարագյուղ"],
    country: "AM",
    lng: 43.88444444444444,
    lat: 41.16111111111111
  },
  { names: ["سوبیتسه"], country: "PL", lng: 14.566666666666666, lat: 52.35 },
  {
    names: ["کیرونا", "Kiruna - Giron"],
    country: "SE",
    lng: 20.216666666666665,
    lat: 67.85
  },
  {
    names: ["بیله‌فلد", "Bielefeld"],
    country: "DE",
    lng: 8.516666666666667,
    lat: 52.016666666666666
  },
  { names: ["کوتاییسی", "ქუთაისი"], country: "GE", lng: 42.7, lat: 42.25 },
  {
    names: ["نیواورلیان", "نیو اورلیان"],
    country: "US",
    lng: -90.07055555555556,
    lat: 29.96472222222222
  },
  {
    names: ["ردگاو", "Rodgau"],
    country: "DE",
    lng: 8.883333333333333,
    lat: 50.016666666666666
  },
  { names: ["کوک برن تاون، باهاما"], country: "TC", lng: -71.139, lat: 21.459 },
  {
    names: ["آراگاتس، آراگاتسوتن", "آراگاتس", "Արագած"],
    country: "AM",
    lng: 44.35444444444445,
    lat: 40.48861111111111
  },
  { names: ["لوتسن"], country: "DE", lng: 12.133333333333333, lat: 51.25 },
  {
    names: ["درسدن"],
    country: "DE",
    lng: 13.733333333333333,
    lat: 51.03333333333333
  },
  {
    names: ["گورا هومورول", "Gura Humorului"],
    country: "RO",
    lng: 25.889166666666664,
    lat: 47.553888888888885
  },
  {
    names: ["برگهایم، نوردراین-وستفالن", "Bergheim"],
    country: "DE",
    lng: 6.65,
    lat: 50.96666666666667
  },
  {
    names: ["پاناماسیتی", "Panamá"],
    country: "PA",
    lng: -79.51666666666667,
    lat: 8.983333333333333
  },
  {
    names: ["آدیامان", "Adıyaman"],
    country: "TR",
    lng: 38.27777777777778,
    lat: 37.763888888888886
  },
  {
    names: ["توزلوجا", "Tuzluca"],
    country: "TR",
    lng: 43.65,
    lat: 40.016666666666666
  },
  {
    names: ["پام دیل، کالیفرنیا", "پام دیل"],
    country: "US",
    lng: -118.10055555555554,
    lat: 34.58111111111111
  },
  {
    names: ["پمبروک پاینز، فلوریدا", "City of Pembroke Pines"],
    country: "US",
    lng: -80.31361111111111,
    lat: 26.0125
  },
  {
    names: ["تولورس", "Տոլորս"],
    country: "AM",
    lng: 46.04611111111111,
    lat: 39.46055555555556
  },
  {
    names: ["چینسلو بالسامو", "Cinisello Balsamo"],
    country: "IT",
    lng: 9.216666666666667,
    lat: 45.55
  },
  {
    names: ["کوناکری", "Kɔnakiri", "Conakry"],
    country: "GN",
    lng: -13.7,
    lat: 9.516666666666667
  },
  {
    names: ["لینشوپینگ", "Linköping"],
    country: "SE",
    lng: 15.625277777777779,
    lat: 58.41583333333333
  },
  {
    names: ["نوینبورگ فرم والد"],
    country: "DE",
    lng: 12.383333333333333,
    lat: 49.333333333333336
  },
  {
    names: ["کیگالی", "Kigali"],
    country: "RW",
    lng: 30.059444444444445,
    lat: -1.943888888888889
  },
  { names: ["بندر گز"], lng: 53.9489, lat: 36.7775 },
  {
    names: ["مارتونی، ارمنستان", "مارتونی", "Մարտունի"],
    country: "AM",
    lng: 45.30638888888888,
    lat: 40.14
  },
  {
    names: ["ناکسویل، تنسی", "ناکسویل", "Knoxville, Tennessee"],
    country: "US",
    lng: -83.94222222222223,
    lat: 35.97277777777778
  },
  { names: ["توشهاون"], lng: -6.7675, lat: 62.01166666666666 },
  {
    names: ["بوستو آرسیتسیو", "Busto Arsizio"],
    country: "IT",
    lng: 8.833333333333334,
    lat: 45.6
  },
  {
    names: ["یونزبرو", "Ljungsbro"],
    country: "SE",
    lng: 15.502777777777778,
    lat: 58.50833333333333
  },
  {
    names: ["الفن"],
    country: "DE",
    lng: 7.377777777777777,
    lat: 51.708333333333336
  },
  {
    names: ["آوشار، آرارات", "آوشار", "Ավշար"],
    country: "AM",
    lng: 44.683611111111105,
    lat: 39.84055555555556
  },
  {
    names: ["فرایلایسنگ"],
    country: "DE",
    lng: 12.966666666666667,
    lat: 47.833333333333336
  },
  {
    names: ["پوتسک، استان ماسوویان", "Płock"],
    country: "PL",
    lng: 19.7,
    lat: 52.55
  },
  {
    names: ["تاووش (روستا)", "تاووش", "Տավուշ"],
    country: "AM",
    lng: 45.401111111111106,
    lat: 40.91444444444444
  },
  { names: ["ملارد"], lng: 50.9781, lat: 35.6656 },
  {
    names: ["زازنبرگ", "Sassenberg"],
    country: "DE",
    lng: 8.040833333333333,
    lat: 51.98972222222222
  },
  {
    names: ["جژگون"],
    country: "PL",
    lng: 19.35138888888889,
    lat: 53.92333333333333
  },
  {
    names: ["شفیلد", "City of Sheffield"],
    country: "GB",
    lng: -1.4669444444444446,
    lat: 53.38361111111111
  },
  { names: ["رامهرمز"], lng: 49.6064, lat: 31.2783 },
  { names: ["عدوه"], country: "EG", lng: 30.75, lat: 28.7 },
  {
    names: ["دونی، کالیفرنیا", "دونی", "City of Downey"],
    country: "US",
    lng: -118.13083333333333,
    lat: 33.93805555555555
  },
  {
    names: ["یاغلی‌دره", "Yağlıdere"],
    country: "TR",
    lng: 38.416666666666664,
    lat: 40.9
  },
  {
    names: ["سانتا مارتا (کلمبیا)", "سانتا مارتا", "Santa Marta"],
    country: "CO",
    lng: -74.20527777777778,
    lat: 11.241944444444444
  },
  {
    names: ["آریکا", "Arica"],
    country: "CL",
    lng: -70.33333333333333,
    lat: -18.483333333333334
  },
  {
    names: ["فورت وین، ایندیانا", "Fort Wayne, Indiana"],
    country: "US",
    lng: -85.13916666666667,
    lat: 41.080555555555556
  },
  {
    names: ["ال مونته، کالیفرنیا", "ال مونته", "City of El Monte"],
    country: "US",
    lng: -118.0275,
    lat: 34.07333333333334
  },
  { names: ["یوا", "Hjo"], country: "SE", lng: 14.283333333333333, lat: 58.3 },
  {
    names: ["گواتمالاسیتی", "La Nueva Guatemala de la Asunción"],
    country: "GT",
    lng: -90.53527777777778,
    lat: 14.613333333333333
  },
  {
    names: ["ویلنیوس", "Vilnius"],
    country: "LT",
    lng: 25.283333333333335,
    lat: 54.68333333333333
  },
  {
    names: ["هاکو", "Հակո"],
    country: "AM",
    lng: 43.69944444444444,
    lat: 40.38111111111111
  },
  {
    names: ["آراتاشن", "Առատաշեն"],
    country: "AM",
    lng: 44.2275,
    lat: 40.12861111111111
  },
  {
    names: ["اواماچوکو", "Huamachuco"],
    country: "PE",
    lng: -78.04869444444444,
    lat: -7.812027777777778
  },
  {
    names: ["بولونیا", "Bologna"],
    country: "IT",
    lng: 11.351388888888888,
    lat: 44.5075
  },
  { names: ["تسوواسار", "Ծովասար"], country: "AM", lng: 45.19, lat: 40.14 },
  {
    names: ["هرتسبرگ (الشتر)", "Herzberg"],
    country: "DE",
    lng: 13.233055555555556,
    lat: 51.683055555555555
  },
  { names: ["خرمدره"], lng: 49.25, lat: 36.25 },
  {
    names: ["زومپانگو"],
    country: "MX",
    lng: -99.09916666666666,
    lat: 19.796944444444446
  },
  { names: ["نیدراو", "Nidderau"], country: "DE", lng: 8.9, lat: 50.25 },
  {
    names: ["بلش", "Balș"],
    country: "RO",
    lng: 24.099444444444444,
    lat: 44.35
  },
  { names: ["لردگان", "سه دهستان"], lng: 50.8283, lat: 31.5097 },
  { names: ["لوجه"], country: "DE", lng: 9.25, lat: 51.95 },
  {
    names: ["لنیانو", "Legnano"],
    country: "IT",
    lng: 8.916666666666666,
    lat: 45.6
  },
  {
    names: ["تیبو", "Tibú"],
    country: "CO",
    lng: -72.71666666666667,
    lat: 8.633333333333333
  },
  {
    names: ["الاغواط، الجزایر", "الاغواط"],
    country: "DZ",
    lng: 2.875,
    lat: 33.80277777777778
  },
  {
    names: ["نور اوغی", "Նոր ուղի"],
    country: "AM",
    lng: 44.61666666666667,
    lat: 39.96666666666667
  },
  {
    names: ["دهلی نو", "New Delhi", "नई दिल्ली"],
    country: "IN",
    lng: 77.2088888888889,
    lat: 28.61388888888889
  },
  {
    names: ["مایدانتس", "Майданець"],
    country: "UA",
    lng: 30.700277777777778,
    lat: 48.809999999999995
  },
  {
    names: ["هوهنبرگ ان در اگر", "Hohenberg a.d.Eger"],
    country: "DE",
    lng: 12.216666666666667,
    lat: 50.1
  },
  {
    names: ["سیورسک", "Siversk"],
    country: "UA",
    lng: 38.09722222222222,
    lat: 48.863055555555555
  },
  {
    names: ["ماترا", "Matera"],
    country: "IT",
    lng: 16.6,
    lat: 40.666666666666664
  },
  {
    names: ["ساساری", "Sassari"],
    country: "IT",
    lng: 8.566666666666666,
    lat: 40.733333333333334
  },
  {
    names: ["کالتن‌کیرشه"],
    country: "DE",
    lng: 9.960277777777778,
    lat: 53.83972222222222
  },
  {
    names: ["سیه‌نا"],
    country: "IT",
    lng: 11.330555555555556,
    lat: 43.31861111111112
  },
  {
    names: ["نوک (گرینلند)", "نوک"],
    country: "GL",
    lng: -51.733333333333334,
    lat: 65.2
  },
  {
    names: ["لا ویکتوریا، ونزویلا"],
    country: "VE",
    lng: -67.33361111111111,
    lat: 10.227777777777778
  },
  {
    names: ["بلویو (واشینگتن)", "بلویو", "City of Bellevue"],
    country: "US",
    lng: -122.15916666666668,
    lat: 47.597500000000004
  },
  { names: ["رامشیر"], lng: 49.41, lat: 30.9 },
  {
    names: ["آیلنبورگ"],
    country: "DE",
    lng: 12.635833333333332,
    lat: 51.46083333333333
  },
  {
    names: ["موصل", "موصِل", "الموصل (عربی )"],
    country: "IQ",
    lng: 43.07,
    lat: 36.02
  },
  {
    names: ["ساراتوفکا، ارمنستان", "ساراتوفکا", "Սարատովկա"],
    country: "AM",
    lng: 44.31638888888889,
    lat: 41.07805555555556
  },
  {
    names: ["الگن، ایلینوی", "Elgin, Illinois"],
    country: "US",
    lng: -88.28333333333333,
    lat: 42.03333333333333
  },
  {
    names: ["ال سانتوآریو", "El Santuario"],
    country: "CO",
    lng: -75.26388888888889,
    lat: -6.1375
  },
  {
    names: ["دیسن بای جنگ توتبورکر"],
    country: "DE",
    lng: 8.2,
    lat: 52.11666666666667
  },
  {
    names: ["لوبا", "Löbau"],
    country: "DE",
    lng: 14.666666666666666,
    lat: 51.09444444444445
  },
  {
    names: ["وریتسن"],
    country: "DE",
    lng: 14.133055555555556,
    lat: 52.71666666666667
  },
  {
    names: ["کلمبیا، میزوری", "Columbia, Missouri"],
    country: "US",
    lng: -92.33388888888888,
    lat: 38.94833333333333
  },
  { names: ["ماتورین"], country: "", lng: -63.183, lat: 9.75 },
  {
    names: ["لیچک", "Լիճք"],
    country: "AM",
    lng: 45.234722222222224,
    lat: 40.159166666666664
  },
  {
    names: ["مارتس، لوری", "مارتس", "Մարց"],
    country: "AM",
    lng: 44.70444444444445,
    lat: 40.956944444444446
  },
  {
    names: ["بورچکا"],
    country: "TR",
    lng: 41.67916666666667,
    lat: 41.36361111111111
  },
  {
    names: ["لویتنبرگ"],
    country: "DE",
    lng: 11.449722222222222,
    lat: 50.54972222222222
  },
  { names: ["بیجار"], lng: 47.52, lat: 35.87 },
  {
    names: ["دراختیک", "Դրախտիկ"],
    country: "AM",
    lng: 45.23777777777778,
    lat: 40.565
  },
  { names: ["تنکابن"], lng: 51.1, lat: 36.7 },
  {
    names: ["گوگهوویت", "Գոգհովիտ"],
    country: "AM",
    lng: 43.833333333333336,
    lat: 40.93333333333333
  },
  {
    names: ["آوازان", "Ավազան"],
    country: "AM",
    lng: 45.703611111111115,
    lat: 40.30222222222222
  },
  {
    names: [
      "سانتا کروس (اسپانیا)",
      "سانتا کروس",
      "(به اسپانیایی: Santa Cruz de Tenerife)"
    ],
    country: "ES",
    lng: -16.25,
    lat: 28.466666666666665
  },
  {
    names: ["عشق‌آباد", "Aşgabat/Ашгабат", "Ашхабад"],
    country: "TM",
    lng: 58.36666666666667,
    lat: 37.93333333333333
  },
  {
    names: ["ایلزهوفن"],
    country: "DE",
    lng: 9.920277777777777,
    lat: 49.17027777777778
  },
  {
    names: ["ویتینگن", "Wittingen"],
    country: "DE",
    lng: 10.733333333333333,
    lat: 52.71666666666667
  },
  {
    names: ["کازابلانکا", "دارالبیضا", "الدار البیضا"],
    country: "MA",
    lng: -7.583333333333333,
    lat: 33.53333333333333
  },
  {
    names: ["نویتراوبلینگ"],
    country: "DE",
    lng: 12.195277777777777,
    lat: 48.993611111111115
  },
  {
    names: ["اوکسلوسوند"],
    country: "SE",
    lng: 17.116666666666667,
    lat: 58.666666666666664
  },
  {
    names: ["فارگو، داکوتای شمالی", "شهر فارگو", "City of Fargo"],
    country: "US",
    lng: -96.78944444444444,
    lat: 46.87722222222222
  },
  {
    names: ["ترنی", "Terni", "Interamna"],
    country: "IT",
    lng: 12.65,
    lat: 42.56666666666667
  },
  { names: ["روتینگن"], country: "DE", lng: 9.966666666666667, lat: 49.5 },
  {
    names: ["داشتاوان", "Դաշտավան"],
    country: "AM",
    lng: 44.39055555555556,
    lat: 40.10166666666667
  },
  { names: ["بوشهر"], lng: 50.8371, lat: 28.9576 },
  {
    names: ["کردی (استان دقهلیه)", "کردی", "الکردی"],
    country: "EG",
    lng: 31.78256,
    lat: 31.142893
  },
  {
    names: ["ویتلاندا"],
    country: "SE",
    lng: 15.066666666666666,
    lat: 57.43333333333333
  },
  {
    names: ["بوستون", "Boston"],
    country: "US",
    lng: -71.06166666666667,
    lat: 42.35777777777778
  },
  {
    names: ["گرند رپیدز، میشیگان", "Grand Rapids, Michigan"],
    country: "US",
    lng: -85.65571944444444,
    lat: 42.96125
  },
  {
    names: ["وشکو", "Vaşcău"],
    country: "RO",
    lng: 22.47972222222222,
    lat: 46.47972222222222
  },
  {
    names: ["بیسایو", "Bissau"],
    country: "GW",
    lng: -15.566666666666666,
    lat: 11.85
  },
  { names: ["اومیو"], country: "SE", lng: 20.26388888888889, lat: 63.825 },
  {
    names: ["گوتینگن", "Göttingen"],
    country: "DE",
    lng: 9.935555555555556,
    lat: 51.53388888888889
  },
  {
    names: ["دودوما", "Dodoma"],
    country: "TZ",
    lng: 35.74194444444444,
    lat: -6.173055555555556
  },
  {
    names: ["موغله", "Muğla"],
    country: "TR",
    lng: 28.6,
    lat: 37.36666666666667
  },
  {
    names: ["ویکتور ویل، کالیفرنیا", "نصرآباد"],
    country: "US",
    lng: -117.28833333333333,
    lat: 34.53611111111111
  },
  {
    names: ["ماینتس", "Mainz"],
    country: "DE",
    lng: 8.271111111111113,
    lat: 50
  },
  {
    names: ["بورسا"],
    country: "TR",
    lng: 29.066666666666666,
    lat: 40.18333333333333
  },
  {
    names: ["سرمشو", "Sărmașu", "Nagysármás"],
    country: "RO",
    lng: 24.166666666666668,
    lat: 46.75361111111111
  },
  {
    names: ["آرواشوغ", "Արևաշող"],
    country: "AM",
    lng: 44.272777777777776,
    lat: 40.86138888888889
  },
  {
    names: ["نانجینگ", "南京市"],
    country: "CN",
    lng: 118.76666666666667,
    lat: 32.05
  },
  {
    names: ["آرینج", "Առինջ"],
    country: "AM",
    lng: 44.571111111111115,
    lat: 40.231388888888894
  },
  {
    names: ["بالتیمور", "Baltimore"],
    country: "US",
    lng: -76.61666666666666,
    lat: 39.28333333333333
  },
  {
    names: ["لیدز"],
    country: "GB",
    lng: -1.5491666666666666,
    lat: 53.79972222222222
  },
  {
    names: ["کونگسنگن", "Kungsängen"],
    country: "SE",
    lng: 17.75,
    lat: 59.483333333333334
  },
  { names: ["دوبرن"], country: "DE", lng: 14.6, lat: 51.61666666666667 },
  {
    names: ["کوینکا", "(به اسپانیایی: Cuenca)"],
    country: "ES",
    lng: -2.15,
    lat: 40.06666666666667
  },
  {
    names: [
      "ریکیاویک",
      "شهر ریکیاویک",
      "(به ایسلندی: Reykjavíkurbor)",
      "(به انگلیسی: City of Reykjavik)"
    ],
    country: "IS",
    lng: -21.933333333333334,
    lat: 64.13333333333334
  },
  { names: ["گینیستا"], country: "SE", lng: 17.3, lat: 59.05 },
  {
    names: ["آپریلیا (لاتینا)", "Aprilia"],
    country: "IT",
    lng: 12.65,
    lat: 41.583333333333336
  },
  {
    names: ["آخن", "Aachen"],
    country: "DE",
    lng: 6.082777777777777,
    lat: 50.775277777777774
  },
  {
    names: ["اورت، واشینگتن", "اورت", "City of Everett"],
    country: "US",
    lng: -122.20055555555555,
    lat: 47.96333333333334
  },
  {
    names: ["مورفریزبورو، تنسی"],
    country: "US",
    lng: -86.39194444444445,
    lat: 35.846111111111114
  },
  {
    names: ["گرفنبرویش"],
    country: "DE",
    lng: 6.5874999999999995,
    lat: 51.08833333333334
  },
  {
    names: ["دمیاط"],
    country: "EG",
    lng: 31.816666666666666,
    lat: 31.416666666666668
  },
  {
    names: ["دیرفورت آن در آلتمول", "Dietfurt a.d.Altmühl"],
    country: "DE",
    lng: 11.583333333333334,
    lat: 49.03333333333333
  },
  {
    names: ["لنه، آلمان", "Lohne"],
    country: "DE",
    lng: 8.23861111111111,
    lat: 52.666666666666664
  },
  {
    names: ["حلفای جدید"],
    country: "SD",
    lng: 35.61388888888889,
    lat: 15.203333333333333
  },
  {
    names: ["لاکینسک", "Лакинск"],
    country: "RU",
    lng: 39.96666666666667,
    lat: 56.03333333333333
  },
  {
    names: ["آغوانی", "Աղվանի"],
    country: "AM",
    lng: 46.30305555555555,
    lat: 39.355000000000004
  },
  { names: ["گوپینگن"], country: "DE", lng: 9.652777777777779, lat: 48.7025 },
  {
    names: ["مونروویا", "Monrovia"],
    country: "LR",
    lng: -10.801388888888889,
    lat: 6.3133333333333335
  },
  {
    names: ["کارادزور", "Քարաձոր"],
    country: "AM",
    lng: 44.31666666666667,
    lat: 40.847500000000004
  },
  {
    names: ["هنف (زیگ)", "Hennef"],
    country: "DE",
    lng: 7.283333333333333,
    lat: 50.78333333333333
  },
  {
    names: ["فرایبرگ آم نکار"],
    country: "DE",
    lng: 9.2,
    lat: 48.93333333333333
  },
  { names: ["اشترالزوند"], country: "DE", lng: 13.083333333333334, lat: 54.3 },
  {
    names: ["زولتسبورگ"],
    country: "DE",
    lng: 7.7091666666666665,
    lat: 47.84027777777778
  },
  {
    names: ["هلسینکی", "Helsingin kaupunki", "Helsingfors stad"],
    country: "FI",
    lng: 24.9375,
    lat: 60.170833333333334
  },
  {
    names: ["گورودیشچه، بخش گورودیشچنسکی، اوبلاست پنزا", "Городище"],
    country: "RU",
    lng: 45.7,
    lat: 53.28333333333333
  },
  { names: ["سادرهامن"], country: "SE", lng: 17.083333333333332, lat: 61.3 },
  { names: ["دیاربکر", "Diyarbakır"], country: "TR", lng: 40.24, lat: 37.91 },
  {
    names: [
      "کینگستون، جاماییکا",
      "شهر کینگستون، جاماییکا",
      "City of Kingston, Jamaica"
    ],
    country: "JM",
    lng: -76.8,
    lat: 17.983333333333334
  },
  { names: ["مالنگ", ""], country: "ID", lng: 112.61999999999999, lat: -7.98 },
  {
    names: ["لوسارات"],
    country: "AM",
    lng: 44.59916666666667,
    lat: 39.87444444444444
  },
  {
    names: ["کوانژو", "Quanzhou", "泉州市"],
    country: "CN",
    lng: 118.58333333333333,
    lat: 24.916666666666668
  },
  {
    names: ["میرکورا چو", "(به رومانیایی: Miercurea Ciuc)"],
    country: "RO",
    lng: 25.8,
    lat: 46.35
  },
  { names: ["فورتسهایم"], country: "DE", lng: 8.716666666666667, lat: 48.9 },
  {
    names: ["بیوو (سوید)", "Bjuv"],
    country: "SE",
    lng: 12.916666666666666,
    lat: 56.083333333333336
  },
  {
    names: ["آریویک", "Արևիկ"],
    country: "AM",
    lng: 43.89277777777778,
    lat: 40.736111111111114
  },
  {
    names: ["نانسی", "Nancy"],
    country: "FR",
    lng: 6.184722222222223,
    lat: 48.69361111111111
  },
  { names: ["دورن‌اشتتن"], country: "DE", lng: 8.5, lat: 48.46666666666667 },
  { names: ["آق‌قلا"], lng: 54.4572, lat: 37.0144 },
  {
    names: ["سوروچ"],
    country: "TR",
    lng: 38.426944444444445,
    lat: 36.97638888888889
  },
  {
    names: ["ایتاگویی", "Itagüí"],
    country: "CO",
    lng: -75.61666666666666,
    lat: 6.166666666666667
  },
  {
    names: ["لیما", "Lima"],
    country: "PE",
    lng: -77.02833333333334,
    lat: -12.043333333333333
  },
  {
    names: ["زار، ارمنستان", "زار", "Զառ"],
    country: "AM",
    lng: 44.736111111111114,
    lat: 40.26111111111111
  },
  {
    names: ["وشیو ده سوس", "Vișeu de Sus"],
    country: "RO",
    lng: 24.42388888888889,
    lat: 47.70916666666667
  },
  { names: ["شازند"], lng: 49.4083, lat: 33.9356 },
  {
    names: ["رایشنباخ (فگتلند)"],
    country: "DE",
    lng: 12.3,
    lat: 50.61666666666667
  },
  {
    names: ["بومش-ژیو", "Bumbești-Jiu"],
    country: "RO",
    lng: 23.38138888888889,
    lat: 45.17861111111111
  },
  {
    names: ["اوکنه مورش", "Ocna Mureș"],
    country: "RO",
    lng: 23.860000000000003,
    lat: 46.39
  },
  {
    names: ["بوکشه", "Bocșa"],
    country: "RO",
    lng: 21.710555555555555,
    lat: 45.374722222222225
  },
  {
    names: ["پیشاور", "پېښور", "پشاور", "پشور"],
    country: "PK",
    lng: 71.58333333333333,
    lat: 34.016666666666666
  },
  { names: ["جوبا", "Juba"], country: "", lng: 31.6, lat: 4.85 },
  {
    names: ["کارینج", "Քարինջ"],
    country: "AM",
    lng: 44.68861111111111,
    lat: 40.973333333333336
  },
  {
    names: ["میجناتون", "Միջնատուն"],
    country: "AM",
    lng: 44.35666666666667,
    lat: 40.693888888888885
  },
  {
    names: ["جیلان‌پینار", "Ceylanpınar"],
    country: "TR",
    lng: 40.05,
    lat: 36.85
  },
  {
    names: ["فلنسبورگ"],
    country: "DE",
    lng: 9.436666666666667,
    lat: 54.78194444444444
  },
  {
    names: ["حیدرآباد (هند)", "حیدرآباد"],
    country: "IN",
    lng: 78.48,
    lat: 17.37
  },
  {
    names: ["نواکشوت", "نواکشوط", "Nouakchott"],
    country: "MR",
    lng: -15.95,
    lat: 18.1
  },
  {
    names: ["لیندنفلز"],
    country: "DE",
    lng: 8.783333333333333,
    lat: 49.68333333333333
  },
  {
    names: ["تبرو", "Tibro"],
    country: "SE",
    lng: 14.166666666666666,
    lat: 58.416666666666664
  },
  {
    names: ["کلسکوگا", "Karlskoga Sweden"],
    country: "SE",
    lng: 14.516666666666667,
    lat: 59.333333333333336
  },
  {
    names: ["کنستانتس"],
    country: "DE",
    lng: 9.175277777777778,
    lat: 47.663333333333334
  },
  {
    names: ["بیروت", "Beyrouth"],
    country: "LB",
    lng: 35.51305555555555,
    lat: 33.886944444444445
  },
  {
    names: ["سویا (شهر)", "سبیا", "(به اسپانیایی: Sevilla)"],
    country: "ES",
    lng: -5.986944444444444,
    lat: 37.37722222222222
  },
  {
    names: ["آولینو", "Avellino"],
    country: "IT",
    lng: 14.783333333333333,
    lat: 40.916666666666664
  },
  {
    names: ["ردینگ، آلمان", "Roding"],
    country: "DE",
    lng: 12.516666666666667,
    lat: 49.2
  },
  {
    names: ["تکیرداغ", "Tekirdağ"],
    country: "TR",
    lng: 27.516666666666666,
    lat: 40.983333333333334
  },
  {
    names: ["باگریا", "Bagheria"],
    country: "IT",
    lng: 13.5,
    lat: 38.083333333333336
  },
  {
    names: ["کلمبوس، جورجیا", "Columbus"],
    country: "US",
    lng: -84.94027777777778,
    lat: 32.492222222222225
  },
  {
    names: ["سانتا کلارا (کوبا)"],
    country: "CU",
    lng: -79.9649388888889,
    lat: 22.406919444444444
  },
  {
    names: ["پورتو نووو", "پورتو نوو", "Hogbonou, Adjacé", "Porto-Novo"],
    country: "BJ",
    lng: 2.6,
    lat: 6.466666666666667
  },
  { names: ["طابا"], country: "EG", lng: 34.88333333333333, lat: 29.5 },
  {
    names: ["نیدر-الم"],
    country: "DE",
    lng: 8.202777777777778,
    lat: 49.90833333333333
  },
  {
    names: ["زمیییف", "Zmiiv", "Зміїв"],
    country: "UA",
    lng: 36.36666666666667,
    lat: 49.86666666666667
  },
  {
    names: ["خیخن", "(به اسپانیایی: Gijón / Xixón)"],
    country: "ES",
    lng: -5.7,
    lat: 43.53333333333333
  },
  {
    names: ["کوریوکیفکا", "Koriukivka", "Корюківка"],
    country: "UA",
    lng: 32.6,
    lat: 51.25
  },
  {
    names: ["سووتسک، اوبلاست تولا", "Советск"],
    country: "RU",
    lng: 37.61666666666667,
    lat: 53.93333333333333
  },
  {
    names: ["تولوز", "Toulouse"],
    country: "FR",
    lng: 1.443888888888889,
    lat: 43.60444444444445
  },
  {
    names: ["کروناخ"],
    country: "DE",
    lng: 11.328055555555554,
    lat: 50.24111111111111
  },
  {
    names: ["تساپاتاغ", "Ծափաթաղ"],
    country: "AM",
    lng: 45.53333333333333,
    lat: 40.421388888888885
  },
  {
    names: ["کاشغر", "喀什市 · قەشقەر شەھری"],
    country: "CN",
    lng: 75.98333333333333,
    lat: 39.46666666666667
  },
  {
    names: ["اشتاینهایم آن در مور"],
    country: "DE",
    lng: 9.283333333333333,
    lat: 48.96666666666667
  },
  {
    names: ["متس سپاسار", "Մեծ Սեպասար"],
    country: "AM",
    lng: 43.82333333333334,
    lat: 41.049166666666665
  },
  {
    names: ["آق‌حصار", "Akhisar"],
    country: "TR",
    lng: 27.833333333333332,
    lat: 38.916666666666664
  },
  { names: ["هرجیسا", "Hargeysa"], country: "SO", lng: 44.5, lat: 10 },
  { names: ["صومعه‌سرا", "سوماسرا[1]"], lng: 49.3033, lat: 37.2958 },
  {
    names: ["هالدنسلبن"],
    country: "DE",
    lng: 11.416666666666666,
    lat: 52.28333333333333
  },
  {
    names: ["گوونو"],
    country: "PL",
    lng: 19.711666666666666,
    lat: 51.96416666666667
  },
  {
    names: ["نوی‌اشتات آم روبنبرگه", "Neustadt am Rübenberge"],
    country: "DE",
    lng: 9.466666666666667,
    lat: 52.5
  },
  {
    names: ["بلیز سیتی"],
    country: "BZ",
    lng: -88.18666666666667,
    lat: 17.504722222222224
  },
  {
    names: ["لاذقیه", "اللَاذِقِیَّه"],
    country: "SY",
    lng: 35.78333333333333,
    lat: 35.516666666666666
  },
  {
    names: ["پوتی"],
    country: "GE",
    lng: 41.67638888888889,
    lat: 42.14194444444444
  },
  {
    names: ["آوگسبورگ"],
    country: "DE",
    lng: 10.898333333333333,
    lat: 48.37166666666667
  },
  {
    names: ["آلتینولوک", "Altınoluk"],
    country: "TR",
    lng: 26.73935,
    lat: 39.58234
  },
  {
    names: ["نویوید"],
    country: "DE",
    lng: 7.461388888888889,
    lat: 50.42861111111111
  },
  { names: ["کیشیناو"], country: "MD", lng: 28.916666666666668, lat: 47 },
  {
    names: ["ولنی ده مونته", "Vălenii de Munte"],
    country: "RO",
    lng: 26.039722222222224,
    lat: 45.18555555555555
  },
  {
    names: ["لیشتنفلز، هسن", "Lichtenfels"],
    country: "DE",
    lng: 8.8,
    lat: 51.15
  },
  { names: ["تبریز"], lng: 46.3, lat: 38.08 },
  {
    names: ["اشپنگه"],
    country: "DE",
    lng: 8.483055555555556,
    lat: 52.13305555555556
  },
  { names: ["ارومیه"], lng: 45.04, lat: 37.33 },
  { names: ["شریفیه"], lng: 50.150953, lat: 36.216277 },
  {
    names: ["گشر", "Gescher"],
    country: "DE",
    lng: 7.0055555555555555,
    lat: 51.956944444444446
  },
  {
    names: ["کوکوتا", "San José de Cúcuta"],
    country: "CO",
    lng: -72.5038888888889,
    lat: 7.894166666666666
  },
  { names: ["آیسلبن"], country: "DE", lng: 11.55, lat: 51.516666666666666 },
  {
    names: ["کالکار"],
    country: "DE",
    lng: 6.2924999999999995,
    lat: 51.73888888888889
  },
  {
    names: ["شروتسبرگ"],
    country: "DE",
    lng: 9.980555555555556,
    lat: 49.34444444444445
  },
  {
    names: ["باد تن‌اشتت"],
    country: "DE",
    lng: 10.837222222222223,
    lat: 51.153888888888886
  },
  {
    names: ["بیسمارک، داکوتای شمالی", "بیسمارک", "Bismarck"],
    country: "US",
    lng: -100.77888888888889,
    lat: 46.81333333333333
  },
  {
    names: ["آراکساوان", "Արաքսավան"],
    country: "AM",
    lng: 44.47,
    lat: 40.00111111111111
  },
  {
    names: ["گرس‌المروده", "Großalmerode"],
    country: "DE",
    lng: 9.784444444444444,
    lat: 51.2575
  },
  { names: ["ام درمان"], country: "SD", lng: 32.483333333333334, lat: 15.65 },
  {
    names: ["سانتا فه ده انتیوکیا", "Santa Fe de Antioquia"],
    country: "CO",
    lng: -75.81666666666666,
    lat: 6.55
  },
  {
    names: ["ماکاپا", "Macapá"],
    country: "BR",
    lng: -51.06638888888889,
    lat: 0.033888888888888885
  },
  {
    names: ["لیوبلیانا", "Ljubljana"],
    country: "SI",
    lng: 14.508333333333333,
    lat: 46.05555555555555
  },
  {
    names: ["سایو برناردو دو کامپو", "São Bernardo do Campo"],
    country: "BR",
    lng: -46.55,
    lat: -23.7
  },
  { names: ["آشخانه"], lng: 56.9119, lat: 37.6042 },
  {
    names: ["کایزرزش"],
    country: "DE",
    lng: 7.139444444444445,
    lat: 50.23222222222223
  },
  {
    names: ["آمراکیتس", "Ամրակից"],
    country: "AM",
    lng: 44.42722222222222,
    lat: 40.99722222222222
  },
  {
    names: ["نیدرکاسل", "Niederkassel"],
    country: "DE",
    lng: 7.033333333333333,
    lat: 50.81666666666667
  },
  {
    names: ["چاسیو یار", "Chasiv Yar", "Часів Яр"],
    country: "UA",
    lng: 38.416666666666664,
    lat: 48.96666666666667
  },
  {
    names: ["رگیس-برایتینگن"],
    country: "DE",
    lng: 12.45,
    lat: 51.083333333333336
  },
  { names: ["ابرکوه"], lng: 53.2824, lat: 31.1289 },
  {
    names: ["راوا-روسکا", "Rava-Ruska", "Рава-Руська"],
    country: "UA",
    lng: 23.624166666666667,
    lat: 50.225
  },
  {
    names: ["نور آرتامت", "Նոր Արտամետ"],
    country: "AM",
    lng: 44.55416666666667,
    lat: 40.29888888888889
  },
  {
    names: ["اوتسانو"],
    country: "IT",
    lng: 13.439722222222223,
    lat: 42.04111111111111
  },
  {
    names: ["براندنبورگ آن در هافل"],
    country: "DE",
    lng: 12.533333333333333,
    lat: 52.416666666666664
  },
  {
    names: ["لوسادزور", "Լուսաձոր"],
    country: "AM",
    lng: 45.13333333333333,
    lat: 40.93333333333333
  },
  {
    names: ["مونپلیه، ورمانت", "Montpelier, Vermont"],
    country: "US",
    lng: -72.56666666666666,
    lat: 44.25
  },
  {
    names: ["دینکلاگه", "Dinklage"],
    country: "DE",
    lng: 8.125,
    lat: 52.66222222222222
  },
  {
    names: ["باد نوی‌اشتات آن در زاله"],
    country: "DE",
    lng: 10.216111111111111,
    lat: 50.32194444444445
  },
  {
    names: ["بمبیی", "مومبای", "मुंबई"],
    country: "IN",
    lng: 72.82583333333334,
    lat: 18.974999999999998
  },
  { names: ["هایلزبرون"], country: "DE", lng: 10.8, lat: 49.31666666666667 },
  {
    names: ["مونترآل", "Montréal"],
    country: "CA",
    lng: -73.65,
    lat: 45.516666666666666
  },
  { names: ["لوزان", "Lausanne"], lng: 6.38, lat: 46.31 },
  { names: ["مالیشکا"], country: "AM", lng: 45.3875, lat: 39.73694444444445 },
  {
    names: ["اینه‌بولو", "İnebolu"],
    country: "TR",
    lng: 33.766666666666666,
    lat: 41.96666666666667
  },
  {
    names: ["گلندیل (کالیفرنیا)"],
    country: "",
    lng: -118.25,
    lat: 34.170833333333334
  },
  {
    names: ["مرگیته", "Marghita", "Margitta"],
    country: "RO",
    lng: 22.333333333333332,
    lat: 47.35
  },
  {
    names: ["چانگژو", "常州市"],
    country: "CN",
    lng: 119.96666666666667,
    lat: 31.783333333333335
  },
  {
    names: ["میرانه"],
    country: "DE",
    lng: 12.46361111111111,
    lat: 50.85194444444445
  },
  { names: ["قدس (قدس)"], lng: 51.11, lat: 35.72 },
  {
    names: ["نوو دوور مازوویتسکی"],
    country: "PL",
    lng: 20.683333333333334,
    lat: 52.43333333333333
  },
  {
    names: ["دویسبورگ", "Duisburg"],
    country: "DE",
    lng: 6.762691666666667,
    lat: 51.43514722222222
  },
  {
    names: ["فالندار"],
    country: "DE",
    lng: 7.617222222222223,
    lat: 50.400277777777774
  },
  {
    names: ["اشترمبرگ (هونزروک)", "Stromberg"],
    country: "DE",
    lng: 7.779444444444445,
    lat: 49.94694444444444
  },
  { names: ["لووف", "لویو", "Львів"], country: "UA", lng: 48, lat: 29 },
  {
    names: ["لیژ", "Liège"],
    country: "BE",
    lng: 5.566666666666666,
    lat: 50.63333333333333
  },
  {
    names: ["اوکایاما", "Okayama", "岡山"],
    country: "JP",
    lng: 133.91666666666666,
    lat: 34.65
  },
  {
    names: ["نوشهر (ترکیه)", "نوشهر"],
    country: "TR",
    lng: 34.71388888888889,
    lat: 38.62638888888889
  },
  { names: ["تولچا", "Tulcea"], country: "RO", lng: 28.8, lat: 45.19 },
  {
    names: ["هوروم", "Հոռոմ"],
    country: "AM",
    lng: 43.882222222222225,
    lat: 40.65416666666667
  },
  {
    names: ["شپفهایم"],
    country: "DE",
    lng: 7.824722222222222,
    lat: 47.64944444444444
  },
  {
    names: ["هامرفست (شهرک)", "Hammerfest"],
    lng: 23.681944444444447,
    lat: 70.66333333333334
  },
  {
    names: ["کالی (شهر)", "Cali"],
    country: "CO",
    lng: -76.52222222222223,
    lat: 3.4205555555555556
  },
  {
    names: ["مونزینگن (وورتمبرگ)", "Münsingen"],
    country: "DE",
    lng: 9.495277777777776,
    lat: 48.41277777777778
  },
  {
    names: ["کوپشا میکا", "Copşa Mică"],
    country: "RO",
    lng: 24.230555555555554,
    lat: 46.112500000000004
  },
  {
    names: ["باد هونینگن"],
    country: "DE",
    lng: 7.3086111111111105,
    lat: 50.51777777777777
  },
  {
    names: ["فجیره", "الفجیره"],
    country: "AE",
    lng: 56.333333333333336,
    lat: 25.266666666666666
  },
  { names: ["برگهولزهاوزن"], country: "DE", lng: 8.3, lat: 52.1 },
  {
    names: ["پورت مورزبی", "Pot Mosbi", "Port Moresb"],
    country: "PG",
    lng: 147.28333333333333,
    lat: -9.416666666666666
  },
  {
    names: ["پامپلونا", "(به اسپانیایی: Pamplona)"],
    country: "ES",
    lng: -1.6441666666666666,
    lat: 42.818333333333335
  },
  {
    names: ["کارادنیز ارغلی", "Ereğli"],
    country: "TR",
    lng: 31.425,
    lat: 41.25833333333333
  },
  {
    names: ["زالتسبورگ", "زالتسبورگ، اتریش"],
    country: "AT",
    lng: 13.033333333333333,
    lat: 47.8
  },
  {
    names: ["آرزبرگ (اوبرفرانکن)", "آرزبرگ", "Arzberg"],
    country: "DE",
    lng: 12.186388888888889,
    lat: 50.05722222222222
  },
  {
    names: ["ارفورت", "Erfurt"],
    country: "DE",
    lng: 11.033333333333333,
    lat: 50.983333333333334
  },
  {
    names: ["میخاییلوف، اوبلاست ریازان", "Михайлов"],
    country: "RU",
    lng: 39.03333333333333,
    lat: 54.233333333333334
  },
  { names: ["ژنو", "Geneva"], lng: 6.09, lat: 46.12 },
  {
    names: ["اواایمیر", "Ovaeymir"],
    country: "TR",
    lng: 27.833333333333332,
    lat: 37.81666666666667
  },
  { names: ["لووف", "لویو", "Львів"], country: "UA", lng: 48, lat: 29 },
  {
    names: ["نارا (ژاپن)", "Nara", "奈良"],
    country: "JP",
    lng: 135.8,
    lat: 34.68333333333333
  },
  {
    names: ["شهرستان آرلینگتون، ویرجینیا", "آرلینگتون", "Arlington County"],
    country: "US",
    lng: -77.10833333333333,
    lat: 38.88027777777778
  },
  {
    names: ["برزان", "Березань"],
    country: "UA",
    lng: 31.47,
    lat: 50.319722222222225
  },
  {
    names: ["شیر (دانوب)", "Scheer"],
    country: "DE",
    lng: 9.293333333333333,
    lat: 48.07361111111111
  },
  {
    names: ["فوکینو، استان بریانسک", "Фокино"],
    country: "RU",
    lng: 34.41861111111111,
    lat: 53.21277777777778
  },
  {
    names: ["آلتنکیرشن"],
    country: "DE",
    lng: 7.645555555555555,
    lat: 50.68722222222222
  },
  {
    names: ["دوشان‌لی", "تاوشانلو"],
    country: "TR",
    lng: 29.483333333333334,
    lat: 39.53333333333333
  },
  {
    names: ["هورس، ارمنستان", "هورس", "Հորս"],
    country: "AM",
    lng: 45.23027777777778,
    lat: 39.862500000000004
  },
  { names: ["تربت جام", "جام"], lng: 60.6219, lat: 35.2408 },
  {
    names: ["مارینبرگ (ارتسگبیرگه)", "Marienberg"],
    country: "DE",
    lng: 13.15,
    lat: 50.63333333333333
  },
  {
    names: ["ریوسوسیو (کالداس)", "Riosucio, Caldas"],
    country: "CO",
    lng: -75.7025,
    lat: 5.420833333333333
  },
  {
    names: ["بارکاماوان", "Բարեկամավան"],
    country: "AM",
    lng: 45.109722222222224,
    lat: 41.17916666666667
  },
  {
    names: ["فولکاخ"],
    country: "DE",
    lng: 10.216666666666667,
    lat: 49.86666666666667
  },
  {
    names: ["آنیاوان", "Անիավան"],
    country: "AM",
    lng: 43.641666666666666,
    lat: 40.46666666666667
  },
  {
    names: ["اشلیتس (فوگلزبرگکرایس)", "Schlitz"],
    country: "DE",
    lng: 9.566666666666666,
    lat: 50.666666666666664
  },
  { names: ["آنتاراشن", "Անտառաշեն"], country: "AM", lng: 44.625, lat: 40.75 },
  {
    names: ["وینتیان", "ວຽງຈັນ", "Vientiane"],
    country: "LA",
    lng: 102.6,
    lat: 17.966666666666665
  },
  {
    names: ["چای‌جوما"],
    country: "TR",
    lng: 32.075833333333335,
    lat: 41.42666666666666
  },
  {
    names: [
      "کواوهتموک، چیواوا",
      "Ciudad Cuauhtémoc, San antonio de los arenales"
    ],
    country: "MX",
    lng: -106.86666666666666,
    lat: 28.404999999999998
  },
  { names: ["دهلران", "دیلڕو، دیلڕان"], lng: 47.26936457, lat: 32.69020237 },
  {
    names: ["پورتو بایارتا، خالیسکو"],
    country: "MX",
    lng: -105.26666666666667,
    lat: 20.666666666666668
  },
  {
    names: ["پرمنیتز"],
    country: "DE",
    lng: 12.333055555555555,
    lat: 52.533055555555556
  },
  { names: ["مونتری"], country: "MX", lng: -100.3, lat: 25.666666666666668 },
  {
    names: ["هیلدبورگ‌هاوزن"],
    country: "DE",
    lng: 10.75,
    lat: 50.416666666666664
  },
  {
    names: ["باخ‌آراخ"],
    country: "DE",
    lng: 7.766666666666667,
    lat: 50.06666666666667
  },
  { names: ["گرویسن"], country: "DE", lng: 10.9475, lat: 51.22916666666667 },
  {
    names: ["هووتامج", "Հովտամեջ"],
    country: "AM",
    lng: 44.257222222222225,
    lat: 40.183611111111105
  },
  { names: ["نینسهم", "Nynäshamn"], country: "SE", lng: 17.95, lat: 58.9 },
  {
    names: ["باد الستر"],
    country: "DE",
    lng: 12.23472222222222,
    lat: 50.28194444444444
  },
  {
    names: ["بینگول"],
    country: "TR",
    lng: 40.501666666666665,
    lat: 38.88611111111111
  },
  {
    names: ["سانتا روزا، کالیفرنیا", "سانتا روزا"],
    country: "US",
    lng: -122.70472222222223,
    lat: 38.448611111111106
  },
  {
    names: ["آبیجان", "Abidjan"],
    country: "CI",
    lng: -4.033333333333333,
    lat: 5.316666666666666
  },
  { names: ["ادکو"], country: "EG", lng: 30.3, lat: 31.3 },
  {
    names: ["استان نوردیولند", "ژوتلند شمالی", "Region Nordjylland"],
    country: "DK",
    lng: 10,
    lat: 57
  },
  {
    names: ["ویرجینیا بیچ، ویرجینیا", "ویرجینیا بیچ", "Virginia Beach"],
    country: "US",
    lng: -75.9779,
    lat: 36.8506
  },
  {
    names: ["سندای", "仙台"],
    country: "JP",
    lng: 140.86666666666667,
    lat: 38.266666666666666
  },
  {
    names: ["باد اشوالباخ", "Bad Schwalbach"],
    country: "DE",
    lng: 8.066666666666666,
    lat: 50.13333333333333
  },
  {
    names: ["اوتوان", "Օթևան"],
    country: "AM",
    lng: 44.055277777777775,
    lat: 40.36083333333333
  },
  {
    names: ["میزا، آریزونا", "Mesa, Arizona"],
    country: "US",
    lng: -111.83138888888888,
    lat: 33.415
  },
  {
    names: ["آرگینا، ارمنستان", "آرگینا", "Արգինա"],
    country: "AM",
    lng: 43.7,
    lat: 40.25
  },
  {
    names: ["کلیرواتر، فلوریدا", "Clearwater"],
    country: "US",
    lng: -82.76416666666667,
    lat: 27.973611111111108
  },
  {
    names: ["شارجه", "اماره الشارقهّ"],
    country: "AE",
    lng: 55.38333333333333,
    lat: 25.433333333333334
  },
  {
    names: ["نوین‌اشتاین (هوهن‌لوهه)", "Neuenstein"],
    country: "DE",
    lng: 9.583333333333334,
    lat: 49.2
  },
  { names: ["فرناندو دلا مورا"], country: "PY", lng: -57.54, lat: -25.32 },
  {
    names: ["پوونگسک"],
    country: "PL",
    lng: 20.383333333333333,
    lat: 52.63333333333333
  },
  {
    names: ["کارمراوان", "Կարմրավան"],
    country: "AM",
    lng: 43.86944444444445,
    lat: 41.01277777777778
  },
  {
    names: ["مالونگ", "Malung"],
    country: "SE",
    lng: 13.733333333333333,
    lat: 60.68333333333333
  },
  {
    names: ["هونولولو", "Honolulu, Hawaii"],
    country: "US",
    lng: -157.82611111111112,
    lat: 21.30888888888889
  },
  {
    names: ["تونس (شهر)", "تونس"],
    country: "TN",
    lng: 10.183333333333334,
    lat: 36.8
  },
  {
    names: ["توروسگیوغ", "Թորոսգյուղ"],
    country: "AM",
    lng: 43.8775,
    lat: 40.934999999999995
  },
  {
    names: ["درگشنه", "Drăgășani"],
    country: "RO",
    lng: 24.260555555555555,
    lat: 44.66111111111111
  },
  { names: ["فسا"], lng: 53.39, lat: 28.55 },
  {
    names: ["ایزلبورگ", "Isselburg"],
    country: "DE",
    lng: 6.466666666666667,
    lat: 51.83305555555556
  },
  {
    names: ["کرایووا", "(به رومانیایی: Craiova)"],
    country: "RO",
    lng: 23.816666666666666,
    lat: 44.333333333333336
  },
  {
    names: ["رمنیکو سره", "Râmnicu Sărat"],
    country: "RO",
    lng: 27.060000000000002,
    lat: 45.38
  },
  {
    names: ["بروخه", "Brugge"],
    country: "BE",
    lng: 3.2333333333333334,
    lat: 51.21666666666667
  },
  {
    names: ["دوبلن"],
    country: "DE",
    lng: 13.112777777777778,
    lat: 51.11944444444445
  },
  {
    names: ["لاس وگاس شمالی (نوادا)", "North Las Vegas, Nevada"],
    country: "US",
    lng: -115.14666666666668,
    lat: 36.228611111111114
  },
  {
    names: ["لوفینگن"],
    country: "DE",
    lng: 8.343611111111112,
    lat: 47.88388888888889
  },
  {
    names: ["تیمبوکتو", "Timbuktu"],
    country: "ML",
    lng: -3.0094444444444446,
    lat: 16.77583333333333
  },
  {
    names: ["گرند پریری", "Grande Prairie"],
    country: "CA",
    lng: -118.79472222222222,
    lat: 55.170833333333334
  },
  {
    names: ["کلکیت", "Kelkit"],
    country: "TR",
    lng: 39.43333333333333,
    lat: 40.13333333333333
  },
  {
    names: ["اودوالا", "Uddevalla"],
    country: "SE",
    lng: 11.916666666666666,
    lat: 58.35
  },
  {
    names: [
      "ریکیاویک",
      "شهر ریکیاویک",
      "(به ایسلندی: Reykjavíkurbor)",
      "(به انگلیسی: City of Reykjavik)"
    ],
    country: "IS",
    lng: -21.933333333333334,
    lat: 64.13333333333334
  },
  {
    names: ["پارپی", "Փարպի"],
    country: "AM",
    lng: 44.30722222222222,
    lat: 40.32944444444445
  },
  {
    names: ["اورتاکلار", "Ortaklar", "(Pınarbaşı)"],
    country: "TR",
    lng: 27.5,
    lat: 37.88333333333333
  },
  {
    names: ["لچاشن", "Լճաշեն"],
    country: "AM",
    lng: 44.93083333333333,
    lat: 40.52027777777778
  },
  {
    names: ["سیوداد اوبرگن"],
    country: "MX",
    lng: -109.935,
    lat: 27.489166666666666
  },
  {
    names: ["گغاکار", "Գեղաքար"],
    country: "AM",
    lng: 45.683055555555555,
    lat: 40.11694444444444
  },
  {
    names: ["سانتیاگو", "Santiago"],
    country: "CL",
    lng: -70.66666666666667,
    lat: 33.45
  },
  {
    names: ["فیربینس-تر", "Fierbinţi-Târg"],
    country: "RO",
    lng: 26.383333333333333,
    lat: 44.68333333333333
  },
  {
    names: ["داشتاکار", "Դաշտաքար"],
    country: "AM",
    lng: 44.75,
    lat: 39.916666666666664
  },
  {
    names: ["انسنادا، باخا کالیفرنیا"],
    country: "MX",
    lng: -116.60583333333332,
    lat: 31.85777777777778
  },
  {
    names: ["لنگنفلد (ووگتلند)", "Lengenfeld"],
    country: "DE",
    lng: 12.366666666666667,
    lat: 50.56666666666667
  },
  {
    names: ["قزل‌تپه"],
    country: "TR",
    lng: 40.586111111111116,
    lat: 37.193888888888885
  },
  {
    names: ["کانیاشیر", "Կանիաշիր"],
    country: "AM",
    lng: 44.24166666666667,
    lat: 40.656388888888884
  },
  {
    names: ["ایپوه", "怡保", "ஈப்போ"],
    country: "MY",
    lng: 101.06666666666666,
    lat: 4.6
  },
  {
    names: ["تساکار", "Ծակքար"],
    country: "AM",
    lng: 45.19916666666666,
    lat: 40.16777777777777
  },
  {
    names: ["آخیم", "Achim"],
    country: "DE",
    lng: 9.034166666666666,
    lat: 53.06527777777777
  },
  { names: ["اویبیگا-وارنبروک"], country: "DE", lng: 13.35, lat: 51.55 },
  {
    names: ["کوناکری", "Kɔnakiri", "Conakry"],
    country: "GN",
    lng: -13.7,
    lat: 9.516666666666667
  },
  {
    names: ["فوکویوکا", "شهر فوکویوکا", "福岡"],
    country: "JP",
    lng: 130.4,
    lat: 33.583333333333336
  },
  {
    names: ["اودون تانی", "อุดรธานี"],
    country: "TH",
    lng: 102.75,
    lat: 17.416666666666668
  },
  {
    names: ["نانت", "Nantes"],
    country: "FR",
    lng: 1.5527777777777778,
    lat: 47.21805555555556
  },
  {
    names: ["کولیما، کولیما"],
    country: "MX",
    lng: -103.72472222222223,
    lat: 19.243333333333336
  },
  {
    names: ["تفلیس", "თბილისი", "تْبیلیسی"],
    country: "GE",
    lng: 44.78333333333333,
    lat: 41.71666666666667
  },
  {
    names: ["فریدریشزدورف"],
    country: "DE",
    lng: 8.639722222222222,
    lat: 50.25555555555555
  },
  { names: ["مرسین"], country: "TR", lng: 34.63333333333333, lat: 36.8 },
  { names: ["ساقلته"], country: "EG", lng: 31.666666666666668, lat: 26.65 },
  {
    names: ["آستانه (قزاقستان)", "آستانه", "Астана"],
    country: "KZ",
    lng: 71.43333333333334,
    lat: 51.166666666666664
  },
  { names: ["هنگیانگ", "衡阳市"], country: "CN", lng: 112.6, lat: 26.9 },
  {
    names: ["بلمبرگ", "Blomberg"],
    country: "DE",
    lng: 9.083055555555555,
    lat: 51.933055555555555
  },
  {
    names: ["کاراگوآزو", "Caaguazú District"],
    country: "PY",
    lng: -56.019999999999996,
    lat: -25.46
  },
  {
    names: ["تروخیو (پرو)", "تروخیو", "Trujillo"],
    country: "PE",
    lng: -79.0288,
    lat: -8.112
  },
  {
    names: ["سلتسو", "Сельцо"],
    country: "RU",
    lng: 34.09777777777778,
    lat: 53.367777777777775
  },
  {
    names: ["تمپی، آریزونا"],
    country: "US",
    lng: -111.94305555555556,
    lat: 33.42944444444444
  },
  {
    names: ["جروژ", "Ջրվեժ"],
    country: "AM",
    lng: 44.58694444444445,
    lat: 40.18555555555555
  },
  {
    names: ["کاتماندو", "काठमाडौं"],
    country: "NP",
    lng: 85.33333333333333,
    lat: 27.7
  },
  {
    names: ["پرسات"],
    country: "DE",
    lng: 11.916666666666666,
    lat: 49.766666666666666
  },
  {
    names: ["پنیامو"],
    country: "MX",
    lng: -101.72222222222223,
    lat: 20.43111111111111
  },
  {
    names: ["کلوپنبورگ", "Cloppenburg"],
    country: "DE",
    lng: 8.043888888888889,
    lat: 52.84777777777778
  },
  {
    names: ["جنوا", "Genoa", "Genova"],
    country: "IT",
    lng: 8.932777777777778,
    lat: 44.41111111111111
  },
  {
    names: ["نوزده مه"],
    country: "TR",
    lng: 36.07888888888889,
    lat: 41.49444444444445
  },
  { names: ["راتنوا"], country: "DE", lng: 12.333333333333334, lat: 52.6 },
  {
    names: ["آرتامت", "Արտամետ"],
    country: "AM",
    lng: 43.85,
    lat: 40.11666666666667
  },
  {
    names: ["چیکلایو", "Chiclayo"],
    country: "PE",
    lng: -79.83661388888889,
    lat: -6.762961111111111
  },
  {
    names: ["سبیش", "Sebiș"],
    country: "RO",
    lng: 22.129444444444445,
    lat: 46.37277777777778
  },
  {
    names: ["ویدرن"],
    country: "DE",
    lng: 9.416666666666666,
    lat: 49.31666666666667
  },
  {
    names: ["زی‌لند، آلمان", "Seeland"],
    country: "DE",
    lng: 11.333333333333334,
    lat: 51.8
  },
  {
    names: ["روچستر، مینه‌سوتا", "شهر روچستر", "City of Rochester"],
    country: "US",
    lng: -92.46277777777777,
    lat: 44.02333333333333
  },
  {
    names: ["ووهلدار", "Vuhledar", "Угледар"],
    country: "UA",
    lng: 37.248333333333335,
    lat: 47.77916666666667
  },
  {
    names: ["اشتات‌پرتسلتن"],
    country: "DE",
    lng: 9.416666666666666,
    lat: 49.78333333333333
  },
  {
    names: ["جوهای", "珠海市"],
    country: "CN",
    lng: 113.56777777777778,
    lat: 22.276944444444442
  },
  {
    names: ["مونتلیبانو", "Montelíbano"],
    country: "CO",
    lng: -75.33333333333333,
    lat: 75.98333333333333
  },
  {
    names: ["خریستینیفکا", "Khrystynivka", "Христинівка"],
    country: "UA",
    lng: 29.966666666666665,
    lat: 48.8
  },
  {
    names: ["هرتسبرگ آم هارتس", "Herzberg am Harz"],
    country: "DE",
    lng: 10.341111111111111,
    lat: 51.6575
  },
  {
    names: ["گفر کنار اشلایتس"],
    country: "DE",
    lng: 11.85,
    lat: 50.43333333333333
  },
  {
    names: ["لوکنوالده"],
    country: "DE",
    lng: 13.166666666666666,
    lat: 52.083333333333336
  },
  {
    names: ["کوپاکابانا (انتیوکیا)", "Copacabana"],
    country: "CO",
    lng: -75.5,
    lat: 6.333333333333333
  },
  { names: ["کویت"], lng: 47.96666666666667, lat: 29.366666666666667 },
  {
    names: ["بول (بادن)", "Bühl"],
    country: "DE",
    lng: 8.135,
    lat: 48.695277777777775
  },
  {
    names: ["کلگری", "کَلگِری", "Calgary"],
    country: "CA",
    lng: -114.05722222222222,
    lat: 51.044999999999995
  },
  {
    names: ["ملدورف"],
    country: "DE",
    lng: 9.066666666666666,
    lat: 54.083333333333336
  },
  {
    names: ["گودمنیس", "Գուդեմնիս"],
    country: "AM",
    lng: 46.18333333333333,
    lat: 38.93333333333333
  },
  {
    names: ["پارانا، انتره ریوس", "پارانا", "Paraná"],
    country: "AR",
    lng: -60.53333333333333,
    lat: -31.733333333333334
  },
  {
    names: ["نورنبرگ", "Nürnberg"],
    country: "DE",
    lng: 11.083333333333334,
    lat: 49.45
  },
  { names: ["ونزویلا"], lng: -66.96666666666667, lat: 10.5 },
  { names: ["پنتسلین"], country: "DE", lng: 13.083055555555555, lat: 53.505 },
  {
    names: ["کاردیف", "Dinas a Sir Caerdydd", "Cardiff"],
    country: "GB",
    lng: -3.183333333333333,
    lat: 51.483333333333334
  },
  {
    names: ["مارکت‌اوبردورف"],
    country: "DE",
    lng: 10.616666666666667,
    lat: 47.766666666666666
  },
  {
    names: ["اوماها، نبراسکا", "City of Omaha"],
    country: "US",
    lng: -96,
    lat: 41.25
  },
  {
    names: ["بیدنکپف"],
    country: "DE",
    lng: 8.532222222222224,
    lat: 50.91277777777778
  },
  { names: ["عجب‌شیر", "عجب شی، آچاب شیر"], lng: 45.55, lat: 37.28 },
  {
    names: ["نایپیداو", "Naypyidaw", ""],
    country: "MM",
    lng: 58.591944444444444,
    lat: 23.608611111111113
  },
  { names: ["زالتسودل"], country: "DE", lng: 11.15, lat: 52.85 },
  {
    names: ["گرینزبورو، کارولینای شمالی"],
    country: "US",
    lng: -79.81944444444444,
    lat: 36.080000000000005
  },
  {
    names: ["منامه", "Manama", "المنامه"],
    country: "BH",
    lng: 50.583333333333336,
    lat: 26.216666666666665
  },
  {
    names: ["کونیو", "Cuneo"],
    country: "IT",
    lng: 7.547777777777777,
    lat: 44.38944444444444
  },
  {
    names: ["کووپیو", "Kuopio"],
    country: "FI",
    lng: 27.678333333333335,
    lat: 62.8925
  },
  {
    names: ["فلورانس", "Firenze"],
    country: "IT",
    lng: 11.25,
    lat: 43.78333333333333
  },
  {
    names: ["چینگ‌دایو", "青岛市"],
    country: "CN",
    lng: 120.38333333333334,
    lat: 36.06666666666667
  },
  {
    names: ["ویسالیا، کالیفرنیا", "ویسالیا"],
    country: "US",
    lng: -119.30722222222222,
    lat: 36.32416666666667
  },
  {
    names: ["آغیتو", "Աղիտու"],
    country: "AM",
    lng: 46.08083333333334,
    lat: 39.515277777777776
  },
  {
    names: ["سیپان", "Սիփան"],
    country: "AM",
    lng: 44.26972222222222,
    lat: 40.72166666666667
  },
  {
    names: ["گرا"],
    country: "DE",
    lng: 12.083333333333334,
    lat: 50.88055555555555
  },
  {
    names: ["وستمینستر، کلرادو"],
    country: "US",
    lng: -105.05,
    lat: 39.86666666666667
  },
  {
    names: ["بیرمنگام", "بیرمنهگام", "City of Birmingham"],
    country: "GB",
    lng: -1.8936111111111111,
    lat: 52.48305555555556
  },
  {
    names: ["دیتزینگن"],
    country: "DE",
    lng: 9.066666666666666,
    lat: 48.82638888888889
  },
  {
    names: ["آرتسوانیک", "Արծվանիկ"],
    country: "AM",
    lng: 46.47361111111111,
    lat: 39.26166666666666
  },
  {
    names: ["آرتاشاوان", "Արտաշավան"],
    country: "AM",
    lng: 44.38138888888889,
    lat: 40.39361111111111
  },
  {
    names: ["ویتیشناو", "Wittichenau"],
    country: "DE",
    lng: 14.25,
    lat: 51.38333333333333
  },
  { names: ["بلنکن‌هاین"], country: "DE", lng: 11.34388888888889, lat: 50.86 },
  {
    names: ["تیانجین", "Tianjin", "天津"],
    country: "AM",
    lng: 117.18333333333334,
    lat: 39.13333333333333
  },
  {
    names: ["بالاهوویت", "Բալահովիտ"],
    country: "AM",
    lng: 44.60388888888889,
    lat: 40.25361111111111
  },
  {
    names: ["اوبرندورف آم نکا"],
    country: "DE",
    lng: 8.5725,
    lat: 48.29138888888889
  },
  { names: ["بوراشتت"], country: "DE", lng: 8.45, lat: 49.63333333333333 },
  {
    names: ["زقازیق", "الزقازیق"],
    country: "EG",
    lng: 31.5,
    lat: 30.566666666666666
  },
  {
    names: ["نرتهایم"],
    country: "DE",
    lng: 10.001111111111111,
    lat: 51.70666666666667
  },
  {
    names: ["گوستنگن"],
    country: "PL",
    lng: 19.466666666666665,
    lat: 52.416666666666664
  },
  {
    names: ["نوینراده", "Neuenrade"],
    country: "DE",
    lng: 7.78,
    lat: 51.28388888888889
  },
  {
    names: ["سیاستروی", "Сясьстрой"],
    country: "RU",
    lng: 32.583333333333336,
    lat: 60.15
  },
  {
    names: ["ارتنبرگ (هسن)", "Ortenberg"],
    country: "DE",
    lng: 9.055277777777778,
    lat: 50.35583333333334
  },
  {
    names: ["سانتو آندره", "Santo André"],
    country: "BR",
    lng: -46.53333333333333,
    lat: -23.65722222222222
  },
  {
    names: ["جنجیانگ", "镇江市"],
    country: "CN",
    lng: 119.41666666666667,
    lat: 32.2
  },
  {
    names: ["وازاشن", "Վազաշեն"],
    country: "AM",
    lng: 45.284166666666664,
    lat: 40.992222222222225
  },
  {
    names: ["زلم (نوردراین-وستفالن)"],
    country: "DE",
    lng: 7.483333333333333,
    lat: 51.68333333333333
  },
  {
    names: ["بلو هوریزونته", "Belo Horizonte"],
    country: "BR",
    lng: -43.93333333333333,
    lat: -19.916666666666668
  },
  {
    names: ["منگن، آلمان", "Mengen"],
    country: "DE",
    lng: 9.33,
    lat: 48.04972222222222
  },
  {
    names: ["هلسینگور", "Elsinore"],
    country: "DK",
    lng: 12.608333333333333,
    lat: 56.03611111111111
  },
  {
    names: ["هنگ کنگ", "منطقهٔ ویژهٔ اداری", "جمهوری خلق چین هنگ‌کنگ"],
    country: "AM",
    lng: 114.1588888888889,
    lat: 22.278333333333332
  },
  { names: ["حاجی‌آباد (زرین‌دشت)"], lng: 54.4183, lat: 28.3606 },
  {
    names: ["شیبان"],
    country: "IR",
    lng: 48.79416666666666,
    lat: 31.40861111111111
  },
  {
    names: ["ولتسو"],
    country: "DE",
    lng: 14.183055555555555,
    lat: 51.56666666666667
  },
  {
    names: ["استان گغارکونیک", "Գեղարքունիքի մարզ"],
    country: "AM",
    lng: 45.2,
    lat: 40.416666666666664
  },
  {
    names: ["فوهن‌اشتراوس"],
    country: "DE",
    lng: 12.333333333333334,
    lat: 49.61666666666667
  },
  { names: ["محمدیه (قزوین)"], lng: 50.1311, lat: 36.15 },
  {
    names: ["کورتا ده ارجش", "Curtea de Argeș"],
    country: "RO",
    lng: 24.679166666666667,
    lat: 45.13916666666667
  },
  {
    names: ["فرزنو، کالیفرنیا", "فرزنو"],
    country: "US",
    lng: -119.7725,
    lat: 36.74777777777778
  },
  {
    names: ["بالبوآ (کایوکا)", "Balboa"],
    country: "CO",
    lng: -77.21972222222223,
    lat: 2.043611111111111
  },
  { names: ["دربکایو"], country: "DE", lng: 14.216666666666667, lat: 51.65 },
  {
    names: ["ملوی"],
    country: "EG",
    lng: 30.833333333333332,
    lat: 27.733333333333334
  },
  {
    names: ["فولدا"],
    country: "DE",
    lng: 9.675277777777778,
    lat: 50.55083333333333
  },
  { names: ["شانلی‌اورفه", "رها"], country: "TR", lng: 38.8, lat: 37.15 },
  { names: ["کوم امبو"], country: "EG", lng: 32.95, lat: 24.466666666666665 },
  {
    names: ["هراره", "Harare", "Salisbury"],
    country: "ZW",
    lng: 31.029722222222222,
    lat: -17.86388888888889
  },
  {
    names: ["بورشتین", "Bursztyn"],
    country: "UA",
    lng: 24.633333333333333,
    lat: 49.266666666666666
  },
  {
    names: ["لرنوت", "Լեռնուտ"],
    country: "AM",
    lng: 43.916666666666664,
    lat: 40.86666666666667
  },
  {
    names: ["کامنوگورسک", "Каменногорск"],
    country: "RU",
    lng: 29.133333333333333,
    lat: 60.95
  },
  {
    names: ["اشوایلر", "Eschweiler"],
    country: "DE",
    lng: 6.283333333333333,
    lat: 50.81666666666667
  },
  {
    names: [
      "بیلهورود-دنیستروفسکیی",
      "Bilhorod-Dnistrovskyi",
      "Білгород-Дністровський"
    ],
    country: "UA",
    lng: 30.333333333333332,
    lat: 46.19222222222222
  },
  {
    names: ["برکابر", "Բերքաբեր"],
    country: "AM",
    lng: 45.15,
    lat: 41.06666666666667
  },
  { names: ["مینودشت"], lng: 55.22, lat: 37.13 },
  { names: ["بوکان"], lng: 46.215, lat: 36.8819 },
  {
    names: ["گرن (تورینگن)"],
    country: "DE",
    lng: 11.003333333333334,
    lat: 50.64861111111111
  },
  {
    names: ["حلوان (ترکیه)", "حلوان"],
    country: "TR",
    lng: 38.955555555555556,
    lat: 37.58861111111111
  },
  {
    names: ["وستراشتده", "Westerstede"],
    country: "DE",
    lng: 7.916666666666667,
    lat: 53.25
  },
  {
    names: ["اشتاینهایم، وستفالن", "Steinheim"],
    country: "DE",
    lng: 9.094444444444445,
    lat: 51.865833333333335
  },
  {
    names: ["لایپهایم", "Leipheim"],
    country: "DE",
    lng: 10.220833333333333,
    lat: 48.44888888888889
  },
  {
    names: ["برامشه", "Bramsche"],
    country: "DE",
    lng: 7.983333333333333,
    lat: 52.4
  },
  { names: ["اهواز"], lng: 48.65, lat: 31.3 },
  {
    names: ["نیویورک", "نیویورک سیتی"],
    country: "US",
    lng: -74,
    lat: 40.71666666666667
  },
  {
    names: ["خمیلنیک", "Khmilnyk", "Хмільник"],
    country: "UA",
    lng: 27.95722222222222,
    lat: 49.55694444444444
  },
  {
    names: ["ریو کوارتو", "Río Cuarto"],
    country: "AR",
    lng: -64.35,
    lat: -33.13333333333333
  },
  {
    names: ["ژیتومیر", "Житомир"],
    country: "UA",
    lng: 28.666666666666668,
    lat: 50.25
  },
  {
    names: ["چیلان، واشینگتن", "Chelan, Washington"],
    country: "US",
    lng: -120.0213888888889,
    lat: 47.84277777777778
  },
  {
    names: ["کالیاری", "Cagliari"],
    country: "IT",
    lng: 9.057500000000001,
    lat: 39.24638888888889
  },
  {
    names: ["کوکیمبو"],
    country: "CL",
    lng: -71.34333333333333,
    lat: -29.953055555555554
  },
  {
    names: ["شاغات", "Շաղատ"],
    country: "AM",
    lng: 45.91222222222222,
    lat: 39.56166666666666
  },
  {
    names: ["بیلینگز", "Billings, Montana"],
    country: "US",
    lng: -108.53722222222223,
    lat: 45.78666666666666
  },
  {
    names: ["فیرنهایم"],
    country: "DE",
    lng: 8.57861111111111,
    lat: 49.541666666666664
  },
  { names: ["دوگنبدان"], lng: 50.8069, lat: 30.3636 },
  {
    names: ["رانچپار", "Ռանչպար"],
    country: "AM",
    lng: 44.37027777777778,
    lat: 40.025277777777774
  },
  { names: ["فرانکفورت (اودر)"], country: "DE", lng: 14.55, lat: 52.35 },
  {
    names: ["آیزنبرگ (فالتز)", "Eisenberg"],
    country: "DE",
    lng: 8.0725,
    lat: 49.561388888888885
  },
  {
    names: ["گاردن گروو، کالیفرنیا", "City of Garden Grove"],
    country: "US",
    lng: -117.96027777777778,
    lat: 33.778888888888886
  },
  {
    names: ["گوانگ‌ژو", "广州市"],
    country: "CN",
    lng: 113.26666666666667,
    lat: 23.133333333333333
  },
  {
    names: ["ویفانگ", "潍坊市"],
    country: "CN",
    lng: 119.1,
    lat: 36.71666666666667
  },
  {
    names: ["اویتس", "Ույծ"],
    country: "AM",
    lng: 46.05,
    lat: 39.516666666666666
  },
  {
    names: ["یرنو", "Iernut"],
    country: "RO",
    lng: 24.233333333333334,
    lat: 46.453611111111115
  },
  {
    names: ["هاله (شهر)", "Independent City of Halle (Saale), زاکسن-آنهالت"],
    country: "DE",
    lng: 11.966666666666667,
    lat: 51.483333333333334
  },
  {
    names: ["مسجدسلیمان", "مسجدسلیمان - مَیسلیمان-M.I.S"],
    lng: 49.3,
    lat: 31.93
  },
  {
    names: ["توموک", "Tömük"],
    country: "TR",
    lng: 34.38333333333333,
    lat: 36.666666666666664
  },
  {
    names: ["کوبورگ"],
    country: "DE",
    lng: 10.966666666666667,
    lat: 50.266666666666666
  },
  {
    names: ["بوآ ویستا، رورایما", "بوآ ویستا"],
    country: "BR",
    lng: -60.671388888888885,
    lat: 2.819444444444444
  },
  {
    names: ["الماگویر، کایوکا", "Almaguer"],
    country: "CO",
    lng: -76.86666666666666,
    lat: 1.9166666666666665
  },
  {
    names: ["اوانوکو", "Huánuco"],
    country: "PE",
    lng: -76.23971388888889,
    lat: -9.929463888888888
  },
  {
    names: ["مونیخ", "Munich", "München"],
    country: "DE",
    lng: 11.566666666666666,
    lat: 48.13333333333333
  },
  {
    names: ["کوکیمبو"],
    country: "CL",
    lng: -71.34333333333333,
    lat: -29.953055555555554
  },
  {
    names: ["ماراکایبو", "Maracaibo"],
    country: "VE",
    lng: -71.63333333333334,
    lat: 10.65
  },
  { names: ["قویسنا"], country: "EG", lng: 31.157219, lat: 30.564183 },
  {
    names: ["زندنهورست"],
    country: "DE",
    lng: 7.8277777777777775,
    lat: 51.84388888888889
  },
  {
    names: ["نازیلی", "Nazilli"],
    country: "TR",
    lng: 28.320555555555554,
    lat: 37.9125
  },
  { names: ["زانکت گوار"], country: "DE", lng: 7.716666666666667, lat: 50.15 },
  {
    names: ["آرین، ارمنستان", "آرین", "Արին"],
    country: "AM",
    lng: 45.49388888888889,
    lat: 39.727222222222224
  },
  {
    names: ["بور سودان"],
    country: "SD",
    lng: 37.21666666666667,
    lat: 19.616666666666667
  },
  {
    names: ["آغین", "Աղին"],
    country: "AM",
    lng: 43.69833333333333,
    lat: 40.59
  },
  {
    names: ["آرایوکا (آرایوکا)", "Arauca"],
    country: "CO",
    lng: -70.76166666666667,
    lat: 7.0905555555555555
  },
  {
    names: ["ریو دو ژانیرو"],
    lng: -43.19638888888888,
    lat: -22.90833333333333
  },
  {
    names: ["ووسکواز", "Ոսկեվազ"],
    country: "AM",
    lng: 44.29722222222222,
    lat: 40.27583333333333
  },
  { names: ["سردشت", "سه‌رده‌شت"], lng: 45.53, lat: 36.85 },
  {
    names: ["مدیاش", "Mediaș"],
    country: "RO",
    lng: 24.350833333333334,
    lat: 46.163888888888884
  },
  {
    names: ["ایزیاسلاف، اوکراین", "Iziaslav", "Ізя́слав"],
    country: "UA",
    lng: 26.8,
    lat: 50.11666666666667
  },
  {
    names: ["رمنیکو ولچا", "Râmnicu Vâlcea"],
    country: "RO",
    lng: 24.3,
    lat: 45.1
  },
  { names: ["شرکیشلا"], country: "TR", lng: 36.4, lat: 39.35 },
  {
    names: ["مپن", "Meppen"],
    country: "DE",
    lng: 7.292777777777777,
    lat: 52.69361111111111
  },
  {
    names: ["نایلا"],
    country: "DE",
    lng: 11.683333333333334,
    lat: 50.31666666666667
  },
  { names: ["باروث"], country: "DE", lng: 13.5, lat: 52.05 },
  {
    names: ["آرالز", "Արալեզ"],
    country: "AM",
    lng: 44.65333333333333,
    lat: 39.900277777777774
  },
  {
    names: ["بینگن آن در راین", "Bingen am Rhein"],
    country: "DE",
    lng: 7.895,
    lat: 49.966944444444444
  },
  {
    names: ["فلبورگ"],
    country: "DE",
    lng: 11.671944444444444,
    lat: 49.23277777777778
  },
  { names: ["پاستو", "Pásztó"], country: "HU", lng: 19.71442, lat: 47.9202 },
  {
    names: ["نیوا، اویلا", "Neiva"],
    country: "CO",
    lng: -75.30444444444444,
    lat: 2.9986111111111113
  },
  {
    names: ["دیتون، اوهایو", "City of Dayton"],
    country: "US",
    lng: -84.19166666666668,
    lat: 39.75944444444445
  },
  {
    names: ["مرسی مطروح"],
    country: "EG",
    lng: 27.216666666666665,
    lat: 31.166666666666668
  },
  {
    names: ["تسووینار، ارمنستان", "تسووینار", "Ծովինար"],
    country: "AM",
    lng: 45.46638888888889,
    lat: 40.16
  },
  {
    names: ["کورتان", "Կուրթան"],
    country: "AM",
    lng: 44.56638888888889,
    lat: 40.96194444444445
  },
  {
    names: ["ال سنترو، کالیفرنیا", "ال سنترو"],
    country: "US",
    lng: -115.56305555555555,
    lat: 32.79194444444444
  },
  {
    names: ["ال سریتو (واییه دل کایوکا)", "El Cerrito"],
    country: "CO",
    lng: -76.16666666666667,
    lat: 3.6666666666666665
  },
  {
    names: ["سیم ریپ", "سیه‌م ریاپ", "ក្រុងសៀមរាប"],
    country: "KH",
    lng: 103.85972222222222,
    lat: 13.362222222222222
  },
  {
    names: ["شاون‌اشتاین"],
    country: "DE",
    lng: 11.766666666666667,
    lat: 50.266666666666666
  },
  {
    names: ["لوساکا", "Lusaka"],
    country: "ZM",
    lng: 28.283333333333335,
    lat: -15.416666666666666
  },
  {
    names: ["پوتکوآوا", "Potcoava"],
    country: "RO",
    lng: 24.283333333333335,
    lat: 44.25
  },
  {
    names: ["شروبن‌هاوزن"],
    country: "DE",
    lng: 11.266666666666667,
    lat: 48.53333333333333
  },
  {
    names: ["بایلنگریس"],
    country: "DE",
    lng: 11.466666666666667,
    lat: 49.03333333333333
  },
  {
    names: ["ویسالیا، کالیفرنیا", "ویسالیا"],
    country: "US",
    lng: -119.30722222222222,
    lat: 36.32416666666667
  },
  {
    names: ["استوکتون، کالیفرنیا", "Stockton, California"],
    country: "US",
    lng: -121.30083333333333,
    lat: 37.97555555555556
  },
  {
    names: ["بیکرزفیلد، کالیفرنیا", "بیکرزفیلد"],
    country: "US",
    lng: -119.01861111111111,
    lat: 35.373333333333335
  },
  {
    names: ["ایشن‌هاوزن"],
    country: "DE",
    lng: 10.316666666666666,
    lat: 48.36666666666667
  },
  {
    names: ["هاشنبورگ"],
    country: "DE",
    lng: 7.820277777777777,
    lat: 50.66138888888889
  },
  {
    names: ["فلورنسیا (کاکیتا)", "Florencia"],
    country: "CO",
    lng: -75.61277777777777,
    lat: 1.613888888888889
  },
  { names: ["کلمبیا"], lng: -66.96666666666667, lat: 10.5 },
  { names: ["لندن"], country: "GB", lng: -0.1275, lat: 51.507222222222225 },
  {
    names: ["شناوان، آرماویر", "شناوان", "Շենավան"],
    country: "AM",
    lng: 43.93333333333333,
    lat: 40.05
  },
  {
    names: ["سینسلخو", "Sincelejo"],
    country: "CO",
    lng: -75.39611111111111,
    lat: 9.295
  },
  {
    names: ["اسکی‌شهر"],
    country: "TR",
    lng: 30.520555555555553,
    lat: 39.776666666666664
  },
  {
    names: ["لوییویل، کنتاکی", "لوییویل"],
    country: "US",
    lng: -85.76666666666667,
    lat: 38.25
  },
  {
    names: ["پیاترا اول", "Piatra-Olt"],
    country: "RO",
    lng: 24.266666666666666,
    lat: 44.36666666666667
  },
  {
    names: ["نیامی", "Niamey"],
    country: "NE",
    lng: 2.105277777777778,
    lat: 13.52138888888889
  },
  {
    names: ["نویفن"],
    country: "DE",
    lng: 9.375555555555556,
    lat: 48.55444444444444
  },
  { names: ["اراک‌لی"], country: "TR", lng: 40.05, lat: 40.93333333333333 },
  {
    names: ["هالیوود، فلوریدا", "City of Hollywood"],
    country: "US",
    lng: -80.17500000000001,
    lat: 26.02138888888889
  },
  {
    names: ["مارماریس", "Marmaris"],
    country: "TR",
    lng: 28.266666666666666,
    lat: 36.85
  },
  { names: ["یاسوج"], lng: 51.5667, lat: 30.7167 },
  {
    names: ["یشیل‌لی"],
    country: "TR",
    lng: 40.825833333333335,
    lat: 37.34055555555556
  },
  {
    names: ["گریما"],
    country: "DE",
    lng: 12.725277777777778,
    lat: 51.23861111111111
  },
  { names: ["سالونیک", "Θεσσαλονίκη"], country: "GR", lng: 22.9, lat: 40.65 },
  {
    names: ["هایترزباخ"],
    country: "DE",
    lng: 8.650277777777777,
    lat: 48.52444444444444
  },
  {
    names: ["زنده (نیدرازکسن)", "Sehnde"],
    country: "DE",
    lng: 9.964166666666666,
    lat: 52.316111111111105
  },
  {
    names: ["اشتولپن"],
    country: "DE",
    lng: 14.082777777777778,
    lat: 51.04888888888889
  },
  {
    names: ["ولیکی نووگورود", "Великий Новгород"],
    country: "RU",
    lng: 31.266666666666666,
    lat: 58.55
  },
  {
    names: ["واردابلور، لوری", "واردابلور", "Վարդաբլուր"],
    country: "AM",
    lng: 44.50888888888889,
    lat: 40.97083333333334
  },
  {
    names: ["پاوزا، فوگتلند", "Pausa"],
    country: "DE",
    lng: 11.983333333333333,
    lat: 50.56666666666667
  },
  {
    names: ["بیله گوورا", "Băile Govora"],
    country: "RO",
    lng: 24.179722222222225,
    lat: 45.080000000000005
  },
  {
    names: ["نوی‌اشتات آن در ارلا"],
    country: "DE",
    lng: 11.75,
    lat: 50.733333333333334
  },
  {
    names: ["پوزانتی", "Pozantı"],
    country: "TR",
    lng: 34.87111111111111,
    lat: 37.42777777777778
  },
  { names: ["دوالا"], country: "CM", lng: 9.683333333333334, lat: 4.05 },
  {
    names: ["بورگ‌اشتت"],
    country: "DE",
    lng: 12.816666666666666,
    lat: 50.916666666666664
  },
  {
    names: ["هوفوش", "Hofors"],
    country: "SE",
    lng: 16.283333333333335,
    lat: 60.55
  },
  {
    names: ["تورین", "Torino", "Turin"],
    country: "IT",
    lng: 7.7,
    lat: 45.06666666666667
  },
  {
    names: ["ام‌القیوین", "ام‌القوین", "اماره امّ القیوین"],
    country: "AE",
    lng: 55.94,
    lat: 25.98638888888889
  },
  {
    names: ["نورفک، ویرجینیا", "Norfolk, Virginia"],
    country: "US",
    lng: -76.20694444444445,
    lat: 36.91
  },
  {
    names: ["ردآلبن"],
    country: "DE",
    lng: 7.642499999999999,
    lat: 49.23972222222222
  },
  { names: ["والنسیا، کارابوبو", "Valencia"], lng: -68.004, lat: 10.181 },
  {
    names: ["مولنلیککه", "Mölnlycke"],
    country: "SE",
    lng: 12.116666666666667,
    lat: 57.666666666666664
  },
  {
    names: ["ابوکبیر", "ابو کبیر"],
    country: "EG",
    lng: 31.666666666666668,
    lat: 30.716666666666665
  },
  {
    names: ["پورتسموث", "Portsmouth"],
    country: "GB",
    lng: -1.0833333333333333,
    lat: 50.81666666666667
  },
  {
    names: ["شینگتای", "邢台市"],
    country: "CN",
    lng: 114.48333333333333,
    lat: 37.06666666666667
  },
  {
    names: ["یانکرز", "City of Yonkers"],
    country: "US",
    lng: -73.86444444444444,
    lat: 40.94138888888889
  },
  { names: ["کلمبیا"], lng: -66.96666666666667, lat: 10.5 },
  {
    names: ["لاوتراکن"],
    country: "DE",
    lng: 7.591944444444444,
    lat: 49.64944444444444
  },
  {
    names: ["هورودیشچه", "Horodyshche", "Городище"],
    country: "UA",
    lng: 31.458055555555553,
    lat: 49.2925
  },
  {
    names: ["چنگدو", "成都市"],
    country: "CN",
    lng: 104.06472222222222,
    lat: 30.65861111111111
  },
  {
    names: ["آشناک", "Աշնակ"],
    country: "AM",
    lng: 43.916666666666664,
    lat: 40.3275
  },
  {
    names: ["لیون، گوآناخوآتو", "لیون", "León de los Aldama"],
    country: "MX",
    lng: -101.68333333333334,
    lat: 21.116666666666667
  },
  {
    names: ["وکفو", "Växjö, Sweden"],
    country: "SE",
    lng: 14.809166666666668,
    lat: 56.87694444444445
  },
  {
    names: ["آغبرک", "Աղբերք"],
    country: "AM",
    lng: 45.27722222222222,
    lat: 40.52638888888889
  },
  { names: ["لینیای", "临沂市"], country: "CN", lng: 118.35, lat: 35.05 },
  {
    names: ["گرله", "Gherla"],
    country: "RO",
    lng: 23.9,
    lat: 47.019999999999996
  },
  {
    names: ["آق‌شهر", "Akşehir"],
    country: "TR",
    lng: 31.416666666666668,
    lat: 38.35
  },
  {
    names: ["بیکرزفیلد، کالیفرنیا", "بیکرزفیلد"],
    country: "US",
    lng: -119.01861111111111,
    lat: 35.373333333333335
  },
  {
    names: ["آنوایلار آن در تریفلز"],
    country: "DE",
    lng: 7.966666666666667,
    lat: 49.20333333333333
  },
  {
    names: ["ریچموند، کالیفرنیا", "ریچموند"],
    country: "US",
    lng: -122.34777777777778,
    lat: 37.93583333333333
  },
  {
    names: ["گتاپ", "Գետափ"],
    country: "AM",
    lng: 43.62166666666667,
    lat: 40.38722222222222
  },
  { names: ["مرکیش بوخهولز"], country: "DE", lng: 13.75, lat: 52.1 },
  {
    names: ["لانگتسن"],
    country: "DE",
    lng: 10.794722222222221,
    lat: 49.49444444444445
  },
  {
    names: ["ولفرامز-اشنباخ"],
    country: "DE",
    lng: 10.733333333333333,
    lat: 49.233333333333334
  },
  { names: ["آقچه‌داغ"], country: "TR", lng: 37.968611111111116, lat: 38.345 },
  {
    names: ["روساریو، سانتا فه", "روساریو", "Rosario"],
    country: "AR",
    lng: -60.666666666666664,
    lat: -32.95
  },
  { names: ["سمعان‌داغ"], country: "TR", lng: 35.980555555555554, lat: 36.085 },
  {
    names: ["گوایاکیل", "گوای‌اکیل", "Santiago de Guayaquil"],
    country: "EC",
    lng: -79.88333333333334,
    lat: -2.183333333333333
  },
  { names: ["طرقبه"], lng: 59.22, lat: 36.18 },
  {
    names: ["مرسبورگ", "Marsberg"],
    country: "DE",
    lng: 8.833333333333334,
    lat: 51.45
  },
  {
    names: ["ماریوپول", "Мариу́поль (روسی)"],
    country: "UA",
    lng: 37.54944444444444,
    lat: 47.09583333333334
  },
  {
    names: ["یایونده", "Yaoundé"],
    country: "CM",
    lng: 11.516666666666667,
    lat: 3.8666666666666667
  },
  {
    names: ["دراج (آلبانی)", "دراج", "Durrës"],
    country: "AL",
    lng: 19.45,
    lat: 41.31666666666667
  },
  {
    names: ["لاس وگاس شمالی (نوادا)", "North Las Vegas, Nevada"],
    country: "US",
    lng: -115.14666666666668,
    lat: 36.228611111111114
  },
  { names: ["تسوبلیتز"], country: "DE", lng: 13.231666666666667, lat: 50.6575 },
  {
    names: ["نور (شهر)", "نور"],
    country: "IR",
    lng: 52.013888888888886,
    lat: 36.57361111111111
  },
  { names: ["رشت"], lng: 49.5858, lat: 37.2794 },
  { names: ["پولوکوین", "Polokwane"], country: "ZA", lng: 29.45, lat: -23.9 },
  {
    names: ["بورزنا", "Borzna", "Борзна"],
    country: "UA",
    lng: 32.6,
    lat: 51.25
  },
  {
    names: ["روونکی", "Rovenky", "Ровеньки"],
    country: "UA",
    lng: 39.34277777777778,
    lat: 48.071111111111115
  },
  {
    names: ["دزرژینسک", "Дзержинськ"],
    country: "UA",
    lng: 37.873333333333335,
    lat: 48.391666666666666
  },
  { names: ["ابو المطامیر"], country: "EG", lng: 30.148487, lat: 30.908411 },
  {
    names: ["فرانکفورت", "Frankfurt am Main"],
    country: "DE",
    lng: 8.685944444444445,
    lat: 50.111805555555556
  },
  { names: ["آدانا"], country: "TR", lng: 35.321333333333335, lat: 37 },
  {
    names: ["کنسپسیون، پاراگویه", "کُنسپسیون", "Concepción"],
    country: "PY",
    lng: -57.43,
    lat: -23.4
  },
  {
    names: ["لانگنفلد (راینلند)", "Langenfeld"],
    country: "DE",
    lng: 6.95,
    lat: 51.11666666666667
  },
  {
    names: ["بوداپست"],
    country: "HU",
    lng: 19.05027777777778,
    lat: 47.471944444444446
  },
  {
    names: ["ایروان", "Երևան", "Yerevan"],
    country: "AM",
    lng: 44.516666666666666,
    lat: 40.18333333333333
  },
  {
    names: ["ترسینا", "Teresina, Piaui"],
    country: "BR",
    lng: -42.80166666666666,
    lat: -5.089166666666666
  },
  {
    names: ["چاتانوگا، تنسی", "چاتانوگا", "Chattanooga, Tennessee"],
    country: "US",
    lng: -85.26722222222222,
    lat: 35.04555555555555
  },
  { names: ["سونسوال"], country: "SE", lng: 17.316666666666666, lat: 62.4 },
  {
    names: ["واربره", "واربری"],
    country: "SE",
    lng: 12.216666666666667,
    lat: 57.11666666666667
  },
  {
    names: [
      "ایسلا ده سان آندرس (کلمبیا)",
      "ایسلا ده سان آندرس (کلمبیا) San Andrés"
    ],
    country: "CO",
    lng: -81.70055555555555,
    lat: 12.584722222222222
  },
  {
    names: ["ویچیتا فالز، تگزاس", "شهر ویچیتا فالز", "City of Wichita Falls"],
    country: "US",
    lng: -98.515,
    lat: 33.89694444444444
  },
  {
    names: ["باد برگ‌زابرن"],
    country: "DE",
    lng: 7.998888888888889,
    lat: 49.10305555555556
  },
  {
    names: ["سومی", "Суми"],
    country: "UA",
    lng: 34.75,
    lat: 50.916666666666664
  },
  {
    names: ["ساراپات", "Սարապատ"],
    country: "AM",
    lng: 44.04111111111111,
    lat: 40.93805555555555
  },
  {
    names: ["اوساکا", "大阪市"],
    country: "JP",
    lng: 135.50222222222223,
    lat: 34.693888888888885
  },
  {
    names: ["کومله (سوید)", "Kumla"],
    country: "SE",
    lng: 15.133333333333333,
    lat: 59.11666666666667
  },
  {
    names: ["فرهبورگ (زاکسن)"],
    country: "DE",
    lng: 12.555000000000001,
    lat: 51.05611111111111
  },
  {
    names: ["ورین خوتانان", "Վերին Խոտանան"],
    country: "AM",
    lng: 46.3775,
    lat: 39.31055555555555
  },
  { names: ["محمدآباد (ریگان)"], lng: 59.0164, lat: 28.6468 },
  {
    names: ["یوپال", "Yopal"],
    country: "CO",
    lng: -72.41000000000001,
    lat: 5.35
  },
  {
    names: ["اردهان"],
    country: "TR",
    lng: 42.702222222222225,
    lat: 41.111111111111114
  },
  {
    names: ["یویونگ", "岳阳市"],
    country: "CN",
    lng: 113.43333333333334,
    lat: 29.366666666666667
  },
  {
    names: ["سولفتیو", "Sollefteå"],
    country: "SE",
    lng: 17.266666666666666,
    lat: 63.166666666666664
  },
  {
    names: ["ویلزدروف"],
    country: "DE",
    lng: 13.538333333333334,
    lat: 51.05222222222222
  },
  {
    names: ["ازمیر", "İzmir"],
    country: "TR",
    lng: 27.15,
    lat: 38.43333333333333
  },
  {
    names: ["نیهایم"],
    country: "DE",
    lng: 9.109722222222222,
    lat: 51.79972222222222
  },
  {
    names: ["تیرانا", "Tiranë", "Tirana"],
    country: "AL",
    lng: 19.82,
    lat: 41.330000000000005
  },
  {
    names: ["کل، بادن-وورتمیرگ", "Kehl"],
    country: "DE",
    lng: 7.816666666666666,
    lat: 48.56666666666667
  },
  {
    names: ["کارمراکار", "Կարմրաքար"],
    country: "AM",
    lng: 43.88333333333333,
    lat: 40.86666666666667
  },
  { names: ["شوش"], lng: 48.2436, lat: 32.1942 },
  { names: ["قهدریجان", "کدرگون،قدرجون"], lng: 32.3, lat: 51.3 },
  {
    names: ["ساراهات", "Սարահարթ"],
    country: "AM",
    lng: 44.21,
    lat: 40.87388888888889
  },
  { names: ["لیروم"], country: "SE", lng: 12.3, lat: 57.766666666666666 },
  {
    names: ["بانگی", "Bangui"],
    country: "CF",
    lng: 18.583333333333332,
    lat: 4.366666666666666
  },
  {
    names: ["تسوواگیوغ", "Ծովագյուղ"],
    country: "AM",
    lng: 44.952222222222225,
    lat: 40.63305555555556
  },
  {
    names: ["یوجین، اورگن", "Eugene, Oregon"],
    country: "US",
    lng: -123.08666666666666,
    lat: 44.051944444444445
  },
  { names: ["والدکرایبورگ"], country: "DE", lng: 12.4, lat: 48.21666666666667 },
  {
    names: ["باستر", "Basseterre"],
    country: "KN",
    lng: -62.733333333333334,
    lat: 17.3
  },
  {
    names: ["اونساله", "Onsala"],
    country: "SE",
    lng: 12.0225,
    lat: 57.414722222222224
  },
  {
    names: ["کویهایکیو، شیلی", "Coihaique", "Coyhaique"],
    country: "CL",
    lng: -72.06666666666666,
    lat: -45.56666666666667
  },
  {
    names: ["کویجی‌قیز"],
    country: "TR",
    lng: 28.68888888888889,
    lat: 36.97138888888889
  },
  {
    names: ["دارپاس", "Դարպաս"],
    country: "AM",
    lng: 44.42333333333333,
    lat: 40.838055555555556
  },
  {
    names: ["فرانکفورت", "Frankfurt am Main"],
    country: "DE",
    lng: 8.685944444444445,
    lat: 50.111805555555556
  },
  {
    names: ["ریاض"],
    country: "SA",
    lng: 46.71666666666667,
    lat: 24.633333333333333
  },
  {
    names: ["آلچفسک", "Alchevsk", "Алчевськ (اوکراینی)"],
    country: "UA",
    lng: 38.797777777777775,
    lat: 48.47777777777778
  },
  {
    names: ["گیزلوید (سوید)", "Gislaved"],
    country: "SE",
    lng: 13.533333333333333,
    lat: 57.3
  },
  {
    names: ["تولانسینگو"],
    country: "MX",
    lng: -98.36666666666666,
    lat: 20.083333333333332
  },
  { names: ["فریمان"], lng: 59.8506, lat: 35.7072 },
  {
    names: ["تیولی (ایتالیا)", "Tivoli"],
    country: "IT",
    lng: 12.8,
    lat: 41.96666666666667
  },
  {
    names: ["اینگلهایم آم راین"],
    country: "DE",
    lng: 8.05638888888889,
    lat: 49.974722222222226
  },
  {
    names: ["گرانزی"],
    country: "DE",
    lng: 13.158611111111112,
    lat: 53.00694444444444
  },
  { names: ["تاکستان (قزوین)", "سیادن"], lng: 49.6988, lat: 36.0625 },
  {
    names: ["لوتینبورگ"],
    country: "DE",
    lng: 10.59138888888889,
    lat: 54.29472222222222
  },
  {
    names: ["اوسترینگن"],
    country: "DE",
    lng: 8.710833333333333,
    lat: 49.21944444444445
  },
  {
    names: ["برنا بای برلین"],
    country: "DE",
    lng: 13.583055555555555,
    lat: 52.666666666666664
  },
  {
    names: ["دروهوبیچ", "Drohobych", "Дрогóбич", "Drohobycz"],
    country: "UA",
    lng: 23.5,
    lat: 49.35
  },
  {
    names: ["لانگ بیچ، کالیفرنیا", "لانگ بیچ"],
    country: "US",
    lng: -118.19561683333333,
    lat: 33.768321
  },
  {
    names: ["ببرا"],
    country: "DE",
    lng: 9.790277777777778,
    lat: 50.971111111111114
  },
  {
    names: ["اوسترشوند", "Staare"],
    country: "SE",
    lng: 14.635833333333332,
    lat: 63.17916666666667
  },
  {
    names: ["آرنسبرگ", "Arnsberg"],
    country: "DE",
    lng: 8.083333333333334,
    lat: 51.38333333333333
  },
  {
    names: ["اشتاوفن ایم برایزگاو", "Staufen im Breisgau"],
    country: "DE",
    lng: 7.731388888888889,
    lat: 47.88138888888889
  },
  {
    names: ["اسپاسک، اوبلاست پنزا", "Спасск"],
    country: "RU",
    lng: 43.18333333333333,
    lat: 53.93333333333333
  },
  {
    names: ["سان ویسنته دل کاگوان", "San Vicente del Caguán"],
    country: "CO",
    lng: -74.10194444444444,
    lat: 2.1102777777777777
  },
  {
    names: ["نیمگک"],
    country: "DE",
    lng: 12.699722222222222,
    lat: 52.08305555555556
  },
  { names: ["فراینزهایم"], country: "DE", lng: 8.20861111111111, lat: 49.5075 },
  {
    names: ["تقورت، الجزایر", "توقرت", "تقورت"],
    country: "DZ",
    lng: 6.066666666666666,
    lat: 33.1
  },
  {
    names: ["مینگا گوآزو", "Minga Guazú"],
    country: "PY",
    lng: -54.75,
    lat: -25.366666666666667
  },
  { names: ["نوردلینگن"], country: "DE", lng: 10.5, lat: 48.85 },
  {
    names: ["سیسیان", "Սիսիան"],
    country: "AM",
    lng: 46.032222222222224,
    lat: 39.520833333333336
  },
  {
    names: ["آدیس آبابا", "አዲስ አበባ"],
    country: "ET",
    lng: 38.7,
    lat: 9.633333333333333
  },
  { names: ["آروبا"], lng: -70.85, lat: 12.516666666666667 },
  {
    names: ["اسکندریه", "الاسکندریه"],
    country: "EG",
    lng: 29.916666666666668,
    lat: 31.2
  },
  {
    names: ["الکساندریا، ویرجینیا", "Alexandria, Virginia"],
    country: "US",
    lng: -77.04722222222222,
    lat: 38.80472222222222
  },
  { names: ["شیروان", "شیران"], lng: 57.93, lat: 37 },
  {
    names: ["اندینگن آم کایزراشتول", "Endingen"],
    country: "DE",
    lng: 7.706388888888889,
    lat: 48.14083333333333
  },
  {
    names: ["کلیولند، اوهایو", "کلیولند", "City of Cleveland"],
    country: "US",
    lng: -81.66972222222223,
    lat: 41.48222222222223
  },
  {
    names: ["لاگوس"],
    country: "NG",
    lng: 3.3958333333333335,
    lat: 6.453055555555555
  },
  {
    names: ["لانداو آن در ایزار"],
    country: "DE",
    lng: 12.666666666666666,
    lat: 48.666666666666664
  },
  {
    names: ["گلدبرگ (مکلنبورگ)", "Goldberg"],
    country: "DE",
    lng: 12.066666666666666,
    lat: 53.56666666666667
  },
  {
    names: ["سانتیاگو د کوبا", "Santiago de Cuba"],
    country: "CU",
    lng: -75.82055555555556,
    lat: 20.028333333333332
  },
  {
    names: ["پامپلونا", "(به اسپانیایی: Pamplona)"],
    country: "ES",
    lng: -1.6441666666666666,
    lat: 42.818333333333335
  },
  {
    names: ["پیته‌آ", "پیتیا", "Piteå"],
    country: "SE",
    lng: 21.5,
    lat: 65.33333333333333
  },
  {
    names: ["بانجول", "Banjul town"],
    country: "GM",
    lng: -16.5775,
    lat: 13.453055555555554
  },
  { names: ["یاخشی‌خان", "Yahşihan"], country: "TR", lng: 33.45, lat: 39.85 },
  {
    names: ["فریزویته", "Friesoythe"],
    country: "DE",
    lng: 7.85861111111111,
    lat: 53.02055555555555
  },
  { names: ["یاسوج"], lng: 51.5667, lat: 30.7167 },
  {
    names: ["کرویزتال", "Kreuztal"],
    country: "DE",
    lng: 7.966666666666667,
    lat: 50.96666666666667
  },
  {
    names: ["چیلان، واشینگتن", "Chelan, Washington"],
    country: "US",
    lng: -120.0213888888889,
    lat: 47.84277777777778
  },
  {
    names: ["اسپرینگفیلد، میزوری", "Springfield, Missouri"],
    country: "US",
    lng: -93.28611111111111,
    lat: 37.19499999999999
  },
  {
    names: ["لتیسیا (آماسوناس)", "Leticia"],
    country: "CO",
    lng: -69.93277777777779,
    lat: -4.205277777777778
  },
  {
    names: ["کامپوس", "Κάμπος"],
    country: "CY",
    lng: 32.73222222222223,
    lat: 35.04055555555556
  },
  {
    names: ["لامپرتهایم، آلمان"],
    country: "DE",
    lng: 8.466666666666667,
    lat: 49.6
  },
  {
    names: ["کرویسن"],
    country: "DE",
    lng: 11.622675000000001,
    lat: 49.843986111111114
  },
  {
    names: ["لاختی", "Lahti", "Lahtis"],
    country: "FI",
    lng: 25.65,
    lat: 60.983333333333334
  },
  { names: ["برایزاخ"], country: "DE", lng: 7.58, lat: 48.028888888888886 },
  {
    names: ["وتره دورنه", "Vatra Dornei"],
    country: "RO",
    lng: 25.359444444444446,
    lat: 47.346111111111114
  },
  {
    names: ["فیشتاخ", "Viechtach"],
    country: "DE",
    lng: 12.884722222222221,
    lat: 49.07916666666667
  },
  { names: ["اولم (آلمان)"], country: "DE", lng: 9.983333333333333, lat: 48.4 },
  {
    names: ["میرامار، فلوریدا", "City of Miramar"],
    country: "US",
    lng: -80.2825,
    lat: 25.978888888888886
  },
  {
    names: ["زیمباخ آم این", "Simbach a.Inn"],
    country: "DE",
    lng: 13.016666666666667,
    lat: 48.266666666666666
  },
  {
    names: ["هامبورگ", "Freie und Hansestadt Hamburg"],
    country: "DE",
    lng: 10.001388888888888,
    lat: 53.56527777777777
  },
  {
    names: ["گنگنباخ"],
    country: "DE",
    lng: 8.015277777777778,
    lat: 48.40416666666667
  },
  {
    names: ["والدکیرش", "Waldkirch"],
    country: "DE",
    lng: 7.960833333333333,
    lat: 48.09388888888889
  },
  {
    names: ["تارتو", "Tartu"],
    country: "EE",
    lng: -26.716666666666665,
    lat: 58.38333333333333
  },
  {
    names: ["کرمنتس", "Kremenets", "Крем'янець, Кременець"],
    country: "UA",
    lng: 25.716666666666665,
    lat: 50.11972222222222
  },
  {
    names: ["یراسخاهون"],
    country: "AM",
    lng: 44.215833333333336,
    lat: 40.07222222222222
  },
  {
    names: ["هاله (نوردراین-وستفالن)", "Halle"],
    country: "DE",
    lng: 8.366666666666667,
    lat: 52.06666666666667
  },
  {
    names: ["لاوپهایم"],
    country: "DE",
    lng: 9.879722222222222,
    lat: 48.22888888888889
  },
  {
    names: ["سوراهامار"],
    country: "SE",
    lng: 16.216666666666665,
    lat: 59.71666666666667
  },
  {
    names: ["لیپووتس", "Lypovets", "Липовець"],
    country: "UA",
    lng: 29.056944444444444,
    lat: 49.22083333333334
  },
  {
    names: ["نوین‌اشتات آم کوخر", "Neuenstadt am Kocher"],
    country: "DE",
    lng: 9.333333333333334,
    lat: 49.233333333333334
  },
  {
    names: ["اواکرمونده"],
    country: "DE",
    lng: 14.044444444444444,
    lat: 53.73888888888889
  },
  {
    names: ["تورگاو"],
    country: "DE",
    lng: 13.005555555555556,
    lat: 51.56027777777778
  },
  {
    names: ["اسمره", "Asmara", "ኣስመራ", "اسمرا"],
    country: "ER",
    lng: 38.93333333333333,
    lat: 15.333333333333334
  },
  {
    names: ["تونینگ"],
    country: "DE",
    lng: 8.942777777777778,
    lat: 54.31722222222223
  },
  {
    names: ["ناکسویل، تنسی", "ناکسویل", "Knoxville, Tennessee"],
    country: "US",
    lng: -83.94222222222223,
    lat: 35.97277777777778
  },
  { names: ["هوهنلویبن"], country: "DE", lng: 12.05, lat: 50.71666666666667 },
  {
    names: ["نویمارک-زنکت فایت"],
    country: "DE",
    lng: 12.5,
    lat: 48.36666666666667
  },
  {
    names: ["کمبرگ"],
    country: "DE",
    lng: 12.633333333333333,
    lat: 51.78333333333333
  },
  {
    names: ["آواسلار", "Avsallar"],
    country: "TR",
    lng: 31.883333333333333,
    lat: 36.583333333333336
  },
  { names: ["هولفلد"], country: "DE", lng: 11.3, lat: 49.93333333333333 },
  {
    names: ["کوشک (ترکیه)", "Köşk"],
    country: "TR",
    lng: 28.051666666666666,
    lat: 37.85333333333333
  },
  {
    names: ["پیونگ‌یانگ", "평양", "P'yŏngyang"],
    country: "KP",
    lng: 125.73805555555556,
    lat: 39.019444444444446
  },
  {
    names: ["سوکریانی", "Sokyriany", "Сокиряни"],
    country: "MD",
    lng: 26.266666666666666,
    lat: 48.21666666666667
  },
  {
    names: ["مغری", "Մեղրի"],
    country: "AM",
    lng: 46.23833333333334,
    lat: 38.90222222222222
  },
  {
    names: ["اشتفانشتی، ارجش", "Ștefănești"],
    country: "RO",
    lng: 24.65,
    lat: 44.733333333333334
  },
  {
    names: ["سن دیگو", "سن دییگو"],
    country: "US",
    lng: -117.16250000000001,
    lat: 32.715
  },
  { names: ["اکوادور"], lng: -78.35, lat: -0.15 },
  {
    names: ["هرتسا", "Hertsa", "Herța"],
    country: "UA",
    lng: 26.25,
    lat: 48.15
  },
  {
    names: ["روزدیلنا", "Rozdilna", "Роздільна"],
    country: "UA",
    lng: 30.079166666666666,
    lat: 46.84861111111111
  },
  {
    names: ["ژیداشیف", "Жидачів", "Żydaczów"],
    country: "UA",
    lng: 24.144444444444446,
    lat: 49.385
  },
  { names: ["کرمانشاه", "کرماشان[1][2]"], lng: 47.065, lat: 34.3142 },
  {
    names: ["قفط", "قفظ"],
    country: "EG",
    lng: 32.81583333333333,
    lat: 25.995555555555555
  },
  {
    names: ["زنامیانکا", "Znamianka", "Знам'янка"],
    country: "UA",
    lng: 32.67333333333333,
    lat: 48.71361111111111
  },
  {
    names: ["اوزین", "Узин"],
    country: "UA",
    lng: 30.4425,
    lat: 49.82416666666667
  },
  {
    names: ["نشویل", "The City of Nashville"],
    country: "US",
    lng: -86.78333333333333,
    lat: 36.166666666666664
  },
  {
    names: ["آشوتسک", "Աշոցք"],
    country: "AM",
    lng: 43.85805555555556,
    lat: 41.0375
  },
  { names: ["فردوسیه"], lng: 51.0667, lat: 35.6 },
  {
    names: ["میخاییلوفکا، اوبلاست ولگوگراد", "Михайловка"],
    country: "RU",
    lng: 43.25,
    lat: 50.06666666666667
  },
  {
    names: ["باد لواتربرگ در هارز", "Bad Lauterberg"],
    country: "DE",
    lng: 10.470555555555556,
    lat: 51.63166666666667
  },
  {
    names: ["چاتانوگا، تنسی", "چاتانوگا", "Chattanooga, Tennessee"],
    country: "US",
    lng: -85.26722222222222,
    lat: 35.04555555555555
  },
  {
    names: ["سیساوان", "Սիսավան"],
    country: "AM",
    lng: 44.666666666666664,
    lat: 39.9
  },
  {
    names: ["ویکتوریا، بریتیش کلمبیا", "ویکتوریا"],
    country: "CA",
    lng: -123.36555555555555,
    lat: 48.42861111111111
  },
  {
    names: ["ازمیر", "İzmir"],
    country: "TR",
    lng: 27.15,
    lat: 38.43333333333333
  },
  { names: ["مارکت‌هایدنفلد"], country: "DE", lng: 9.6, lat: 49.85 },
  {
    names: ["موکوآ", "Mocoa"],
    country: "CO",
    lng: -76.64750000000001,
    lat: 1.15
  },
  {
    names: ["واغارشاپات", "اچمیادزین", "Վաղարշապատ"],
    country: "AM",
    lng: 44.3,
    lat: 40.166666666666664
  },
  {
    names: ["وایت‌هورس، یوکان", "Whitehorse"],
    country: "CA",
    lng: -135.05,
    lat: 60.71666666666667
  },
  { names: ["تماپاچ"], country: "MX", lng: -97.15, lat: 18.75 },
  {
    names: ["الینساوس", "Alingsås"],
    country: "SE",
    lng: 12.533055555555556,
    lat: 57.93
  },
  {
    names: ["فیزلهوفده"],
    country: "DE",
    lng: 9.583333333333334,
    lat: 52.96666666666667
  },
  {
    names: ["شاهومیان، لوری", "شاهومیان", "Շահումյան"],
    country: "AM",
    lng: 44.531666666666666,
    lat: 40.788333333333334
  },
  {
    names: ["نوی‌اشترلیتس"],
    country: "DE",
    lng: 13.063611111111111,
    lat: 53.36472222222223
  },
  {
    names: ["سفنتو گیورگه", "Sfântu Gheorghe"],
    country: "RO",
    lng: 25.7875,
    lat: 45.86361111111111
  },
  {
    names: ["اورشا", "Orsa"],
    country: "SE",
    lng: 14.616666666666667,
    lat: 61.11666666666667
  },
  {
    names: ["لاگه"],
    country: "DE",
    lng: 12.346666666666668,
    lat: 53.93222222222222
  },
  { names: ["شهریار (تهران)"], lng: 51.08, lat: 35.47 },
  {
    names: ["برگن (منطقه سله)", "Bergen"],
    country: "DE",
    lng: 9.96111111111111,
    lat: 52.81027777777778
  },
  {
    names: ["بارانکیلا"],
    country: "CO",
    lng: -74.79638888888888,
    lat: 10.963888888888889
  },
  {
    names: ["بونکفلوسترند", "Bunkeflostrand"],
    country: "SE",
    lng: 12.916666666666666,
    lat: 55.55
  },
  {
    names: ["ارنفردینزدورف"],
    country: "DE",
    lng: 12.969722222222222,
    lat: 50.64611111111111
  },
  {
    names: ["باد اشمیدبرگ"],
    country: "DE",
    lng: 12.737499999999999,
    lat: 51.68805555555555
  },
  {
    names: ["برکلی، کالیفرنیا", "برکلی"],
    country: "US",
    lng: -122.27277777777778,
    lat: 37.87166666666667
  },
  { names: ["والدورف", "Walldorf"], country: "DE", lng: 8.65, lat: 49.3 },
  {
    names: ["بورگ بای ماگدبورگ", "Burg"],
    country: "DE",
    lng: 11.855,
    lat: 52.2725
  },
  {
    names: ["نکازاولم"],
    country: "DE",
    lng: 9.224555555555556,
    lat: 49.191694444444444
  },
  {
    names: ["ریزه", "Rize"],
    country: "TR",
    lng: 40.516666666666666,
    lat: 41.016666666666666
  },
  { names: ["لوکزامبورگ"], lng: 6.116666666666666, lat: 49.6 },
  { names: ["کونیگزبروک"], country: "DE", lng: 13.883333333333333, lat: 51.25 },
  {
    names: ["بیورغاوان", "Բյուրեղավան"],
    country: "AM",
    lng: 44.593611111111116,
    lat: 40.31472222222222
  },
  {
    names: ["چیبا (شهر)", "Chiba", "千葉"],
    country: "JP",
    lng: 140.1,
    lat: 35.6
  },
  {
    names: ["فورت وین، ایندیانا", "Fort Wayne, Indiana"],
    country: "US",
    lng: -85.13916666666667,
    lat: 41.080555555555556
  },
  {
    names: ["قسطمونی", "Kastamonu, Turkey"],
    country: "TR",
    lng: 33.766666666666666,
    lat: 41.36666666666667
  },
  {
    names: ["گرایتس"],
    country: "DE",
    lng: 12.199722222222222,
    lat: 50.65472222222222
  },
  { names: ["وستربورگ"], country: "DE", lng: 7.9725, lat: 50.56388888888888 },
  { names: ["ابردین", "Obar Dheathain"], country: "GB", lng: -2, lat: 57 },
  { names: ["گوترزلوه"], country: "DE", lng: 8.383333333333333, lat: 51.9 },
  { names: ["رامسر"], lng: 50.6825, lat: 36.9003 },
  {
    names: ["آغاونادزور، وایوتس‌جور", "آغاونادزور", "Աղավնաձոր"],
    country: "AM",
    lng: 45.22805555555556,
    lat: 39.78361111111111
  },
  {
    names: ["مسکیرش"],
    country: "DE",
    lng: 9.112499999999999,
    lat: 47.99277777777778
  },
  {
    names: ["کوانجیلار"],
    country: "TR",
    lng: 39.867222222222225,
    lat: 38.72166666666667
  },
  { names: ["چیویتاوکیا"], country: "IT", lng: 11.8, lat: 42.1 },
  {
    names: ["غازی عینتاب", "Antep"],
    country: "TR",
    lng: 37.38333333333333,
    lat: 37.06666666666667
  },
  {
    names: ["لیندن (هسن)", "Linden"],
    country: "DE",
    lng: 8.65,
    lat: 50.53333333333333
  },
  {
    names: ["سن-دنی، ریونیون", "سن-دونی", "Saint-Denis"],
    country: "FR",
    lng: 55.4481,
    lat: 20.8789
  },
  {
    names: ["لانیفتسی", "Lanivtsi", "Ланівці"],
    country: "UA",
    lng: 26.08,
    lat: 49.87
  },
  {
    names: ["هوردوک، استان لویو", "Horodok", "Городок", "Gródek Jagielloński"],
    country: "UA",
    lng: 23.644444444444446,
    lat: 49.78333333333333
  },
  {
    names: ["کورینتس", "Corrientes"],
    country: "AR",
    lng: -58.81666666666667,
    lat: -27.483333333333334
  },
  {
    names: ["رباط (مراکش)", "رباط"],
    country: "MA",
    lng: -6.833333333333333,
    lat: 34.03333333333333
  },
  {
    names: ["گرسن‌اریش"],
    country: "DE",
    lng: 10.832222222222223,
    lat: 51.24944444444444
  },
  { names: ["نیدرنهال"], country: "DE", lng: 9.616666666666667, lat: 49.3 },
  {
    names: ["دارباس", "Դարբաս"],
    country: "AM",
    lng: 46.12222222222222,
    lat: 39.44
  },
  {
    names: ["منچستر", "شهر منچستر"],
    country: "GB",
    lng: -2.2333333333333334,
    lat: 53.46666666666667
  },
  {
    names: ["اولن‌نیتز/ارتسگبیرگه", "Oelsnitz"],
    country: "DE",
    lng: 12.698611111111111,
    lat: 50.72222222222222
  },
  {
    names: ["اروخ"],
    country: "TR",
    lng: 42.17972222222222,
    lat: 37.749722222222225
  },
  {
    names: ["رده (نوردراین-وستفالن)", "Rhede"],
    country: "DE",
    lng: 6.700555555555556,
    lat: 51.833333333333336
  },
  { names: ["بیهور", "Beiuș"], country: "RO", lng: 22.35, lat: 46.65 },
  {
    names: ["گرفناو، بایرن", "Grafenau"],
    country: "DE",
    lng: 13.383333333333333,
    lat: 48.85
  },
  {
    names: ["هورت", "Hürth"],
    country: "DE",
    lng: 6.876111111111111,
    lat: 50.8775
  },
  { names: ["سراب (شهر)"], lng: 47.5481, lat: 37.9264 },
  {
    names: ["ورین کارمیرآقبیور", "Վերին Կարմիրաղբյուր"],
    country: "AM",
    lng: 45.44138888888889,
    lat: 40.884166666666665
  },
  { names: ["باغستان (تهران)"], lng: 51.1122, lat: 35.6383 },
  {
    names: ["تامپیکو"],
    country: "MX",
    lng: -97.86861111111111,
    lat: 22.255277777777778
  },
  {
    names: ["سن خوزه، کالیفرنیا", "سن‌خوزه", "San Jose"],
    country: "US",
    lng: -121.89194444444445,
    lat: 37.33527777777778
  },
  {
    names: ["توردا", "Turda"],
    country: "RO",
    lng: 23.866666666666667,
    lat: 46.53333333333333
  },
  {
    names: ["هویه", "Huế", "Thành phố Huế"],
    country: "VN",
    lng: 107.57916666666667,
    lat: 16.466666666666665
  },
  {
    names: ["آدلسهایم"],
    country: "DE",
    lng: 9.389166666666666,
    lat: 49.40472222222222
  },
  {
    names: ["بوهوسلاو", "Богуслав"],
    country: "UA",
    lng: 30.872777777777777,
    lat: 49.54666666666667
  },
  {
    names: ["آرایی", "Արայի"],
    country: "AM",
    lng: 44.37416666666667,
    lat: 40.45722222222223
  },
  {
    names: ["اشتراسبورگ (اوکرمارک)", "Strasburg"],
    country: "DE",
    lng: 13.75,
    lat: 53.5
  },
  {
    names: ["کبک (شهر)", "Quebec City"],
    country: "CA",
    lng: -71.21666666666667,
    lat: 46.81666666666667
  },
  {
    names: ["شریوپورت، لوییزیانا", "شریوپورت", "Shreveport"],
    country: "US",
    lng: -93.92111111111112,
    lat: 32.46805555555556
  },
  { names: ["اوارال", "Huaral"], country: "PE", lng: -77.2, lat: -11.5 },
  { names: ["خمینی‌شهر"], lng: 51.532614, lat: 32.694806 },
  {
    names: ["نویمارک بای وایمار"],
    country: "DE",
    lng: 11.247777777777777,
    lat: 51.080000000000005
  },
  {
    names: ["مانهایم"],
    country: "DE",
    lng: 8.469166666666666,
    lat: 49.48888888888889
  },
  {
    names: ["نور خاربرد", "Նոր Խարբերդ"],
    country: "AM",
    lng: 44.47777777777778,
    lat: 40.08916666666667
  },
  {
    names: ["هایدلبرگ"],
    country: "DE",
    lng: 8.709999999999999,
    lat: 49.41222222222222
  },
  {
    names: ["کورور", "Koror"],
    country: "PW",
    lng: 134.47916666666666,
    lat: 7.360555555555555
  },
  { names: ["کتز", "Konz"], country: "DE", lng: 6.583333333333333, lat: 49.7 },
  {
    names: ["ریمانوف"],
    country: "PL",
    lng: 21.883333333333333,
    lat: 49.56666666666667
  },
  {
    names: ["بلگراد", "Београд", "Beograd"],
    country: "RS",
    lng: 20.46222222222222,
    lat: 44.82055555555556
  },
  {
    names: ["پترسون، نیوجرسی", "Paterson, New Jersey"],
    country: "US",
    lng: -74.162826,
    lat: 40.914746
  },
  {
    names: ["گردینگ"],
    country: "DE",
    lng: 11.360555555555555,
    lat: 49.051944444444445
  },
  {
    names: ["کاقیزمان"],
    country: "TR",
    lng: 43.134166666666665,
    lat: 40.15833333333333
  },
  {
    names: ["اشمولن"],
    country: "DE",
    lng: 12.356388888888889,
    lat: 50.894999999999996
  },
  {
    names: ["سارایوو", "Sarajevo"],
    country: "BA",
    lng: 18.416666666666668,
    lat: 43.86666666666667
  },
  { names: ["مراغه (مصر)"], country: "EG", lng: 31.6, lat: 26.7 },
  {
    names: ["زی‌لو"],
    country: "DE",
    lng: 14.383055555555556,
    lat: 52.516666666666666
  },
  {
    names: ["چستوهووا", "چنستوهوا"],
    country: "PL",
    lng: 19.116666666666667,
    lat: 50.8
  },
  { names: ["مریدا، مریدا", "مریدا"], country: "VE", lng: -71.15, lat: 8.6 },
  {
    names: ["دغدزوت", "Դեղձուտ"],
    country: "AM",
    lng: 44.54888888888889,
    lat: 40.02638888888889
  },
  {
    names: ["پاراواکار", "Պառավաքար"],
    country: "AM",
    lng: 45.399166666666666,
    lat: 40.980555555555554
  },
  {
    names: ["منطقه لوس ریوس", "Los Ríos Region", "XIV Región de Los Ríos"],
    country: "CL",
    lng: -73.24166666666667,
    lat: -39.80833333333333
  },
  {
    names: ["مخچیان", "Մխչյան"],
    country: "AM",
    lng: 44.49111111111111,
    lat: 40.019999999999996
  },
  {
    names: ["باد ویلدباد", "Bad Wildbad"],
    country: "DE",
    lng: 8.550555555555556,
    lat: 48.750277777777775
  },
  {
    names: ["پاراماریبو", "Paramaribo"],
    country: "SR",
    lng: -55.166666666666664,
    lat: 5.866666666666667
  },
  {
    names: ["تمپی، آریزونا"],
    country: "US",
    lng: -111.94305555555556,
    lat: 33.42944444444444
  },
  {
    names: ["میاسنیکیان", "Մյասնիկյան"],
    country: "AM",
    lng: 43.906388888888884,
    lat: 40.177499999999995
  },
  {
    names: ["لودویگزلوست", "Ludwigslust"],
    country: "DE",
    lng: 11.483333333333333,
    lat: 53.31666666666667
  },
  { names: ["چناران"], lng: 59.119658, lat: 36.642818 },
  {
    names: ["فونافوتی", "Funafuti"],
    country: "TV",
    lng: 179.21666666666667,
    lat: -8.516666666666667
  },
  {
    names: ["نرکین گتاشن", "Ներքին Գետաշեն"],
    country: "AM",
    lng: 45.26416666666667,
    lat: 40.14666666666667
  },
  {
    names: ["والدرزهوف"],
    country: "DE",
    lng: 12.066666666666666,
    lat: 49.96666666666667
  },
  { names: ["مهدی‌شهر"], lng: 53.21, lat: 35.43 },
  {
    names: ["شرناق"],
    country: "TR",
    lng: 42.461111111111116,
    lat: 37.51638888888889
  },
  {
    names: ["بنین (شهر)", "شهر بنین"],
    country: "NG",
    lng: 5.6,
    lat: 6.316666666666666
  },
  {
    names: ["انیپتال", "Ennepetal"],
    country: "DE",
    lng: 7.333333333333333,
    lat: 51.28333333333333
  },
  {
    names: ["هورنبرگ (شوارتسوالد)", "Hornberg"],
    country: "DE",
    lng: 8.230833333333333,
    lat: 48.21333333333334
  },
  {
    names: ["آزاتان", "Ազատան"],
    country: "AM",
    lng: 43.82055555555556,
    lat: 40.723888888888894
  },
  { names: ["کرج"], lng: 50.97, lat: 35.82 },
  {
    names: ["بنگلور", "ಬೆಂಗಳೂರು"],
    country: "IN",
    lng: 77.56666666666666,
    lat: 12.966666666666667
  },
  {
    names: ["یوکوهاما", "Yokohama", "横浜"],
    country: "JP",
    lng: 139.63805555555555,
    lat: 35.44416666666666
  },
  {
    names: ["تارانتو", "Taranto", "Tarentum"],
    country: "IT",
    lng: 17.233333333333334,
    lat: 40.46666666666667
  },
  { names: ["مزار شریف"], country: "AF", lng: 67.11666666666666, lat: 36.7 },
  { names: ["بهشهر"], lng: 53.55, lat: 36.7 },
  {
    names: ["گیفو (شهر)", "Gifu", "岐阜"],
    country: "JP",
    lng: 136.76666666666668,
    lat: 35.416666666666664
  },
  {
    names: ["راس‌الخیمه", "Emirate of Ras al-Khaimah", "اماره راس الخیمه"],
    country: "AE",
    lng: 55.95,
    lat: 25.783333333333335
  },
  {
    names: ["خاچیک، ارمنستان", "خاچیک", "Խաչիկ"],
    country: "AM",
    lng: 45.205555555555556,
    lat: 39.62166666666667
  },
  {
    names: ["اشلوشترن", "Schlüchtern"],
    country: "DE",
    lng: 9.516666666666667,
    lat: 50.35
  },
  { names: ["نوی-ایزنبورگ"], country: "DE", lng: 8.7, lat: 50.05 },
  { names: ["صباشهر"], lng: 51.1167, lat: 35.5833 },
  {
    names: ["کوستا مسا، کالیفرنیا", "Costa Mesa, California"],
    country: "US",
    lng: -117.91222222222223,
    lat: 33.665
  },
  {
    names: ["هنیچسک", "Henichesk", "Генічеськ"],
    country: "UA",
    lng: 34.8,
    lat: 46.166666666666664
  },
  {
    names: ["ویازمسکی، خاباروفسک", "Вяземский"],
    country: "RU",
    lng: 134.75722222222223,
    lat: 47.525
  },
  {
    names: ["کلمبوس، اوهایو", "کلمبوس", "City of Columbus"],
    country: "US",
    lng: -82.98333333333333,
    lat: 39.983333333333334
  },
  {
    names: ["آرنسبورگ"],
    country: "DE",
    lng: 10.24111111111111,
    lat: 53.67472222222222
  },
  {
    names: ["فونتانا، کالیفرنیا", "فونتانا"],
    country: "",
    lng: -117.46666666666667,
    lat: 34.1
  },
  {
    names: ["ادمونتون", "Edmonton"],
    country: "CA",
    lng: -113.5,
    lat: 53.53333333333333
  },
  {
    names: ["والبو", "Valbo"],
    country: "SE",
    lng: 17.033333333333335,
    lat: 60.65
  },
  { names: ["وویچ"], country: "PL", lng: 19.933333333333334, lat: 52.1 },
  {
    names: ["ومژا"],
    country: "PL",
    lng: 22.083333333333332,
    lat: 53.166666666666664
  },
  {
    names: ["زالتسکتن", "Salzkotten"],
    country: "DE",
    lng: 8.604722222222222,
    lat: 51.670833333333334
  },
  {
    names: ["وزنبرگ، مکلنبورگ", "Wesenberg"],
    country: "DE",
    lng: 12.966666666666667,
    lat: 53.266666666666666
  },
  { names: ["هندوراس"], lng: -87.21666666666667, lat: 14.1 },
  { names: ["لامرد"], lng: 53.176789, lat: 27.342266 },
  { names: ["ناتال"], country: "BR", lng: -35.2, lat: -5.783333333333333 },
  { names: ["ترویزو"], country: "IT", lng: 12.25, lat: 45.666666666666664 },
  {
    names: ["آرارات (آرارات)", "آرارات", "Արարատ"],
    country: "AM",
    lng: 44.7025,
    lat: 39.83027777777778
  },
  {
    names: ["ایالات متحده آمریکا"],
    lng: -77.03333333333333,
    lat: 38.88333333333333
  },
  {
    names: ["کرولوتس", "Krolevets", "Кролевець"],
    country: "UA",
    lng: 33.38333333333333,
    lat: 51.55
  },
  {
    names: ["لانداو این در فالتز", "Landau"],
    country: "DE",
    lng: 8.123055555555556,
    lat: 49.19944444444444
  },
  {
    names: ["داربنیک", "Դարբնիկ"],
    country: "AM",
    lng: 44.37638888888889,
    lat: 40.106944444444444
  },
  {
    names: ["کوبه (شهر)", "کُوبِه", "神戸"],
    country: "JP",
    lng: 135.19555555555556,
    lat: 34.69
  },
  {
    names: ["سواکار", "Սևաքար"],
    country: "AM",
    lng: 46.44555555555555,
    lat: 39.269999999999996
  },
  {
    names: ["ناحیه ولوره", "استان ولوره", "Rrethi i Vlorës"],
    country: "AL",
    lng: 19.616666666666667,
    lat: 40.35
  },
  {
    names: ["سارچاپت", "Սարչապետ"],
    country: "AM",
    lng: 44.38527777777778,
    lat: 41.19916666666666
  },
  {
    names: ["آگاراکادزور", "Ագարակաձոր"],
    country: "AM",
    lng: 45.345555555555556,
    lat: 39.73638888888889
  },
  {
    names: ["کاپلن"],
    country: "DE",
    lng: 9.931111111111111,
    lat: 54.66138888888889
  },
  {
    names: ["سیمی ولی، کالیفرنیا", "سیمی ولی"],
    country: "US",
    lng: -118.73944444444444,
    lat: 34.27111111111111
  },
  {
    names: ["هارتاوان", "Հարթավան"],
    country: "AM",
    lng: 44.400555555555556,
    lat: 40.47805555555556
  },
  { names: ["مهاباد", "مه‌هاباد"], lng: 45.7217, lat: 37.1647 },
  {
    names: ["نیکولاس رومرو، مکزیکو"],
    country: "MX",
    lng: -99.31416666666667,
    lat: 19.625
  },
  {
    names: ["زرنشت", "Zărnești"],
    country: "RO",
    lng: 25.333333333333332,
    lat: 45.56666666666667
  },
  {
    names: [
      "کامیانکا-بوزکا",
      "Kamianka-Buzka",
      "Кам'янка-Бузька",
      "Kamionka Bużańska"
    ],
    country: "UA",
    lng: 24.35,
    lat: 50.1
  },
  {
    names: ["گارنی (روستا)", "گارنی", "Գառնի"],
    country: "AM",
    lng: 44.723055555555554,
    lat: 40.11944444444445
  },
  {
    names: ["ارکرات"],
    country: "DE",
    lng: 6.914722222222222,
    lat: 51.223888888888894
  },
  {
    names: ["میرکولا سیبیلو", "Miercurea Sibiului"],
    country: "RO",
    lng: 23.783333333333335,
    lat: 45.88333333333333
  },
  {
    names: ["آروچ", "Արուճ"],
    country: "AM",
    lng: 44.07916666666667,
    lat: 40.2925
  },
  {
    names: ["اوشی", "Ուշի"],
    country: "AM",
    lng: 44.37305555555555,
    lat: 40.348333333333336
  },
  {
    names: ["حی فیصل (استان جیزه)", "حی فیصل"],
    country: "EG",
    lng: 31,
    lat: 29
  },
  {
    names: ["گرند رپیدز، میشیگان", "Grand Rapids, Michigan"],
    country: "US",
    lng: -85.65571944444444,
    lat: 42.96125
  },
  {
    names: ["استانبول", "İstanbul"],
    country: "TR",
    lng: 28.955,
    lat: 41.01361111111111
  },
  {
    names: ["تاگبیلاران", "Dakbayan sa Tagbilaran", "Lungsod ng Tagbilaran"],
    country: "PH",
    lng: 123.85,
    lat: 9.65
  },
  {
    names: ["اوزاسکو", "Osasco"],
    country: "BR",
    lng: -46.77472222222222,
    lat: -23.54138888888889
  },
  {
    names: ["تالین", "Tallinn"],
    country: "EE",
    lng: 24.74527777777778,
    lat: 59.43722222222222
  },
  {
    names: ["اینکرمان", "Inkerman", "Інкерман", "Инкерман", "İnkerman"],
    country: "UA",
    lng: 33.6,
    lat: 44.6
  },
  {
    names: ["لرناروت", "Լեռնարոտ"],
    country: "AM",
    lng: 44.11666666666667,
    lat: 40.35
  },
  {
    names: ["چاییرووا", "Agios Theodoros"],
    country: "CY",
    lng: 34.02722222222222,
    lat: 35.36611111111111
  },
  {
    names: ["کی‌یف", "کی یف", "Київ", "Киев"],
    country: "UA",
    lng: 30.523333333333333,
    lat: 50.45
  },
  {
    names: ["آختالا", "Ախթալա"],
    country: "AM",
    lng: 44.766666666666666,
    lat: 41.13333333333333
  },
  {
    names: ["کارتاخنا", "Cartagena"],
    country: "ES",
    lng: -0.9833333333333333,
    lat: 37.6
  },
  { names: ["اصلاحیه", "Islahiye"], country: "TR", lng: 36.6345, lat: 37.025 },
  {
    names: ["کارمراشن، وایوتس‌جور", "کارمراشِن", "Կարմրաշեն"],
    country: "AM",
    lng: 45.53055555555555,
    lat: 39.81638888888889
  },
  { names: ["لوبتین"], country: "DE", lng: 11.083333333333334, lat: 53.3 },
  {
    names: ["قیریق‌قلعه"],
    country: "TR",
    lng: 33.513888888888886,
    lat: 39.84166666666667
  },
  {
    names: ["بالدیبیا", "Valdivia"],
    country: "CL",
    lng: -73.24583333333334,
    lat: -39.81388888888888
  },
  {
    names: ["بالیکسیر"],
    country: "TR",
    lng: 27.883333333333333,
    lat: 39.63333333333333
  },
  {
    names: ["اسلاووتیچ", "Славутич"],
    country: "UA",
    lng: 30.756944444444443,
    lat: 51.52055555555555
  },
  {
    names: ["شارلوت، کارولینای شمالی", "شارلوت", "Charlotte"],
    country: "US",
    lng: -80.84333333333333,
    lat: 35.22694444444445
  },
  {
    names: ["کابل"],
    country: "AF",
    lng: 69.16666666666667,
    lat: 34.53333333333333
  },
  {
    names: ["آچیریاله", "Acireale", "Jaciriali"],
    country: "IT",
    lng: 15.166666666666666,
    lat: 37.61666666666667
  },
  {
    names: ["ماچکا", "Maçka"],
    country: "TR",
    lng: 39.61666666666667,
    lat: 40.81666666666667
  },
  {
    names: ["فور-دو-فرانس", "Fort-de-France"],
    country: "FR",
    lng: -61.083333333333336,
    lat: 14.6
  },
  {
    names: ["ایلگین", "Ilgın"],
    country: "TR",
    lng: 31.916666666666668,
    lat: 38.28333333333333
  },
  {
    names: ["کراماتورسک", "Kramatorsk", "Краматорськ"],
    country: "UA",
    lng: 37.53333333333333,
    lat: 48.71666666666667
  },
  {
    names: ["گروستو", "Grosseto"],
    country: "IT",
    lng: 11.1,
    lat: 42.766666666666666
  },
  {
    names: ["انتاریو، کالیفرنیا", "انتاریو"],
    country: "US",
    lng: -117.62777777777777,
    lat: 34.05277777777778
  },
  {
    names: ["فیودوسیا", "Feodosia", "Феодосия", "Kefe", "Феодосія"],
    country: "UA",
    lng: 35.37916666666667,
    lat: 45.04888888888889
  },
  { names: ["ارومیه"], lng: 45.04, lat: 37.33 },
  {
    names: ["اوشاکان", "Օշական"],
    country: "AM",
    lng: 44.31472222222222,
    lat: 40.263333333333335
  },
  {
    names: ["لوساهوویت", "Լուսահովիտ"],
    country: "AM",
    lng: 45.18333333333333,
    lat: 40.95
  },
  { names: ["زولاکار", "Զոլաքար"], country: "AM", lng: 45.375, lat: 40.125 },
  {
    names: ["خیزان"],
    country: "TR",
    lng: 42.426944444444445,
    lat: 38.22555555555556
  },
  {
    names: ["ناگویا", "名古屋市"],
    country: "JP",
    lng: 136.9,
    lat: 35.18333333333333
  },
  {
    names: ["تاوزند اوکس"],
    country: "US",
    lng: -118.875,
    lat: 34.18944444444444
  },
  {
    names: ["ابرزباخ آن در فیلز"],
    country: "DE",
    lng: 9.523611111111112,
    lat: 48.71472222222223
  },
  {
    names: ["اگنیت", "Agnita"],
    country: "RO",
    lng: 24.61722222222222,
    lat: 45.973055555555554
  },
  {
    names: ["بانجول", "Banjul town"],
    country: "GM",
    lng: -16.5775,
    lat: 13.453055555555554
  },
  {
    names: ["آرگاواند، آرماویر", "آرگاواند", "Արգավանդ"],
    country: "AM",
    lng: 44.09527777777778,
    lat: 40.06083333333333
  },
  {
    names: ["ورین پتقنی", "Վերին Պտղնի"],
    country: "AM",
    lng: 44.60111111111111,
    lat: 40.27027777777778
  },
  {
    names: ["کیتیله", "Chitila"],
    country: "RO",
    lng: 25.975277777777777,
    lat: 44.51722222222222
  },
  {
    names: ["کاواساکی، کاناگاوا", "Kawasaki", "川崎"],
    country: "JP",
    lng: 139.7,
    lat: 35.516666666666666
  },
  {
    names: ["اسکلپ"],
    country: "TR",
    lng: 34.473888888888894,
    lat: 40.736111111111114
  },
  {
    names: ["باغانیس", "Բաղանիս"],
    country: "AM",
    lng: 45.06666666666667,
    lat: 41.11666666666667
  },
  {
    names: ["سولوسبوره", "Sölvesborg"],
    country: "SE",
    lng: 14.575277777777778,
    lat: 56.04416666666666
  },
  {
    names: ["نرزهایم"],
    country: "DE",
    lng: 10.334444444444445,
    lat: 48.75416666666667
  },
  {
    names: ["دیگرفوش"],
    country: "SE",
    lng: 14.433333333333334,
    lat: 59.233333333333334
  },
  {
    names: ["کلمبوس، اوهایو", "کلمبوس", "City of Columbus"],
    country: "US",
    lng: -82.98333333333333,
    lat: 39.983333333333334
  },
  { names: ["کابیماس"], country: "VE", lng: -71.45, lat: 10.4 },
  {
    names: ["ویتوریا (ایتالیا)", "Vittoria"],
    country: "IT",
    lng: 14.533333333333333,
    lat: 36.95
  },
  {
    names: ["تلگته", "Telgte"],
    country: "DE",
    lng: 7.785555555555556,
    lat: 51.981944444444444
  },
  {
    names: ["سیوداد دل کارمن"],
    country: "MX",
    lng: -91.83333333333333,
    lat: 18.633333333333333
  },
  { names: ["گنتین"], country: "DE", lng: 12.166666666666666, lat: 52.4 },
  {
    names: ["فریمانت، کالیفرنیا", "فریمانت", "Fremont"],
    country: "US",
    lng: -121.98861111111111,
    lat: 37.54833333333333
  },
  {
    names: ["هوتاشن", "Հովտաշեն"],
    country: "AM",
    lng: 43.9,
    lat: 40.666666666666664
  },
  {
    names: ["وارسر", "Վարսեր"],
    country: "AM",
    lng: 44.91111111111111,
    lat: 40.55611111111111
  },
  {
    names: ["گرمرزهایم"],
    country: "DE",
    lng: 8.366666666666667,
    lat: 49.21666666666667
  },
  {
    names: ["لوبناو"],
    country: "DE",
    lng: 13.966666666666667,
    lat: 51.86666666666667
  },
  {
    names: ["بوهوش", "Buhuşi"],
    country: "RO",
    lng: 26.704166666666666,
    lat: 46.715
  },
  {
    names: ["فورت ایم والد"],
    country: "DE",
    lng: 12.84,
    lat: 49.30972222222222
  },
  { names: ["کیشیناو"], country: "MD", lng: 28.916666666666668, lat: 47 },
  {
    names: ["هوکنهایم"],
    country: "DE",
    lng: 8.547222222222222,
    lat: 49.31805555555556
  },
  {
    names: ["لاگه، نوردراین-وستفالن", "Lage"],
    country: "DE",
    lng: 8.8,
    lat: 51.96666666666667
  },
  {
    names: ["پورت مورزبی", "Pot Mosbi", "Port Moresb"],
    country: "PG",
    lng: 147.28333333333333,
    lat: -9.416666666666666
  },
  {
    names: ["یاسینوفاتا", "Yasynuvata", "Ясинувата"],
    country: "UA",
    lng: 37.862500000000004,
    lat: 48.12777777777778
  },
  {
    names: ["اودوبش", "Odobeşti"],
    country: "RO",
    lng: 27.066666666666666,
    lat: 45.766666666666666
  },
  { names: ["اوتویدبریه", "Åtvidaberg"], country: "SE", lng: 16, lat: 58.2 },
  {
    names: ["گنوین"],
    country: "DE",
    lng: 12.716666666666667,
    lat: 53.96666666666667
  },
  {
    names: ["آرورا، ایلینوی"],
    country: "US",
    lng: -88.28999999999999,
    lat: 41.763333333333335
  },
  {
    names: ["اوفنبورگ"],
    country: "DE",
    lng: 7.940833333333334,
    lat: 48.47083333333334
  },
  {
    names: ["فاستیو", "Фастів"],
    country: "UA",
    lng: 29.916666666666668,
    lat: 50.083333333333336
  },
  {
    names: ["گایشت", "Găești"],
    country: "RO",
    lng: 25.31972222222222,
    lat: 44.71944444444445
  },
  {
    names: ["باد برنک ایم فیشتلگبیرگه"],
    country: "DE",
    lng: 11.672222222222222,
    lat: 50.047777777777775
  },
  {
    names: ["لیاویانگ", "辽阳市"],
    country: "CN",
    lng: 123.18333333333334,
    lat: 41.266666666666666
  },
  {
    names: ["کورینتس", "Corrientes"],
    country: "AR",
    lng: -58.81666666666667,
    lat: -27.483333333333334
  },
  {
    names: ["آنتارامج", "Անտառամեջ"],
    country: "AM",
    lng: 45.086666666666666,
    lat: 40.68388888888889
  },
  {
    names: ["سن سورو", "San Severo"],
    country: "IT",
    lng: 15.383333333333333,
    lat: 41.68333333333333
  },
  {
    names: ["کری، کارولینای شمالی", "Cary"],
    country: "US",
    lng: -78.80027777777778,
    lat: 35.778888888888886
  },
  {
    names: ["تسویکاو"],
    country: "DE",
    lng: 12.49611111111111,
    lat: 50.71888888888889
  },
  {
    names: ["بوجومبورا", "Bujumbura"],
    country: "BI",
    lng: 29.366666666666667,
    lat: -3.3833333333333333
  },
  { names: ["هاولزی"], country: "DE", lng: 12.466666666666667, lat: 52.5 },
  {
    names: ["سرای، تکیرداغ", "Saray"],
    country: "TR",
    lng: 27.92162,
    lat: 41.44112
  },
  {
    names: ["پورت سنت لوسی، فلوریدا", "The City of Port St. Lucie, Florida"],
    country: "US",
    lng: -80.35499999999999,
    lat: 27.27583333333333
  },
  {
    names: ["لیندومه", "Lindome"],
    country: "SE",
    lng: 12.1,
    lat: 57.56666666666667
  },
  {
    names: ["لهلی گره", "Lehliu Gară"],
    country: "RO",
    lng: 26.853333333333335,
    lat: 44.43833333333333
  },
  {
    names: ["فالکنزی"],
    country: "DE",
    lng: 13.091666666666667,
    lat: 52.55833333333333
  },
  {
    names: ["هویکسکویلوکن"],
    country: "MX",
    lng: -99.35083333333333,
    lat: 19.361111111111114
  },
  {
    names: ["خملنیتسکیی، اوکراین", "خملنیتسکی", "Хмельни́цький"],
    country: "UA",
    lng: 27,
    lat: 49.416666666666664
  },
  {
    names: ["آتچه", "Atça"],
    country: "TR",
    lng: 28.216666666666665,
    lat: 37.88333333333333
  },
  {
    names: ["یانکرز", "City of Yonkers"],
    country: "US",
    lng: -73.86444444444444,
    lat: 40.94138888888889
  },
  {
    names: ["اسپرینگفیلد، ماساچوست"],
    country: "US",
    lng: -72.59027777777777,
    lat: 42.10138888888889
  },
  {
    names: ["لویویانگ", "洛阳市"],
    country: "CN",
    lng: 112.44222222222223,
    lat: 34.66972222222222
  },
  {
    names: ["رباط (مراکش)", "رباط"],
    country: "MA",
    lng: -6.833333333333333,
    lat: 34.03333333333333
  },
  {
    names: ["آرتاواز", "Արտավազ"],
    country: "AM",
    lng: 44.57472222222223,
    lat: 40.619166666666665
  },
  { names: ["اصفهان"], lng: 51.65, lat: 32.63 },
  {
    names: ["کرویزبرگ"],
    country: "DE",
    lng: 10.24472222222222,
    lat: 51.05138888888889
  },
  {
    names: ["بوداپست"],
    country: "HU",
    lng: 19.05027777777778,
    lat: 47.471944444444446
  },
  {
    names: ["التویله آن در راین", "Eltville"],
    country: "DE",
    lng: 8.119166666666667,
    lat: 50.025555555555556
  },
  {
    names: ["اولمن", "Ulmen"],
    country: "DE",
    lng: 6.979588888888889,
    lat: 50.208688888888894
  },
  {
    names: ["یورک", "York"],
    country: "GB",
    lng: -1.0802777777777777,
    lat: 53.958333333333336
  },
  {
    names: ["وازونگن"],
    country: "DE",
    lng: 10.366666666666667,
    lat: 50.666666666666664
  },
  {
    names: ["داودلار", "Davutlar"],
    country: "TR",
    lng: 27.3,
    lat: 37.733333333333334
  },
  { names: ["محلات"], lng: 50.45, lat: 33.9167 },
  {
    names: ["زلینگن‌اشتات"],
    country: "DE",
    lng: 8.966666666666667,
    lat: 50.03333333333333
  },
  {
    names: ["لهاسا", "Lhasa", ""],
    country: "CN",
    lng: 91.11666666666666,
    lat: 29.65
  },
  {
    names: ["گایزلهورینگ"],
    country: "DE",
    lng: 12.3925,
    lat: 48.825833333333335
  },
  {
    names: ["کیرشهایمبولاندن"],
    country: "DE",
    lng: 8.011666666666667,
    lat: 49.66638888888889
  },
  { names: ["ریورا", "Rivera"], country: "UY", lng: -57, lat: -31 },
  {
    names: ["هرنه", "Herne"],
    country: "DE",
    lng: 7.216666666666667,
    lat: 51.55
  },
  {
    names: ["اوبرتس‌هاوزن"],
    country: "DE",
    lng: 8.833333333333334,
    lat: 50.06666666666667
  },
  {
    names: ["متسادسور", "Մեծաձոր"],
    country: "AM",
    lng: 44.05,
    lat: 40.38333333333333
  },
  {
    names: ["ببدر", "Babadag"],
    country: "RO",
    lng: 28.741944444444446,
    lat: 44.89805555555556
  },
  {
    names: ["هایکاسار", "Հայկասար"],
    country: "AM",
    lng: 43.88333333333333,
    lat: 40.6
  },
  {
    names: ["آنتالیا", "Antalya"],
    country: "TR",
    lng: 30.833333333333332,
    lat: 36.833333333333336
  },
  {
    names: ["برله", "Bârlad"],
    country: "RO",
    lng: 27.666666666666668,
    lat: 46.21666666666667
  },
  {
    names: ["والنسیا", "(به اسپانیایی: Valencia)"],
    country: "ES",
    lng: -0.38333333333333336,
    lat: 39.46666666666667
  },
  {
    names: ["ریونگرو (انتیوکیا)", "Rionegro", "Santiago de Arma de Rionegro"],
    country: "CO",
    lng: -75.3888888888889,
    lat: 6.155
  },
  {
    names: ["استرومستاد", "Strömstad"],
    country: "SE",
    lng: 11.166666666666666,
    lat: 58.93333333333333
  },
  {
    names: ["ژیانگمن", "江门市"],
    country: "CN",
    lng: 113.06666666666666,
    lat: 22.566666666666666
  },
  {
    names: ["دنپاسار", "Denpasar"],
    country: "ID",
    lng: 115.21666666666667,
    lat: -8.65
  },
  {
    names: ["گوادالاخارا، خالیسکو", "گوادالاخارا"],
    country: "MX",
    lng: -103.35034166666667,
    lat: 20.66671388888889
  },
  {
    names: ["یارمن"],
    country: "DE",
    lng: 13.333333333333334,
    lat: 53.916666666666664
  },
  {
    names: ["باد الدزوله"],
    country: "DE",
    lng: 10.374166666666667,
    lat: 53.81166666666666
  },
  {
    names: ["ایندیاناپلیس", "ایندیاناپولیس، ایندیانا"],
    country: "US",
    lng: -86,
    lat: 39
  },
  {
    names: ["اوبراورزل", "Oberursel (Taunus)"],
    country: "DE",
    lng: 8.576925,
    lat: 50.20321944444445
  },
  {
    names: ["البیا", "Olbia"],
    country: "IT",
    lng: 9.5,
    lat: 40.916666666666664
  },
  {
    names: ["ینی‌چیفتلیک", "Yeniçiftlik"],
    country: "TR",
    lng: 27.85,
    lat: 41.016666666666666
  },
  {
    names: ["گنگتوک", "गान्तोक", "སྒང་ཐོག་"],
    country: "IN",
    lng: 88.62,
    lat: 27.33
  },
  {
    names: ["بنجن"],
    country: "PL",
    lng: 19.116666666666667,
    lat: 50.333333333333336
  },
  {
    names: ["مونته‌ویدیو", "Montevideo"],
    country: "UY",
    lng: -56.18194444444444,
    lat: -34.88361111111111
  },
  {
    names: ["ماومینگ", "茂名市"],
    country: "CN",
    lng: 110.91666666666667,
    lat: 21.65
  },
  {
    names: ["ایوتین"],
    country: "DE",
    lng: 10.618055555555555,
    lat: 54.13777777777778
  },
  { names: ["آذرشهر", "توفارقان"], lng: 45.85, lat: 37.46 },
  { names: ["اوشاوا", "Oshawa"], country: "CA", lng: -78.85, lat: 43.9 },
  { names: ["اویتفیلدن"], country: "DE", lng: 9.25, lat: 48.733333333333334 },
  {
    names: ["گوریس", "Գորիս"],
    country: "AM",
    lng: 46.33861111111111,
    lat: 39.507777777777775
  },
  {
    names: ["جولیت، ایلینوی"],
    country: "US",
    lng: -88.14055555555557,
    lat: 41.5225
  },
  {
    names: ["بارگته‌هایده"],
    country: "DE",
    lng: 10.266666666666667,
    lat: 53.71666666666667
  },
  {
    names: ["کلیپپان"],
    country: "SE",
    lng: 13.128333333333334,
    lat: 56.13444444444444
  },
  {
    names: ["اشتاین (میتلفرانکن)", "Stein"],
    country: "DE",
    lng: 11.016666666666667,
    lat: 49.416666666666664
  },
  {
    names: [
      "جیمزتاون، سینت هلینا",
      "جیمز تاون، سینت هلینا",
      "Jamestown, Saint Helena"
    ],
    country: "GB",
    lng: -5.718055555555556,
    lat: -15.924444444444443
  },
  {
    names: ["آندس (انتیوکیا)", "Andes"],
    country: "CO",
    lng: -75.91666666666667,
    lat: 5.583333333333333
  },
  {
    names: ["بانکوک", "Bangkok", "کرونگ تپ ماها ناکون"],
    country: "AM",
    lng: 100.49388888888889,
    lat: 13.752222222222223
  },
  {
    names: ["بوستون", "Boston"],
    country: "US",
    lng: -71.06166666666667,
    lat: 42.35777777777778
  },
  {
    names: ["سرای‌کوی", "Sarayköy"],
    country: "TR",
    lng: 28.92666388888889,
    lat: 37.926455555555556
  },
  {
    names: ["یارموت"],
    country: "CA",
    lng: -66.11749999999999,
    lat: 43.836111111111116
  },
  {
    names: ["کلکته", "কলকাতা"],
    country: "IN",
    lng: 88.36666666666666,
    lat: 22.566666666666666
  },
  {
    names: ["بورگوا (شوابن)"],
    country: "DE",
    lng: 10.406944444444445,
    lat: 48.43222222222222
  },
  {
    names: ["تسو، میه", "Tsu", "津"],
    country: "JP",
    lng: 136.5,
    lat: 34.71666666666667
  },
  {
    names: ["گرشام، اورگن", "Gresham, Oregon"],
    country: "US",
    lng: -122.43944444444445,
    lat: 45.50361111111111
  },
  {
    names: ["آلتلاندسبرگ"],
    country: "DE",
    lng: 13.733055555555556,
    lat: 52.56666666666667
  },
  {
    names: ["فورستناو، آلمان", "Fürstenau"],
    country: "DE",
    lng: 7.666666666666667,
    lat: 52.516666666666666
  },
  {
    names: ["داتلن", "Datteln"],
    country: "DE",
    lng: 7.341666666666667,
    lat: 51.653888888888886
  },
  {
    names: ["دنتون، تگزاس", "City of Denton"],
    country: "US",
    lng: -97.12916666666666,
    lat: 33.21638888888889
  },
  { names: ["فیروزآباد"], lng: 52.4106, lat: 29.5038 },
  {
    names: ["والدهایم (زاکسن)"],
    country: "DE",
    lng: 13.016666666666667,
    lat: 51.06666666666667
  },
  {
    names: ["باد ویلزناک"],
    country: "DE",
    lng: 11.949722222222222,
    lat: 52.95
  },
  {
    names: ["کونلو", "Kungälv"],
    country: "SE",
    lng: 11.966666666666667,
    lat: 57.86666666666667
  },
  { names: ["روهیلد"], country: "DE", lng: 10.55, lat: 50.38333333333333 },
  {
    names: ["لولیو"],
    country: "SE",
    lng: 22.153888888888886,
    lat: 65.58444444444444
  },
  {
    names: ["اشمالنبرگ", "Schmallenberg"],
    country: "DE",
    lng: 8.3,
    lat: 51.13333333333333
  },
  {
    names: ["لانگ فنگ", "廊坊市"],
    country: "CN",
    lng: 116.7,
    lat: 39.516666666666666
  },
  {
    names: ["نیواورلیان", "نیو اورلیان"],
    country: "US",
    lng: -90.07055555555556,
    lat: 29.96472222222222
  },
  {
    names: ["کارتاخنا", "Cartagena"],
    country: "ES",
    lng: -0.9833333333333333,
    lat: 37.6
  },
  {
    names: ["بورگنترایش", "Borgentreich"],
    country: "DE",
    lng: 9.25,
    lat: 51.56666666666667
  },
  {
    names: ["شاختیرسک", "Шахтёрск"],
    country: "RU",
    lng: 142.11666666666667,
    lat: 49.166666666666664
  },
  {
    names: ["استمفورد، کنتیکت", "Stamford, Connecticut"],
    country: "US",
    lng: -73.53888888888889,
    lat: 41.05277777777778
  },
  { names: ["گرمسار"], lng: 52.2, lat: 35.12 },
  {
    names: ["جرج‌تاون", "Georgetown, Guyana"],
    country: "GY",
    lng: -58.166666666666664,
    lat: 6.8
  },
  {
    names: ["اشتات‌اولدندورف"],
    country: "DE",
    lng: 9.616666666666667,
    lat: 51.88333333333333
  },
  { names: ["لاوخهمر"], country: "DE", lng: 13.8, lat: 51.5 },
  {
    names: ["دربند (روسیه)", "دربند", "Дербент"],
    country: "RU",
    lng: 48.3,
    lat: 42.05
  },
  {
    names: ["ویکوو ده سو", "Vicovu de Sus"],
    country: "RO",
    lng: 25.68,
    lat: 47.92583333333333
  },
  {
    names: ["ال کگروو، کالیفرنیا", "ال کگروو"],
    country: "US",
    lng: -121.38194444444444,
    lat: 38.43833333333333
  },
  {
    names: ["اومورلو", "Umurlu"],
    country: "TR",
    lng: 27.966666666666665,
    lat: 37.85
  },
  { names: ["زوریخ", "Zürich"], lng: 8.33, lat: 47.22 },
  {
    names: ["لینتس آم راین"],
    country: "DE",
    lng: 7.284722222222222,
    lat: 50.57027777777778
  },
  {
    names: ["هریدن"],
    country: "DE",
    lng: 10.516666666666667,
    lat: 49.21666666666667
  },
  {
    names: ["برزیفکا", "Березівка"],
    country: "UA",
    lng: 30.912777777777777,
    lat: 47.20388888888889
  },
  { names: ["فرایمد"], country: "DE", lng: 12.183333333333334, lat: 49.5 },
  { names: ["نیبول"], country: "DE", lng: 8.8296, lat: 54.7881 },
  {
    names: ["جیبوتی (شهر)", "شهر جیبوتی", "Ville de Djibouti"],
    country: "DJ",
    lng: 43.166666666666664,
    lat: 11.6
  },
  {
    names: ["فورستنفلدبروک"],
    country: "DE",
    lng: 11.255555555555556,
    lat: 48.17777777777778
  },
  {
    names: ["اشکلارسکا پرمبا", "Szklarska Poręba"],
    country: "PL",
    lng: 15.533333333333333,
    lat: 50.833333333333336
  },
  {
    names: ["ترانی", "Trani"],
    country: "IT",
    lng: 16.416666666666668,
    lat: 41.266666666666666
  },
  {
    names: ["گایزنهایم", "Geisenheim"],
    country: "DE",
    lng: 7.967222222222222,
    lat: 49.98444444444444
  },
  { names: ["اندیشه (شهر)"], lng: 51.01666, lat: 35.68333 },
  {
    names: ["بردیچیف", "Berdychiv", "Бердичів"],
    country: "UA",
    lng: 28.566666666666666,
    lat: 49.9
  },
  {
    names: ["جوراگلوخ", "Ձորագլուխ"],
    country: "AM",
    lng: 44.48527777777778,
    lat: 40.58027777777778
  },
  {
    names: ["کره (رومانی)", "Carei", "Nagykároly"],
    country: "RO",
    lng: 22.46686944444444,
    lat: 47.68396666666666
  },
  {
    names: ["توره دل گرکو", "Torre del Greco"],
    country: "IT",
    lng: 14.366666666666667,
    lat: 40.78333333333333
  },
  {
    names: ["برشا", "Brèsa", "Brescia"],
    country: "IT",
    lng: 10.233333333333333,
    lat: 45.53333333333333
  },
  {
    names: ["داراناک", "Դարանակ"],
    country: "AM",
    lng: 45.571111111111115,
    lat: 40.36694444444444
  },
  {
    names: ["باد زکینگین"],
    country: "DE",
    lng: 7.947222222222223,
    lat: 47.55333333333333
  },
  {
    names: ["توم"],
    country: "DE",
    lng: 12.951388888888888,
    lat: 50.67111111111111
  },
  {
    names: ["شوانیدزور", "Շվանիձոր"],
    country: "AM",
    lng: 46.37694444444445,
    lat: 38.94277777777778
  },
  { names: ["گراش"], lng: 54.14, lat: 27.67 },
  {
    names: ["ولفاخ", "Wolfach"],
    country: "DE",
    lng: 8.216666666666667,
    lat: 48.3
  },
  {
    names: ["سبو (شهر)", "سبو"],
    country: "PH",
    lng: 123.9,
    lat: 10.283333333333333
  },
  {
    names: ["آلندورف (لومدا)", "Allendorf"],
    country: "DE",
    lng: 8.824444444444444,
    lat: 50.678888888888885
  },
  { names: ["الجنینه"], country: "SD", lng: 22.45, lat: 13.45 },
  {
    names: ["میلواکی، ویسکانسین", "میلواکی", "Milwaukee"],
    country: "US",
    lng: -87.95583333333333,
    lat: 43.05222222222222
  },
  {
    names: ["ایبلین", "宜宾市"],
    country: "CN",
    lng: 104.61666666666666,
    lat: 28.766666666666666
  },
  {
    names: ["آمیان", "امیان", "Amiens"],
    country: "FR",
    lng: 2.299,
    lat: 49.892
  },
  {
    names: ["هورستل"],
    country: "DE",
    lng: 7.586111111111111,
    lat: 52.29722222222222
  },
  {
    names: ["هوهن‌اشتاین-ارنشتال"],
    country: "DE",
    lng: 12.716666666666667,
    lat: 50.8
  },
  {
    names: ["لیکوود، کلرادو"],
    country: "US",
    lng: -105.10277777777777,
    lat: 39.70638888888889
  },
  {
    names: ["وجوانو", "Vigevano"],
    country: "IT",
    lng: 8.866666666666667,
    lat: 45.31666666666667
  },
  {
    names: ["مخیکالی", "Mexicali"],
    country: "MX",
    lng: -115.46777777777778,
    lat: 32.663333333333334
  },
  {
    names: ["عین البیضاء، الجزایر", "عین البیضاء"],
    country: "DZ",
    lng: 7.383333333333334,
    lat: 35.78333333333333
  },
  {
    names: ["رکه", "Recaș"],
    country: "RO",
    lng: 21.513333333333332,
    lat: 45.80138888888889
  },
  {
    names: ["ژگوف"],
    country: "PL",
    lng: 19.459722222222222,
    lat: 51.66222222222222
  },
  {
    names: ["هالفر"],
    country: "DE",
    lng: 7.466666666666667,
    lat: 51.18333333333333
  },
  { names: ["باد کیسینگن"], country: "DE", lng: 10.066666666666666, lat: 50.2 },
  { names: ["نور آرتیک", "Նոր Արթիկ"], country: "AM", lng: 43.7, lat: 40.45 },
  {
    names: ["چیهیرین", "Chyhyryn", "Чигирин"],
    country: "UA",
    lng: 32.666666666666664,
    lat: 49.083333333333336
  },
  {
    names: ["برشت (رومانی)", "Bereşti"],
    country: "RO",
    lng: 27.883333333333333,
    lat: 46.1
  },
  {
    names: ["خدرانتس", "Խդրանց"],
    country: "AM",
    lng: 46.528888888888886,
    lat: 39.223888888888894
  },
  {
    names: ["واهاگنادزور", "Վահագնաձոր"],
    country: "AM",
    lng: 44.4,
    lat: 41.083333333333336
  },
  {
    names: ["چساپیک، ویرجینیا", "Chesapeake, Virginia"],
    country: "US",
    lng: -76.23833333333333,
    lat: 36.71416666666667
  },
  {
    names: ["بله (رومانی)", "Blaj"],
    country: "RO",
    lng: 23.91444444444444,
    lat: 46.17527777777777
  },
  {
    names: ["وایسنتورم"],
    country: "DE",
    lng: 7.460555555555556,
    lat: 50.41444444444444
  },
  {
    names: ["تاشکند", "Ташке́нт"],
    country: "UZ",
    lng: 69.21666666666667,
    lat: 41.266666666666666
  },
  {
    names: ["سینوپ، ماتو گروسو", "Sinop, Mato Grosso"],
    country: "BR",
    lng: -55.649166666666666,
    lat: -11.848055555555556
  },
  {
    names: ["لاوینگن"],
    country: "DE",
    lng: 10.433333333333334,
    lat: 48.56666666666667
  },
  {
    names: ["آردوی", "Արդվի"],
    country: "AM",
    lng: 44.6,
    lat: 41.016666666666666
  },
  {
    names: ["اوکشبقیا", "Åkersberga"],
    country: "SE",
    lng: 18.3,
    lat: 59.483333333333334
  },
  { names: ["شودت"], country: "DE", lng: 14.266666666666667, lat: 53.05 },
  { names: ["موناکو"], lng: 7.416666666666667, lat: 43.71666666666667 },
  { names: ["الشتربرگ"], country: "DE", lng: 12.166666666666666, lat: 50.6 },
  {
    names: ["لومه", "Ville de Lomé"],
    country: "TG",
    lng: 1.2125,
    lat: 6.137777777777778
  },
  {
    names: ["مکنهایم (راینلند)", "Meckenheim"],
    country: "DE",
    lng: 7.016666666666667,
    lat: 50.63333333333333
  },
  {
    names: ["تلاوی", "თელავი"],
    country: "GE",
    lng: 45.483333333333334,
    lat: 41.916666666666664
  },
  { names: ["اسفراین"], lng: 57.5072, lat: 37.0733 },
  {
    names: ["صالحی (شهر)", "صالحی"],
    country: "TR",
    lng: 28.139166666666664,
    lat: 38.48111111111111
  },
  { names: ["باهاما"], lng: -77.33333333333333, lat: 25.066666666666666 },
  {
    names: ["بیلسک پودلاسکی"],
    country: "PL",
    lng: 23.2,
    lat: 52.766666666666666
  },
  {
    names: ["ژخلین"],
    country: "PL",
    lng: 19.62361111111111,
    lat: 52.24527777777778
  },
  {
    names: ["اولسان", "울산", "蔚山"],
    country: "KR",
    lng: 129.31666666666666,
    lat: 35.55
  },
  {
    names: ["ماین (راینلند-فالتز)"],
    country: "DE",
    lng: 7.216666666666667,
    lat: 50.333333333333336
  },
  {
    names: ["آیبل‌اشتات"],
    country: "DE",
    lng: 10.000930555555556,
    lat: 49.72388055555556
  },
  {
    names: ["غردقه", "الغردقه (عربی)", "al-Ghardaqah"],
    country: "EG",
    lng: 33.81166666666666,
    lat: 27.25777777777778
  },
  {
    names: ["یامپیل", "Yampil", "Ямпіль"],
    country: "UA",
    lng: 28.32,
    lat: 48.35
  },
  { names: ["گرگان", "استر آباد"], lng: 54.48, lat: 36.83 },
  {
    names: ["کولنیو", "Collegno"],
    country: "IT",
    lng: 7.583333333333333,
    lat: 45.083333333333336
  },
  {
    names: ["ارکیپا", "Arequipa, Peru"],
    country: "PE",
    lng: -71.53688333333334,
    lat: -16.398822222222222
  },
  {
    names: ["پیشاور", "پېښور", "پشاور", "پشور"],
    country: "PK",
    lng: 71.58333333333333,
    lat: 34.016666666666666
  },
  {
    names: ["آرتنی", "Արտենի"],
    country: "AM",
    lng: 43.75416666666667,
    lat: 40.29833333333333
  },
  {
    names: ["بایبورد"],
    country: "TR",
    lng: 40.22777777777778,
    lat: 40.25972222222222
  },
  {
    names: ["ولمیراشتت"],
    country: "DE",
    lng: 11.629722222222222,
    lat: 52.25194444444445
  },
  {
    names: ["کوچابامبا"],
    country: "BO",
    lng: -66.16666666666667,
    lat: -17.383333333333333
  },
  {
    names: ["بیشفزهایم آن در رون", "Bischofsheim a.d.Rhön"],
    country: "DE",
    lng: 10.016666666666667,
    lat: 50.4
  },
  { names: ["اردکان"], lng: 54.011197, lat: 32.315283 },
  {
    names: ["تایپه", "臺北", "Taipei"],
    country: "TW",
    lng: 121.63333333333334,
    lat: 25.033333333333335
  },
  {
    names: [
      "کوالا لامپور",
      "قلمروی فدرالی کوالالامپور",
      "Wilayah Persekutuan Kuala Lumpur"
    ],
    country: "MY",
    lng: 101.69333333333334,
    lat: 3.1475
  },
  {
    names: ["باد کروزینگن"],
    country: "DE",
    lng: 7.702500000000001,
    lat: 47.918055555555554
  },
  {
    names: ["ناساو"],
    country: "DE",
    lng: 7.802222222222222,
    lat: 50.31583333333333
  },
  {
    names: ["برواباخ"],
    country: "DE",
    lng: 7.646111111111111,
    lat: 50.27472222222222
  },
  {
    names: ["ویکتوریا (سیشل)", "ویکتوریا", "Victoria"],
    country: "SC",
    lng: 55.45444444444445,
    lat: -4.623611111111112
  },
  {
    names: ["فوز دو لوآچو", "Foz do Iguaçu"],
    country: "BR",
    lng: -54.583333333333336,
    lat: -25.55
  },
  {
    names: ["هوونی", "Հովունի"],
    country: "AM",
    lng: 43.8,
    lat: 40.86666666666667
  },
  {
    names: ["بوراستان", "Բուրաստան"],
    country: "AM",
    lng: 44.5,
    lat: 39.983333333333334
  },
  {
    names: ["ادربرگ (برندنبورگ)"],
    country: "DE",
    lng: 14.05,
    lat: 52.86666666666667
  },
  {
    names: ["شوان (مکلنبورگ-فورپومن)"],
    country: "DE",
    lng: 12.1,
    lat: 53.93333333333333
  },
  {
    names: ["لنتسن (الب)"],
    country: "DE",
    lng: 11.473333333333333,
    lat: 53.09111111111111
  },
  {
    names: ["لیسبون"],
    country: "",
    lng: -9.139444444444443,
    lat: 38.71388888888889
  },
  {
    names: ["آنکونا", "Ancona"],
    country: "IT",
    lng: 13.516666666666667,
    lat: 43.61694444444444
  },
  {
    names: ["ژیلونا گورا", "Zielona Góra"],
    country: "PL",
    lng: 15.5,
    lat: 51.93333333333333
  },
  {
    names: ["لیبانو (تولیما)", "Líbano, Tolima"],
    country: "CO",
    lng: -75.16666666666667,
    lat: 4.916666666666667
  },
  {
    names: ["بارانکیلا"],
    country: "CO",
    lng: -74.79638888888888,
    lat: 10.963888888888889
  },
  {
    names: ["باد گریسباخ در روتتال", "Bad Griesbach i.Rottal"],
    country: "DE",
    lng: 13.2,
    lat: 48.45
  },
  {
    names: ["هورلیفکا", "Horlivka", "Горлівка"],
    country: "UA",
    lng: 38.05,
    lat: 48.3
  },
  {
    names: ["اوشن ساید، کالیفرنیا", "اوشن ساید"],
    country: "US",
    lng: -117.32583333333334,
    lat: 33.211666666666666
  },
  { names: ["آران و بیدگل"], lng: 51.29, lat: 34.04 },
  {
    names: ["آبانکای"],
    country: "PE",
    lng: -72.88333333333334,
    lat: -13.633333333333333
  },
  {
    names: ["کنسپسیون، شیلی", "کُنسپسیون", "Concepción"],
    country: "CL",
    lng: -73.05136944444445,
    lat: -36.82819444444445
  },
  {
    names: ["کونیگزوینتر", "Königswinter"],
    country: "DE",
    lng: 7.1947222222222225,
    lat: 50.67361111111111
  },
  {
    names: ["ویهای", "威海市"],
    country: "CN",
    lng: 122.11666666666666,
    lat: 37.516666666666666
  },
  {
    names: ["اپنهایم", "Oppenheim"],
    country: "DE",
    lng: 8.360277777777778,
    lat: 49.855555555555554
  },
  {
    names: ["اپینگن"],
    country: "DE",
    lng: 8.916666666666666,
    lat: 49.13333333333333
  },
  {
    names: ["جولیت، ایلینوی"],
    country: "US",
    lng: -88.14055555555557,
    lat: 41.5225
  },
  { names: ["پلوتاس"], country: "BR", lng: -52.3425, lat: -31.771944444444443 },
  {
    names: ["فونداسیون (ماگدالنا)", "Fundación"],
    country: "CO",
    lng: 74.18666666666667,
    lat: 10.520555555555557
  },
  {
    names: ["آیبن‌اشتوک"],
    country: "DE",
    lng: 12.5975,
    lat: 50.495555555555555
  },
  {
    names: ["فلتن"],
    country: "DE",
    lng: 13.183333333333334,
    lat: 52.68333333333333
  },
  {
    names: ["ماتزارا دل ولو", "Mazara del Vallo"],
    country: "IT",
    lng: 12.583333333333334,
    lat: 37.65
  },
  {
    names: ["کاشونی", "Քաշունի"],
    country: "AM",
    lng: 46.26166666666666,
    lat: 39.330555555555556
  },
  {
    names: ["هون‌اشتاین (زکزیش. شوایتز)"],
    country: "DE",
    lng: 14.116666666666667,
    lat: 50.983333333333334
  },
  {
    names: ["مارین‌مونستر", "Marienmünster"],
    country: "DE",
    lng: 9.183055555555555,
    lat: 51.81666666666667
  },
  {
    names: ["نوی‌اشتات-گلوه"],
    country: "DE",
    lng: 11.583333333333334,
    lat: 53.36666666666667
  },
  {
    names: ["فرویدن‌اشتات"],
    country: "DE",
    lng: 8.411111111111111,
    lat: 48.46333333333334
  },
  {
    names: ["میوه (رومانی)", "Mioveni"],
    country: "RO",
    lng: 24.940555555555555,
    lat: 44.956944444444446
  },
  {
    names: ["بیلبایو", "(به اسپانیایی: Bilbao)"],
    country: "ES",
    lng: -2.923611111111111,
    lat: 43.25694444444444
  },
  {
    names: ["سورگون", "Sorgun"],
    country: "TR",
    lng: 35.18333333333333,
    lat: 39.81666666666667
  },
  {
    names: ["لانگنزلبولد", "Langenselbold"],
    country: "DE",
    lng: 9.033333333333333,
    lat: 50.18333333333333
  },
  { names: ["چوخوف"], country: "PL", lng: 17.366666666666667, lat: 53.65 },
  { names: ["سنت کیتس و نویس"], lng: -62.733333333333334, lat: 17.3 },
  {
    names: ["لودویگزوبورگ"],
    country: "DE",
    lng: 9.192222222222222,
    lat: 48.8975
  },
  {
    names: ["موهاردت"],
    country: "DE",
    lng: 9.581388888888888,
    lat: 48.980000000000004
  },
  {
    names: ["سانتا روسا ده کابال", "Santa Rosa de Cabal"],
    country: "",
    lng: -75.61666666666666,
    lat: 4.866666666666667
  },
  {
    names: ["خراسان (شهر)", "خراسان"],
    country: "TR",
    lng: 42.17111111111111,
    lat: 40.03972222222222
  },
  {
    names: ["واراتو"],
    country: "TR",
    lng: 41.45416666666667,
    lat: 39.169444444444444
  },
  { names: ["دمین"], country: "DE", lng: 13.043888888888889, lat: 53.905 },
  {
    names: ["کنگل", "Kangal"],
    country: "TR",
    lng: 37.38861111111111,
    lat: 39.236666666666665
  },
  {
    names: ["پارال (ایالت چی‌واوا)", "پارال", "Parral"],
    country: "MX",
    lng: -105.66666666666667,
    lat: 26.933333333333334
  },
  {
    names: ["فلوها"],
    country: "DE",
    lng: 13.071388888888889,
    lat: 50.85583333333334
  },
  { names: ["تاوبات"], country: "BR", lng: -45.55555555555555, lat: -23.025 },
  {
    names: ["فرایبرگ", "Freiberg"],
    country: "DE",
    lng: 13.342777777777778,
    lat: 50.911944444444444
  },
  { names: ["کاگوشیما", "鹿児島"], country: "JP", lng: 130.55, lat: 31.6 },
  {
    names: ["وتر (هسن)", "Wetter (Hessen)"],
    country: "DE",
    lng: 8.716666666666667,
    lat: 50.88333333333333
  },
  {
    names: ["تلتو"],
    country: "DE",
    lng: 13.270555555555557,
    lat: 52.40222222222222
  },
  {
    names: ["بوکارامانگا", "Bucaramanga"],
    country: "CO",
    lng: -73.13333333333334,
    lat: 7.133333333333334
  },
  {
    names: ["آلاخویلا"],
    country: "CR",
    lng: -84.21666666666667,
    lat: 10.016666666666667
  },
  { names: ["راونهایم"], country: "DE", lng: 8.45, lat: 50.016666666666666 },
  { names: ["بولوادین"], country: "TR", lng: 31.05, lat: 38.71666666666667 },
  {
    names: ["گغانیست، آرارات", "گغانیست", "Գեղանիստ"],
    country: "AM",
    lng: 44.43444444444444,
    lat: 40.14972222222222
  },
  {
    names: ["اورزیچه", "Urziceni"],
    country: "RO",
    lng: 26.64527777777778,
    lat: 44.71805555555556
  },
  { names: ["تانتویوک"], country: "MX", lng: -98.23333333333333, lat: 21.35 },
  {
    names: ["کام (اوبرفالتس)", "Cham"],
    country: "DE",
    lng: 12.65,
    lat: 49.21666666666667
  },
  { names: ["زارلوییس"], country: "DE", lng: 6.75, lat: 49.31666666666667 },
  {
    names: ["ایری، پنسیلوانیا"],
    country: "US",
    lng: -80.08521388888889,
    lat: 42.12956111111111
  },
  {
    names: ["یغگنوت، لوری", "یغگنوت", "Եղեգնուտ"],
    country: "AM",
    lng: 44.6325,
    lat: 40.90416666666667
  },
  {
    names: ["آلن (شهر)", "Aalen"],
    country: "DE",
    lng: 10.1,
    lat: 48.833333333333336
  },
  {
    names: ["سالوارد", "Սալվարդ"],
    country: "AM",
    lng: 45.92388888888889,
    lat: 39.464444444444446
  },
  {
    names: ["ژاشکیف", "Zhashkiv", "Жашків"],
    country: "UA",
    lng: 30.111111111111114,
    lat: 49.23583333333333
  },
  {
    names: ["برمن", "Bremen"],
    country: "DE",
    lng: 8.8,
    lat: 53.083333333333336
  },
  {
    names: ["آتن", "Αθήνα"],
    country: "GR",
    lng: 23.727805555555555,
    lat: 37.98397222222222
  },
  {
    names: ["ایشیکلار", "Işıklar"],
    country: "TR",
    lng: 30.733333333333334,
    lat: 38.666666666666664
  },
  {
    names: ["نوریچ", "Norwich"],
    country: "GB",
    lng: -1.2966666666666666,
    lat: 52.62833333333333
  },
  {
    names: ["مارتینیک", "Martinique"],
    country: "FR",
    lng: -61,
    lat: 14.666666666666666
  },
  {
    names: ["کیگالی", "Kigali"],
    country: "RW",
    lng: 30.059444444444445,
    lat: -1.943888888888889
  },
  {
    names: ["ووستر، ماساچوست", "City of Worcester"],
    country: "US",
    lng: -71.8,
    lat: 42.266666666666666
  },
  { names: ["دبی"], country: "AE", lng: 55.333333333333336, lat: 24.95 },
  { names: ["برن (شهر)", "Bern"], lng: 7.26, lat: 46.56 },
  { names: ["دامغان"], lng: 54.348056, lat: 36.168333 },
  { names: ["ابو حمص"], country: "EG", lng: 30.310063, lat: 31.100643 },
  {
    names: ["لوکه", "Luque"],
    country: "PY",
    lng: -57.48722222222222,
    lat: -25.27
  },
  { names: ["کوریتیبا"], country: "BR", lng: -49.25, lat: -25.416666666666668 },
  { names: ["میکولاییف"], country: "UA", lng: 32, lat: 46.96666666666667 },
  {
    names: ["فوکشان", "Focşani"],
    country: "RO",
    lng: 27.179722222222225,
    lat: 45.7
  },
  {
    names: ["زاراشتت"],
    country: "DE",
    lng: 9.860555555555555,
    lat: 52.239444444444445
  },
  {
    names: ["مانیل", "مانیلا", "Lungsod ng Maynila"],
    country: "PH",
    lng: 120.96666666666667,
    lat: 14.583333333333334
  },
  { names: ["میکوووو"], country: "PL", lng: 18.9, lat: 50.166666666666664 },
  {
    names: ["هاگاتنیا", "Hagatna"],
    country: "US",
    lng: 144.75,
    lat: 13.479166666666666
  },
  {
    names: ["کارابرد", "Քարաբերդ"],
    country: "AM",
    lng: 43.82777777777778,
    lat: 40.54361111111111
  },
  {
    names: ["داشت، ارمنستان", "داشت", "Դաշտ"],
    country: "AM",
    lng: 44.301111111111105,
    lat: 40.22805555555556
  },
  {
    names: ["ایجوان", "Իջևան"],
    country: "AM",
    lng: 45.149166666666666,
    lat: 40.87555555555556
  },
  {
    names: ["شاینفلد"],
    country: "DE",
    lng: 10.466666666666667,
    lat: 49.666666666666664
  },
  {
    names: ["آخرن", "Achern"],
    country: "DE",
    lng: 8.066666666666666,
    lat: 48.63333333333333
  },
  { names: ["برودنیتسا"], country: "PL", lng: 19.4, lat: 53.25 },
  { names: ["بیرجند"], lng: 59.21, lat: 32.87 },
  {
    names: ["فجیره", "الفجیره"],
    country: "AE",
    lng: 56.333333333333336,
    lat: 25.266666666666666
  },
  {
    names: ["گرسبرایتنباخ"],
    country: "DE",
    lng: 11.010555555555555,
    lat: 50.58277777777778
  },
  {
    names: ["سابانتا (انتیوکیا)", "Sabaneta, Antioquia"],
    country: "CO",
    lng: -75.6,
    lat: 6.15
  },
  { names: ["تاله"], country: "DE", lng: 11.05, lat: 51.75 },
  {
    names: ["مار دل پلاتا", "Mar del Plata"],
    country: "AR",
    lng: -57.55,
    lat: -38
  },
  {
    names: ["آبن‌برگ", "Abenberg"],
    country: "DE",
    lng: 10.966666666666667,
    lat: 49.25
  },
  {
    names: ["سوچه‌آوا", "سوچاوا", "Suceava"],
    country: "RO",
    lng: 26.255555555555556,
    lat: 47.65138888888889
  },
  {
    names: ["آغنجادزور", "اقنجازور", "Աղնջաձոր"],
    country: "AM",
    lng: 45.2475,
    lat: 39.90222222222222
  },
  {
    names: ["کشان (ترکیه)", "کشان"],
    country: "TR",
    lng: 26.633333333333333,
    lat: 40.85
  },
  {
    names: [
      "لوکزامبورگ (شهر)",
      "شهر لوکزامبورگ",
      "Stad Lëtzebuerg (لوکزامبورگی)",
      "Ville de Luxembourg (فرانسوی)",
      "Stadt Luxemburg (آلمانی )"
    ],
    country: "LU",
    lng: 6.13,
    lat: 49.611666666666665
  },
  {
    names: ["اوزدم (شهر)", "Usedom"],
    country: "DE",
    lng: 13.916666666666666,
    lat: 53.86666666666667
  },
  { names: ["اشرزهاوزن"], country: "DE", lng: 9.65, lat: 51.916666666666664 },
  {
    names: ["وایل شهر"],
    country: "DE",
    lng: 8.870555555555557,
    lat: 48.75083333333333
  },
  {
    names: ["شوالباخ آم تانوس"],
    country: "DE",
    lng: 8.533333333333333,
    lat: 50.15
  },
  {
    names: ["ساروخان، گغارکونیک", "ساروخان", "Սարուխան"],
    country: "AM",
    lng: 45.134166666666665,
    lat: 40.28916666666667
  },
  {
    names: ["اورلینگ‌هاوزن"],
    country: "DE",
    lng: 8.666666666666666,
    lat: 51.96666666666667
  },
  {
    names: ["سیره (رومانی)", "Siret"],
    country: "RO",
    lng: 26.072499999999998,
    lat: 47.95305555555556
  },
  {
    names: ["میدیات"],
    country: "TR",
    lng: 41.36972222222222,
    lat: 37.416666666666664
  },
  {
    names: [
      "بوینوس آیرس",
      "شهر خودمختار بوینوس آیرس",
      "Ciudad Autónoma de Buenos Aires"
    ],
    country: "AR",
    lng: -58.36805555555556,
    lat: -34.60333333333333
  },
  {
    names: ["گرفنبرگ، بایرن", "Gräfenberg"],
    country: "DE",
    lng: 11.25,
    lat: 49.63333333333333
  },
  {
    names: ["فریدبرگ، هسن", "Friedberg"],
    country: "DE",
    lng: 8.75,
    lat: 50.333333333333336
  },
  {
    names: ["چناق‌قلعه"],
    country: "TR",
    lng: 26.41361111111111,
    lat: 40.155833333333334
  },
  {
    names: ["اینگلوود، کالیفرنیا", "اینگل وود", "City of Inglewood"],
    country: "US",
    lng: -118.3461111111111,
    lat: 33.9575
  },
  {
    names: ["باد زالدتفورث"],
    country: "DE",
    lng: 10.009166666666667,
    lat: 52.06527777777777
  },
  {
    names: ["دان (آلمان)"],
    country: "DE",
    lng: 7.779722222222222,
    lat: 49.15138888888889
  },
  {
    names: ["بایاندور", "Բայանդուր"],
    country: "AM",
    lng: 43.77305555555555,
    lat: 40.700833333333335
  },
  {
    names: ["راتسبورگ"],
    country: "DE",
    lng: 10.756666666666666,
    lat: 53.70166666666667
  },
  { names: ["مول‌آکر"], country: "DE", lng: 8.839444444444444, lat: 48.95 },
  {
    names: ["بلموپان", "Belmopán"],
    country: "BZ",
    lng: -88.76666666666667,
    lat: 17.25
  },
  {
    names: ["آپاران", "Ապարան"],
    country: "AM",
    lng: 44.35721388888889,
    lat: 40.58911388888889
  },
  {
    names: ["پوکایپا", "Pucallpa", "May Ushin"],
    country: "PE",
    lng: -74.51666666666667,
    lat: -8.383333333333333
  },
  {
    names: ["خارجه", "الخارجه"],
    country: "EG",
    lng: 30.540000000000003,
    lat: 25.448888888888888
  },
  {
    names: ["آیشتال"],
    country: "DE",
    lng: 9.237222222222222,
    lat: 48.62277777777778
  },
  {
    names: ["ویشهورود", "Вишгород"],
    country: "UA",
    lng: 30.5,
    lat: 50.583333333333336
  },
  {
    names: ["تورین", "Torino", "Turin"],
    country: "IT",
    lng: 7.7,
    lat: 45.06666666666667
  },
  {
    names: ["نانچانگ", "南昌市"],
    country: "CN",
    lng: 115.88333333333334,
    lat: 28.683333333333334
  },
  {
    names: ["شانگهای", "Shanghai", "上海"],
    country: "AM",
    lng: 121.5,
    lat: 31.2
  },
  {
    names: ["لیورنو", "Livorno"],
    country: "IT",
    lng: 10.316666666666666,
    lat: 43.55
  },
  {
    names: ["کششوویتسه", "Krzeszowice, Poland"],
    country: "PL",
    lng: 19.633333333333333,
    lat: 50.13333333333333
  },
  {
    names: ["دانانگ", "Thành phố Đà Nẵng"],
    country: "VN",
    lng: 108.23333333333333,
    lat: 16.066666666666666
  },
  { names: ["زاکسنهایم"], country: "DE", lng: 9.064722222222223, lat: 48.96 },
  {
    names: ["پورت‌لوییس", "پورت لوییس", "Port Louis"],
    country: "MU",
    lng: 57.516666666666666,
    lat: -20.166666666666668
  },
  {
    names: ["زوراکرت", "Զորակերտ"],
    country: "AM",
    lng: 43.65972222222222,
    lat: 41.09277777777778
  },
  {
    names: ["لورکوزن"],
    country: "DE",
    lng: 6.983333333333333,
    lat: 51.03333333333333
  },
  { names: ["دایدزهایم"], country: "DE", lng: 8.186388888888889, lat: 49.4075 },
  {
    names: ["آندرناخ"],
    country: "DE",
    lng: 7.401666666666667,
    lat: 50.439722222222215
  },
  {
    names: ["عشق‌آباد", "Aşgabat/Ашгабат", "Ашхабад"],
    country: "TM",
    lng: 58.36666666666667,
    lat: 37.93333333333333
  },
  {
    names: ["وال‌اشتت", "Wahlstedt"],
    country: "DE",
    lng: 10.216666666666667,
    lat: 53.95
  },
  {
    names: ["آرترن/اوناشتروت"],
    country: "DE",
    lng: 11.290555555555555,
    lat: 51.36472222222223
  },
  {
    names: ["سان میگل د آلنده"],
    country: "MX",
    lng: -100.74361111111111,
    lat: 20.914166666666667
  },
  {
    names: ["کیپ‌تاون", "Kaapstad, iKapa", "Cape Town"],
    country: "ZA",
    lng: 18.42388888888889,
    lat: -33.92527777777777
  },
  {
    names: ["ایمن‌اشتات ایم آلگاو"],
    country: "DE",
    lng: 10.216666666666667,
    lat: 47.56666666666667
  },
  {
    names: ["گونتسن‌هاوزن"],
    country: "DE",
    lng: 10.754166666666666,
    lat: 49.11472222222223
  },
  {
    names: ["موبیل، آلاباما", "Mobile, Alabama"],
    country: "US",
    lng: -88.04305555555555,
    lat: 30.694444444444446
  },
  {
    names: ["د ولی"],
    country: "GB",
    lng: -63.05166666666666,
    lat: 18.22083333333333
  },
  {
    names: ["متس ساریار", "Մեծ Սարիար"],
    country: "AM",
    lng: 43.9525,
    lat: 40.89333333333333
  },
  { names: ["نقده"], lng: 45.3881, lat: 36.9564 },
  {
    names: ["مونتریا", "Montería"],
    country: "CO",
    lng: -75.88333333333334,
    lat: 8.75
  },
  { names: ["برویبرگ"], country: "DE", lng: 9.035, lat: 49.81722222222223 },
  { names: ["نویروپین"], country: "DE", lng: 12.8, lat: 52.933055555555555 },
  { names: ["مکسهوته-هایدهوف"], country: "DE", lng: 12.1, lat: 49.2 },
  {
    names: ["سانتا آنا، کالیفرنیا", "سانتا آنا", "Santa Ana"],
    country: "US",
    lng: -117.88138888888888,
    lat: 33.740833333333335
  },
  { names: ["طنطا"], country: "EG", lng: 31, lat: 30.783333333333335 },
  {
    names: ["آیگوان", "Այգևան"],
    country: "AM",
    lng: 43.96666666666667,
    lat: 40.166666666666664
  },
  { names: ["باد راپنوا"], country: "DE", lng: 9.1, lat: 49.233333333333334 },
  {
    names: ["گوله (شهر)", "گوله"],
    country: "TR",
    lng: 42.60861111111111,
    lat: 40.79277777777778
  },
  { names: ["اصفهان"], lng: 51.65, lat: 32.63 },
  {
    names: ["آپلدا", "Apolda"],
    country: "DE",
    lng: 11.516666666666667,
    lat: 51.016666666666666
  },
  {
    names: ["بودروم"],
    country: "TR",
    lng: 27.433333333333334,
    lat: 37.03333333333333
  },
  {
    names: ["ووپرتال"],
    country: "DE",
    lng: 7.183333333333334,
    lat: 51.266666666666666
  },
  {
    names: ["آولندورف"],
    country: "DE",
    lng: 9.63888888888889,
    lat: 47.95416666666667
  },
  {
    names: ["ژشوف"],
    country: "PL",
    lng: 22.004722222222224,
    lat: 50.03361111111111
  },
  {
    names: ["سیگتونا", "Sigtuna"],
    country: "SE",
    lng: 17.716666666666665,
    lat: 59.61666666666667
  },
  {
    names: ["کالوش، اوکراین", "کالوش", "Калуш"],
    country: "UA",
    lng: 24.359722222222224,
    lat: 49.04416666666666
  },
  {
    names: ["لافایت، لوییزیانا", "Ville de Lafayette"],
    country: "",
    lng: -92.03333333333333,
    lat: 30.216666666666665
  },
  {
    names: ["سیول", "سیول ", "Seoul", "서울시"],
    country: "KR",
    lng: 126.96666666666667,
    lat: 37.56666666666667
  },
  { names: ["اوچامچیرا", "ოჩამჩირე"], country: "GE", lng: 41.45, lat: 42.7 },
  {
    names: ["خاچآغبیور", "Խաչաղբյուր"],
    country: "AM",
    lng: 45.68861111111111,
    lat: 40.17222222222222
  },
  {
    names: ["چولا ویستا، کالیفرنیا", "چولا ویستا"],
    country: "US",
    lng: -117.04805555555555,
    lat: 32.62777777777778
  },
  { names: ["کراچی"], country: "", lng: 67.01, lat: 24.860000000000003 },
  {
    names: [
      "منطقه آنتوفاگاستا",
      "Antofagasta Region",
      "II Región de Antofagasta"
    ],
    country: "CL",
    lng: -70.41083333333334,
    lat: -23.644166666666667
  },
  { names: ["خسروشاه"], lng: 46.1464, lat: 38.0258 },
  {
    names: ["فریدریش‌اشتات"],
    country: "DE",
    lng: 9.066666666666666,
    lat: 54.36666666666667
  },
  {
    names: ["یوکوهاما", "Yokohama", "横浜"],
    country: "JP",
    lng: 139.63805555555555,
    lat: 35.44416666666666
  },
  {
    names: ["تروانرویت"],
    country: "DE",
    lng: 12.583333333333334,
    lat: 47.96666666666667
  },
  {
    names: ["اپاتزینگان"],
    country: "MX",
    lng: -102.35083333333333,
    lat: 19.08861111111111
  },
  {
    names: ["مارالیک", "Մարալիկ (Միկոյան)"],
    country: "AM",
    lng: 43.86694444444444,
    lat: 40.57222222222222
  },
  {
    names: ["مولهایم آن در رور", "Mülheim an der Ruhr"],
    country: "DE",
    lng: 6.883333333333333,
    lat: 51.43333333333333
  },
  { names: ["چاچاپویاس"], country: "PE", lng: -77.85, lat: -6.216666666666667 },
  {
    names: ["امام‌اغلو"],
    country: "TR",
    lng: 35.67283888888888,
    lat: 37.25875
  },
  {
    names: ["ماکاسار", "Kota Makassar"],
    country: "ID",
    lng: 119.41666666666667,
    lat: -5.133333333333334
  },
  {
    names: ["گرول‌اشتاین"],
    country: "DE",
    lng: 6.661388888888889,
    lat: 50.223888888888894
  },
  {
    names: ["ایلزنبرگ"],
    country: "DE",
    lng: 10.683333333333334,
    lat: 51.86666666666667
  },
  { names: ["بیرونگ"], country: "PL", lng: 19.1, lat: 50.13333333333333 },
  {
    names: ["کاراکرت", "Քարակերտ"],
    country: "AM",
    lng: 43.80972222222222,
    lat: 40.24027777777778
  },
  {
    names: ["نیگاوان", "Նիգավան"],
    country: "AM",
    lng: 44.299166666666665,
    lat: 40.62166666666667
  },
  {
    names: ["واهاگنی", "Վահագնի"],
    country: "AM",
    lng: 44.606944444444444,
    lat: 40.908055555555556
  },
  {
    names: ["اوف، ترابزون", "Of"],
    country: "TR",
    lng: 40.26444444444444,
    lat: 40.94499999999999
  },
  {
    names: ["لوشو (وندلند)"],
    country: "DE",
    lng: 11.15,
    lat: 52.96666666666667
  },
  {
    names: ["مولبرگ (الب)", "Mühlberg"],
    country: "DE",
    lng: 13.216666666666667,
    lat: 51.433055555555555
  },
  { names: ["لتسن", "Լծեն"], country: "AM", lng: 46.16, lat: 39.45 },
  {
    names: ["گتاشن، آرماویر", "گتاشن", "Գետաշեն"],
    country: "AM",
    lng: 43.94472222222222,
    lat: 40.04333333333333
  },
  { names: ["اهواز"], lng: 48.65, lat: 31.3 },
  {
    names: ["سنت لوییس، میزوری", "سنت لوییس", "City of St. Louis"],
    country: "US",
    lng: -90.19777777777779,
    lat: 38.62722222222222
  },
  {
    names: ["یوجین، اورگن", "Eugene, Oregon"],
    country: "US",
    lng: -123.08666666666666,
    lat: 44.051944444444445
  },
  {
    names: ["اولیتا، کانزاس", "Olathe, Kansas"],
    country: "US",
    lng: -94.80305555555556,
    lat: 38.880833333333335
  },
  {
    names: ["جرابر", "Ջրաբեր"],
    country: "AM",
    lng: 44.644999999999996,
    lat: 40.35194444444445
  },
  {
    names: ["باتمان", "(به کردی: Êlih)"],
    country: "TR",
    lng: 41.118021,
    lat: 37.929481
  },
  {
    names: ["تبه"],
    country: "SE",
    lng: 18.083333333333332,
    lat: 59.43333333333333
  },
  {
    names: ["هیالیا، فلوریدا", "Hialeah, Florida"],
    country: "US",
    lng: -80.29388888888889,
    lat: 25.860555555555557
  },
  {
    names: ["مالاگا", "(به اسپانیایی: Málaga)"],
    country: "ES",
    lng: -4.42,
    lat: 36.71944444444445
  },
  {
    names: ["هاس‌کوی", "Hasköy", "Խասգեղ"],
    country: "TR",
    lng: 41.68944444444444,
    lat: 38.68222222222222
  },
  {
    names: ["سانتو دومینگو", "Santo Domingo"],
    country: "DO",
    lng: -69.98333333333333,
    lat: 18.5
  },
  {
    names: ["ویکتوریا (سیشل)", "ویکتوریا", "Victoria"],
    country: "SC",
    lng: 55.45444444444445,
    lat: -4.623611111111112
  },
  { names: ["کرپن‌اشتت"], country: "DE", lng: 11.3, lat: 51.916666666666664 },
  {
    names: ["لویترزهاوزن"],
    country: "DE",
    lng: 10.416666666666666,
    lat: 49.28333333333333
  },
  {
    names: ["اشپالت", "Spalt"],
    country: "DE",
    lng: 10.9275,
    lat: 49.17388888888889
  },
  {
    names: ["ووشی", "无锡市"],
    country: "CN",
    lng: 120.3,
    lat: 31.566666666666666
  },
  { names: ["وین", "Wien"], country: "AT", lng: 16.35, lat: 48.2 },
  {
    names: ["فریمانت، کالیفرنیا", "فریمانت", "Fremont"],
    country: "US",
    lng: -121.98861111111111,
    lat: 37.54833333333333
  },
  {
    names: ["لرمانتوفو، ارمنستان", "لرمانتوفو", "Լերմոնտովո"],
    country: "AM",
    lng: 44.63,
    lat: 40.765
  },
  { names: ["لیکسله"], country: "SE", lng: 18.666666666666668, lat: 64.6 },
  {
    names: ["ویلهمسهافن"],
    country: "DE",
    lng: 8.133333333333333,
    lat: 53.516666666666666
  },
  {
    names: ["آخوریک", "Ախուրիկ"],
    country: "AM",
    lng: 43.78333333333333,
    lat: 40.75
  },
  {
    names: ["اوکنله مر", "Ocnele Mari"],
    country: "RO",
    lng: 24.316666666666666,
    lat: 45.083333333333336
  },
  {
    names: ["دیوریغی", "Divriği"],
    country: "TR",
    lng: 38.11666666666667,
    lat: 39.36666666666667
  },
  { names: ["ابهر", "ابَر"], lng: 49.13, lat: 36.08 },
  {
    names: ["پاپن‌هایم"],
    country: "DE",
    lng: 10.974444444444444,
    lat: 48.93472222222222
  },
  {
    names: ["آیدرن"],
    country: "DE",
    lng: 13.167222222222222,
    lat: 50.861666666666665
  },
  {
    names: ["دیان، آراگاتسوتن", "دیان", "Դիան"],
    country: "AM",
    lng: 44.07611111111112,
    lat: 40.35277777777778
  },
  { names: ["فرانکناو"], country: "DE", lng: 8.933333333333334, lat: 51.1 },
  {
    names: ["غورسالی", "Ղուրսալի"],
    country: "AM",
    lng: 44.343611111111116,
    lat: 40.827222222222225
  },
  { names: ["زرند"], lng: 56.58, lat: 30.8 },
  {
    names: ["آراپی", "Առափի"],
    country: "AM",
    lng: 43.800555555555555,
    lat: 40.77972222222222
  },
  {
    names: ["میزا، آریزونا", "Mesa, Arizona"],
    country: "US",
    lng: -111.83138888888888,
    lat: 33.415
  },
  {
    names: ["ژولکفا", "Жовква"],
    country: "UA",
    lng: 23.966666666666665,
    lat: 50.06666666666667
  },
  {
    names: ["زونیهورودکا", "Zvenyhorodka", "Звенигородка"],
    country: "UA",
    lng: 30.967777777777776,
    lat: 49.069722222222225
  },
  {
    names: ["آندورا لاولا", "آندورا لا ولا", "Andorra la Vella"],
    country: "AD",
    lng: 1.5,
    lat: 42.5
  },
  {
    names: ["شناوان، لوری", "شناوان", "Շենավան"],
    country: "AM",
    lng: 44.233333333333334,
    lat: 40.86666666666667
  },
  {
    names: ["هورستمار"],
    country: "DE",
    lng: 7.308333333333334,
    lat: 52.080555555555556
  },
  {
    names: ["ابرباخ (بادن)", "Eberbach"],
    country: "DE",
    lng: 8.983333333333333,
    lat: 49.46666666666667
  },
  {
    names: ["هلم‌اشتات"],
    country: "DE",
    lng: 11.010555555555555,
    lat: 52.22805555555556
  },
  { names: ["مرزیفون"], country: "TR", lng: 35.46333333333334, lat: 40.875 },
  {
    names: ["لودویگزفلده"],
    country: "DE",
    lng: 13.266666666666667,
    lat: 52.29972222222222
  },
  {
    names: ["سان سالوادور", "San Salvador"],
    country: "SV",
    lng: -89.19,
    lat: 13.69
  },
  {
    names: ["هوانگشی", "黄石市"],
    country: "CN",
    lng: 115.08333333333333,
    lat: 30.216666666666665
  },
  {
    names: ["کارچآغبیور", "Կարճաղբյուր"],
    country: "AM",
    lng: 45.57222222222222,
    lat: 40.163888888888884
  },
  {
    names: ["انکارانسیون", "Encarnación"],
    country: "PY",
    lng: -55.88,
    lat: -27.33
  },
  {
    names: ["هزه (شاندونگ)", "Heze", "菏泽市"],
    lng: 115.43333333333334,
    lat: 35.233333333333334
  },
  {
    names: ["الازیغ"],
    country: "TR",
    lng: 39.21666666666667,
    lat: 38.68333333333333
  },
  {
    names: ["شاتین، ارمنستان", "شاتین", "Շատին"],
    country: "AM",
    lng: 45.30166666666666,
    lat: 39.833333333333336
  },
  {
    names: ["سانتاندر ده کیلیچایو (کایوکا)", "Santander de Quilichao"],
    country: "CO",
    lng: -76.32,
    lat: 3.0130555555555554
  },
  {
    names: ["باتال‌قاضی"],
    country: "TR",
    lng: 38.36555555555556,
    lat: 38.422777777777775
  },
  {
    names: ["تولوآ", "Tuluá"],
    country: "CO",
    lng: -76.2,
    lat: 4.083333333333333
  },
  { names: ["چهارباغ (البرز)"], lng: 50.8467, lat: 35.8369 },
  {
    names: ["اسنابروک"],
    country: "DE",
    lng: 8.043055555555556,
    lat: 52.278888888888886
  },
  { names: ["فرخ‌شهر", "قهفرخ"], lng: 50.9822, lat: 32.2728 },
  {
    names: ["تربوفلیا", "Теребовля"],
    country: "UA",
    lng: 25.690277777777776,
    lat: 49.3
  },
  {
    names: ["کن (فرانسه)", "کن", "Cannes"],
    country: "FR",
    lng: 12.5,
    lat: 41.9
  },
  {
    names: ["آکونک، آراگاتسوتن", "آکونک", "Ակունք"],
    country: "AM",
    lng: 43.9,
    lat: 40.416666666666664
  },
  {
    names: ["توماری، روسیه", "Томари"],
    country: "RU",
    lng: 142.06666666666666,
    lat: 47.766666666666666
  },
  { names: ["گرنزهایم"], country: "DE", lng: 8.483333333333333, lat: 49.75 },
  { names: ["فرون‌آباد"], lng: 51, lat: 35 },
  {
    names: ["تسین (بای روستوک)", "Tessin"],
    country: "DE",
    lng: 12.466666666666667,
    lat: 54.016666666666666
  },
  {
    names: ["ارانینبرگ", "Oranienburg"],
    country: "DE",
    lng: 13.236944444444443,
    lat: 52.754444444444445
  },
  {
    names: ["آزاتاموت", "Ազատամուտ"],
    country: "AM",
    lng: 45.198055555555555,
    lat: 40.975833333333334
  },
  {
    names: ["سیمی ولی، کالیفرنیا", "سیمی ولی"],
    country: "US",
    lng: -118.73944444444444,
    lat: 34.27111111111111
  },
  {
    names: ["یاغدان", "Յաղդան"],
    country: "AM",
    lng: 44.50833333333333,
    lat: 41.009166666666665
  },
  {
    names: ["رادولفتسل آم بودن‌زی", "Radolfzell"],
    country: "DE",
    lng: 8.966666666666667,
    lat: 47.733333333333334
  },
  { names: ["مولهاوزن"], country: "DE", lng: 10.45, lat: 51.21666666666667 },
  {
    names: ["پینارحصار"],
    country: "TR",
    lng: 27.51222222222222,
    lat: 41.628055555555555
  },
  {
    names: ["یوسدال", "Ljusdal"],
    country: "SE",
    lng: 16.083333333333332,
    lat: 61.833333333333336
  },
  {
    names: ["بارانکیلا"],
    country: "CO",
    lng: -74.79638888888888,
    lat: 10.963888888888889
  },
  {
    names: ["هیوارد، کالیفرنیا", "هِی‌واُرد", "Hayward"],
    country: "US",
    lng: -122.08083333333333,
    lat: 37.66888888888889
  },
  {
    names: ["سانی‌ویل، کالیفرنیا", "سانی ویل"],
    country: "US",
    lng: -122.0261111111111,
    lat: 37.371944444444445
  },
  {
    names: ["بافلو، نیویورک", "بافلو", "City of Buffalo"],
    country: "US",
    lng: -78.84944444444444,
    lat: 42.90472222222222
  },
  { names: ["پیشوا (شهر)"], lng: 51.9, lat: 35.6 },
  {
    names: ["دیروط", "Dairut"],
    country: "EG",
    lng: 30.816666666666666,
    lat: 27.566666666666666
  },
  {
    names: ["سودتلیا", "Södertälje"],
    country: "SE",
    lng: 17.628055555555555,
    lat: 59.19583333333333
  },
  {
    names: ["کوردوبا، وراکروز"],
    country: "MX",
    lng: -96.93472222222222,
    lat: 18.894166666666667
  },
  {
    names: ["کونگزبککا", "Kungsbacka"],
    country: "SE",
    lng: 12.066666666666666,
    lat: 57.483333333333334
  },
  {
    names: ["سلیشته", "Sălişte"],
    country: "RO",
    lng: 23.886388888888888,
    lat: 45.79416666666666
  },
  {
    names: ["هونیارا", "Honiara"],
    country: "SB",
    lng: 159.81666666666666,
    lat: -9.466666666666667
  },
  {
    names: ["آینتاپ، ارمنستان", "آینتاپ", "Այնթափ"],
    country: "AM",
    lng: 44.46805555555556,
    lat: 40.09861111111111
  },
  {
    names: ["همیلتون (برمودا)", "Hamilton, Bermuda"],
    country: "GB",
    lng: -64.782,
    lat: 32.293
  },
  {
    names: ["وسلبورن"],
    country: "DE",
    lng: 8.916666666666666,
    lat: 54.21666666666667
  },
  {
    names: ["لاودا-کونیگزهوفن"],
    country: "DE",
    lng: 9.703888888888889,
    lat: 49.56861111111112
  },
  {
    names: ["ارزین (شهر)", "ارزین"],
    country: "TR",
    lng: 36.20333333333333,
    lat: 36.95333333333333
  },
  { names: ["کمر (شهر)", "Kemer"], country: "TR", lng: 30.55, lat: 36.6 },
  {
    names: ["رالی، کارولینای شمالی", "رالی", "City of Raleigh"],
    country: "US",
    lng: -78.64472222222223,
    lat: 35.81888888888889
  },
  {
    names: ["مورنو ولی، کالیفرنیا", "City of Moreno Valley"],
    country: "US",
    lng: -117.22833333333334,
    lat: 33.94305555555555
  },
  {
    names: ["شونک، فگتلند", "Schöneck"],
    country: "DE",
    lng: 12.316666666666666,
    lat: 50.36666666666667
  },
  {
    names: ["ماسیس"],
    country: "AM",
    lng: 44.48583333333333,
    lat: 40.013888888888886
  },
  { names: ["والدمونشن"], country: "DE", lng: 12.7, lat: 49.36666666666667 },
  {
    names: ["آیوب"],
    country: "DE",
    lng: 10.065277777777778,
    lat: 49.55277777777778
  },
  {
    names: ["کاچاچکوت", "Կաճաճկուտ"],
    country: "AM",
    lng: 44.6,
    lat: 41.11666666666667
  },
  { names: ["اوشاوا", "Oshawa"], country: "CA", lng: -78.85, lat: 43.9 },
  {
    names: ["لوساغبیور، لوری", "لوساغبیور", "Լուսաղբյուր"],
    country: "AM",
    lng: 44.03055555555555,
    lat: 40.86527777777778
  },
  {
    names: ["کارلس‌بد، کالیفرنیا", "کارلس بد"],
    country: "US",
    lng: -117.29694444444445,
    lat: 33.121944444444445
  },
  {
    names: ["پالرمو", "Palermo"],
    country: "IT",
    lng: 13.366666666666667,
    lat: 38.11666666666667
  },
  {
    names: ["گغارکونیک (روستا)", "گغارکونیک", "Գեղարքունիք"],
    country: "AM",
    lng: 45.14805555555556,
    lat: 40.25111111111111
  },
  { names: ["برازجان", "برازجون"], lng: 51.2053, lat: 29.2622 },
  { names: ["اشتات‌برگن"], country: "DE", lng: 10.85, lat: 48.36666666666667 },
  {
    names: ["وگلبن"],
    country: "DE",
    lng: 11.166666666666666,
    lat: 51.86666666666667
  },
  {
    names: ["ساپورو", "札幌"],
    country: "JP",
    lng: 141.35,
    lat: 43.06666666666667
  },
  {
    names: ["کنستانتسا", "(به رومانیایی: Constanţa)"],
    country: "RO",
    lng: 28.638333333333332,
    lat: 44.17333333333333
  },
  {
    names: ["سالوت", "Սալուտ"],
    country: "AM",
    lng: 43.93333333333333,
    lat: 40.96666666666667
  },
  {
    names: ["کانکورد، کالیفرنیا", "کانکورد"],
    country: "US",
    lng: -122.03111111111112,
    lat: 37.97805555555556
  },
  {
    names: ["قنا (شهر)", "قنا", "Kena"],
    country: "EG",
    lng: 32.71666666666667,
    lat: 26.166666666666668
  },
  {
    names: ["هرنبرگ"],
    country: "DE",
    lng: 8.870833333333334,
    lat: 48.59666666666667
  },
  {
    names: ["کوشیرو، هوکایدو", "Kushiro", "釧路"],
    country: "JP",
    lng: 144.38333333333333,
    lat: 42.983333333333334
  },
  {
    names: ["باغچه، عثمانیه", "باهچه"],
    country: "TR",
    lng: 36.583333333333336,
    lat: 37.2
  },
  {
    names: ["کرنسبش", "Caransebeș"],
    country: "RO",
    lng: 22.221944444444443,
    lat: 45.421388888888885
  },
  { names: ["رودهن"], lng: 51.9119, lat: 35.7389 },
  {
    names: ["نووودنیستروفسک", "Novodnistrovsk", "Новодністровськ"],
    country: "UA",
    lng: 27.441388888888888,
    lat: 48.57777777777778
  },
  {
    names: ["وارن، میشیگان", "Warren, Michigan"],
    country: "US",
    lng: -83.02388888888889,
    lat: 42.49194444444444
  },
  {
    names: ["سوپوت", "Sopot"],
    country: "PL",
    lng: 18.55,
    lat: 54.43333333333333
  },
  {
    names: ["هاتسیک، آرماویر", "هاتسیک", "Հացիկ"],
    country: "AM",
    lng: 43.94083333333333,
    lat: 40.16416666666667
  },
  {
    names: ["کروتون", "Crotone"],
    country: "IT",
    lng: 17.116666666666667,
    lat: 39.083333333333336
  },
  {
    names: ["لگنیتسا", "Legnica"],
    country: "PL",
    lng: 16.166666666666668,
    lat: 51.21666666666667
  },
  {
    names: ["لانجیک", "Լանջիկ"],
    country: "AM",
    lng: 43.85638888888889,
    lat: 40.50944444444445
  },
  { names: ["الشتر", "قلا"], lng: 48.25, lat: 33.87 },
  { names: ["جزایر فارو"], lng: -6.783333333333333, lat: 62 },
  {
    names: ["ساواش‌تپه"],
    country: "TR",
    lng: 27.654722222222222,
    lat: 39.38388888888889
  },
  {
    names: ["وارداشات", "Վարդաշատ"],
    country: "AM",
    lng: 45.02611111111111,
    lat: 39.83277777777778
  },
  {
    names: ["گیورگسمارینهوته"],
    country: "DE",
    lng: 8.066666666666666,
    lat: 52.2
  },
  {
    names: ["پیورا", "Piura"],
    country: "PE",
    lng: -80.63333333333334,
    lat: -5.2
  },
  {
    names: ["هیلپولت‌اشتاین"],
    country: "DE",
    lng: 11.183333333333334,
    lat: 49.18333333333333
  },
  {
    names: ["کمنیتس"],
    country: "DE",
    lng: 12.916666666666666,
    lat: 50.833333333333336
  },
  {
    names: ["آفراگولا"],
    country: "IT",
    lng: 14.316666666666666,
    lat: 40.916666666666664
  },
  {
    names: ["استرهولز-شارمبرک", "Osterholz-Scharmbeck"],
    country: "DE",
    lng: 8.8,
    lat: 53.21666666666667
  },
  { names: ["الدویم"], country: "SD", lng: 32.31666666666667, lat: 14 },
  {
    names: ["جنرال اسکبدو"],
    country: "MX",
    lng: -100.15833333333335,
    lat: 25.793333333333337
  },
  {
    names: ["کرپه (اشتاینبرگ)", "Krempe"],
    country: "DE",
    lng: 9.466666666666667,
    lat: 53.81666666666667
  },
  { names: ["دره‌شهر", "(دری شر)"], lng: 47.22, lat: 33.08 },
  {
    names: ["لیپوه، آراد", "Lipova"],
    country: "RO",
    lng: 21.691666666666666,
    lat: 46.09166666666667
  },
  { names: ["ایزنیک", "İznik"], country: "TR", lng: 29.7195, lat: 40.429 },
  {
    names: ["لاذقیه", "اللَاذِقِیَّه"],
    country: "SY",
    lng: 35.78333333333333,
    lat: 35.516666666666666
  },
  { names: ["پاکدشت"], lng: 51.6744, lat: 35.4728 },
  {
    names: ["لوییویل، کنتاکی", "لوییویل"],
    country: "US",
    lng: -85.76666666666667,
    lat: 38.25
  },
  {
    names: ["نصیبین", "ܢܨܝܝ̣ܒ݂ܝ̣ܢ Nṣībīn نصیبین"],
    country: "TR",
    lng: 41.215694444444445,
    lat: 37.07533333333334
  },
  {
    names: ["کوروسال (سوکره)", "Corozal, Sucre"],
    country: "CO",
    lng: -75.29583333333333,
    lat: 9.317777777777778
  },
  {
    names: ["ایزیوم", "Izium", "Ізюм"],
    country: "UA",
    lng: 37.25694444444444,
    lat: 49.21277777777778
  },
  {
    names: ["اوکانیا (نورته ده سانتاندر)", "Ocaña, Norte de Santander"],
    country: "CO",
    lng: -73.35,
    lat: 8.233333333333333
  },
  {
    names: ["پاگو پاگو"],
    country: "US",
    lng: -170.70055555555555,
    lat: -14.279444444444445
  },
  {
    names: ["هورن-باد ماینبرگ"],
    country: "DE",
    lng: 8.966666666666667,
    lat: 51.88333333333333
  },
  { names: ["نوا (رومانی)", "Novaci"], country: "RO", lng: 23.67, lat: 45.18 },
  {
    names: ["یارن", "Yaren"],
    country: "NR",
    lng: 166.92083333333332,
    lat: -0.5477777777777778
  },
  {
    names: ["متساوان", "Մեծավան"],
    country: "AM",
    lng: 44.22888888888889,
    lat: 41.20166666666667
  },
  { names: ["ساری"], lng: 53.059999999999995, lat: 36.56333333333333 },
  {
    names: ["تشه (رومانی)", "Tășnad", "Tasnád"],
    country: "RO",
    lng: 22.583888888888886,
    lat: 47.477222222222224
  },
  {
    names: ["وینتیان", "ວຽງຈັນ", "Vientiane"],
    country: "LA",
    lng: 102.6,
    lat: 17.966666666666665
  },
  {
    names: ["وارداهوویت", "Վարդահովիտ"],
    country: "AM",
    lng: 45.48361111111111,
    lat: 39.89861111111111
  },
  {
    names: ["برداشن", "Բերդաշեն"],
    country: "AM",
    lng: 43.66888888888889,
    lat: 41.05361111111111
  },
  { names: ["گریت ویکن"], country: "GB", lng: -36.508, lat: -54.2815 },
  {
    names: ["ادینبرا", "Edinburgh", "Dùn Èideann"],
    country: "GB",
    lng: -3.2,
    lat: 55.95
  },
  {
    names: ["کوپیاپو", "Copiapó"],
    country: "CL",
    lng: -70.33305555555555,
    lat: -27.366388888888892
  },
  { names: ["باد ووننبرگ"], country: "DE", lng: 8.7, lat: 51.516666666666666 },
  {
    names: ["تکیرگیول", "Techirghiol"],
    country: "RO",
    lng: 28.59583333333333,
    lat: 44.0575
  },
  {
    names: ["دیتاک (روستا)", "دیتاک", "Դիտակ"],
    country: "AM",
    lng: 44.51861111111111,
    lat: 40.04527777777778
  },
  {
    names: ["چالدران، وان"],
    country: "TR",
    lng: 43.913888888888884,
    lat: 39.14194444444444
  },
  {
    names: ["آزاتک", "آزاتِک", "Ազատեկ"],
    country: "AM",
    lng: 45.43833333333333,
    lat: 39.65
  },
  { names: ["آیگاباتس", "Այգաբաց"], country: "AM", lng: 43.9, lat: 40.7 },
  { names: ["بندرعباس"], lng: 56.2766, lat: 27.1883 },
  { names: ["بجنورد"], lng: 57.3143, lat: 37.4702 },
  { names: ["راور"], lng: 56.8147, lat: 31.2722 },
  { names: ["قره‌ضیاءالدین"], lng: 45.03, lat: 38.88 },
  {
    names: ["کابو سن لوکاس"],
    country: "MX",
    lng: -109.91555555555556,
    lat: 22.889722222222222
  },
  {
    names: ["تساتر", "Ծաթեր"],
    country: "AM",
    lng: 44.629444444444445,
    lat: 40.96055555555556
  },
  {
    names: ["ترنوپیل", "Тернопіль"],
    country: "UA",
    lng: 25.6,
    lat: 49.56666666666667
  },
  {
    names: ["خارکیف", "خارکیف (خارکوف)", "Харків"],
    country: "UA",
    lng: 36.31666666666667,
    lat: 49.916666666666664
  },
  {
    names: ["فونسا", "Funza"],
    country: "CO",
    lng: -74.21666666666667,
    lat: 4.716666666666667
  },
  { names: ["روتس"], country: "DE", lng: 12.516666666666667, lat: 49.35 },
  { names: ["ویلتن"], country: "DE", lng: 14.4, lat: 51.1 },
  {
    names: ["بیله‌فلد", "Bielefeld"],
    country: "DE",
    lng: 8.516666666666667,
    lat: 52.016666666666666
  },
  {
    names: ["لچاوان", "Լճավան"],
    country: "AM",
    lng: 45.614444444444445,
    lat: 40.151944444444446
  },
  {
    names: ["سانتا فه، آرژانتین", "سانتا فه", "Santa Fe"],
    country: "AR",
    lng: -60.7,
    lat: -31.633333333333333
  },
  {
    names: ["تورین", "Torino", "Turin"],
    country: "IT",
    lng: 7.7,
    lat: 45.06666666666667
  },
  { names: ["گتوند", "گتند"], lng: 48.8128, lat: 32.2436 },
  {
    names: ["کانکورد، کالیفرنیا", "کانکورد"],
    country: "US",
    lng: -122.03111111111112,
    lat: 37.97805555555556
  },
  {
    names: ["نیس", "Nice"],
    country: "FR",
    lng: 7.266388888888889,
    lat: 43.70333333333333
  },
  {
    names: ["کاختا"],
    country: "TR",
    lng: 38.62166666666667,
    lat: 37.780277777777776
  },
  { names: ["اینورنس", "Inbhir Nis"], country: "GB", lng: -4, lat: 57 },
  { names: ["شایبنبرگ"], country: "DE", lng: 12.9125, lat: 50.54083333333333 },
  {
    names: ["آرتاشار", "Արտաշար"],
    country: "AM",
    lng: 44.18111111111111,
    lat: 40.10916666666667
  },
  {
    names: ["بکسباخ"],
    country: "DE",
    lng: 7.259444444444444,
    lat: 49.349444444444444
  },
  { names: ["بندر دیلم"], lng: 50.165, lat: 30.054 },
  {
    names: ["گوراوان، آرارات", "Գոռավան"],
    country: "AM",
    lng: 44.733333333333334,
    lat: 39.9
  },
  { names: ["لوین"], country: "DE", lng: 8.366666666666667, lat: 50.55 },
  { names: ["بیر العبد"], country: "EG", lng: 33.011111, lat: 31.018056 },
  {
    names: ["پورتو پرنس", "Ville de Port-au-Prince"],
    country: "HT",
    lng: -72.33333333333333,
    lat: 18.533333333333335
  },
  {
    names: ["پینجین", "盘锦市"],
    country: "CN",
    lng: 122.05,
    lat: 41.11666666666667
  },
  {
    names: ["تورکو", "Turku"],
    country: "AM",
    lng: 22.266666666666666,
    lat: 60.45
  },
  { names: ["سورینام"], lng: -55.166666666666664, lat: 5.833333333333333 },
  {
    names: ["شنوغ", "Շնող"],
    country: "AM",
    lng: 44.83777777777778,
    lat: 41.147777777777776
  },
  {
    names: ["میدلند، تگزاس", "Midland, Texas"],
    country: "US",
    lng: -102.1,
    lat: 32
  },
  {
    names: ["کاوا د تیرنی", "Cava de’ Tirreni"],
    country: "IT",
    lng: 14.7,
    lat: 40.7
  },
  {
    names: ["شبین الکوم", "Shibin El Kom"],
    country: "EG",
    lng: 31.01,
    lat: 30.558611111111112
  },
  {
    names: ["اورت، واشینگتن", "اورت", "City of Everett"],
    country: "US",
    lng: -122.20055555555555,
    lat: 47.96333333333334
  },
  {
    names: ["نیشاوا"],
    country: "PL",
    lng: 18.90138888888889,
    lat: 52.836666666666666
  },
  {
    names: ["آخلاتیان", "Ախլաթյան"],
    country: "AM",
    lng: 46.03527777777778,
    lat: 39.44222222222222
  },
  {
    names: ["لودویگسهافن", "Ludwigshafen am Rhein"],
    country: "DE",
    lng: 8.435277777777777,
    lat: 49.48111111111111
  },
  {
    names: ["سانتا روزا، کالیفرنیا", "سانتا روزا"],
    country: "US",
    lng: -122.70472222222223,
    lat: 38.448611111111106
  },
  {
    names: ["اوکسن‌هاوزن"],
    country: "DE",
    lng: 9.948055555555555,
    lat: 48.07222222222222
  },
  {
    names: ["باد ویمپن"],
    country: "DE",
    lng: 9.166666666666666,
    lat: 49.233333333333334
  },
  { names: ["شته (رومانی)", "Ștei"], country: "RO", lng: 22.47, lat: 46.54 },
  {
    names: ["کلمبوس، جورجیا", "Columbus"],
    country: "US",
    lng: -84.94027777777778,
    lat: 32.492222222222225
  },
  { names: ["لار"], lng: 54.28, lat: 27.68 },
  {
    names: ["سانتیاگو دل استرو", "Santiago del Estero"],
    country: "AR",
    lng: -64.26666666666667,
    lat: -27.783333333333335
  },
  {
    names: ["گوایماس", "Heróica Ciudad de Guaymas"],
    country: "MX",
    lng: -110.89888888888889,
    lat: 27.918333333333333
  },
  {
    names: ["هولمسوند", "Holmsund"],
    country: "SE",
    lng: 20.369444444444444,
    lat: 63.708333333333336
  },
  { names: ["ژوفتی وودی", "Жовті Води"], country: "UA", lng: 33.5, lat: 48.35 },
  {
    names: ["ماکیییفکا", "Makiivka", "Макіївка"],
    country: "UA",
    lng: 38.06666666666667,
    lat: 48.083333333333336
  },
  { names: ["ویتموند"], country: "DE", lng: 7.780833333333334, lat: 53.575 },
  {
    names: ["مایاکوفسکی، ارمنستان", "مایاکوفسکی", "Մայակովսկի"],
    country: "AM",
    lng: 44.638333333333335,
    lat: 40.25222222222222
  },
  {
    names: ["ریدلینگن"],
    country: "DE",
    lng: 9.472777777777777,
    lat: 48.155277777777776
  },
  { names: ["قامشلی"], country: "SY", lng: 41.21666666666667, lat: 37.05 },
  {
    names: ["برنکسل-کویز"],
    country: "DE",
    lng: 7.069444444444445,
    lat: 49.91611111111111
  },
  {
    names: ["باد بلتسیگ"],
    country: "DE",
    lng: 12.595555555555556,
    lat: 52.14222222222222
  },
  {
    names: ["پالمیرا (واییه دل کایوکا)", "Palmira"],
    country: "",
    lng: -76.25,
    lat: 3.5833333333333335
  },
  {
    names: ["لیدشوپینگ", "Lidköping"],
    country: "SE",
    lng: 13.183333333333334,
    lat: 58.5
  },
  { names: ["کسلا"], country: "SD", lng: 36.4, lat: 15.45 },
  {
    names: ["ارموسییو، سونورا", "ارموسییو", "Hermosillo"],
    country: "MX",
    lng: -110.95416666666667,
    lat: 29.098888888888887
  },
  { names: ["اولده"], country: "DE", lng: 8.15, lat: 51.833333333333336 },
  {
    names: ["پروومایسکیی", "Pervomaiskyi", "Первомайський"],
    country: "UA",
    lng: 36.21416666666667,
    lat: 49.386944444444445
  },
  {
    names: ["گدرن"],
    country: "DE",
    lng: 9.199722222222222,
    lat: 50.42444444444444
  },
  {
    names: ["روتنبورگ آن در فولدا", "Rotenburg a.d. Fulda"],
    country: "DE",
    lng: 9.727777777777778,
    lat: 50.99611111111111
  },
  {
    names: ["اشوینواویشچه"],
    country: "PL",
    lng: 14.25,
    lat: 53.916666666666664
  },
  {
    names: ["ویلدنفلدز"],
    country: "DE",
    lng: 12.582777777777778,
    lat: 50.6575
  },
  {
    names: ["بمبیی", "مومبای", "मुंबई"],
    country: "IN",
    lng: 72.82583333333334,
    lat: 18.974999999999998
  },
  {
    names: ["سان‌فرانسیسکو"],
    country: "US",
    lng: -122.4192,
    lat: 37.77833333333333
  },
  {
    names: ["بودلزدورف"],
    country: "DE",
    lng: 9.683333333333334,
    lat: 54.31666666666667
  },
  {
    names: ["قاقورتوق", "یولیانه‌هوب"],
    country: "GL",
    lng: -46.040277777777774,
    lat: 60.72222222222222
  },
  {
    names: ["آراگیوغ", "Արագյուղ"],
    country: "AM",
    lng: 44.54361111111111,
    lat: 40.402499999999996
  },
  {
    names: ["سیلوپی"],
    country: "TR",
    lng: 42.483333333333334,
    lat: 37.266666666666666
  },
  {
    names: ["ریوبامبا"],
    country: "EC",
    lng: -78.64829444444445,
    lat: -1.674347222222222
  },
  {
    names: ["تساغکادزور", "Ծաղկաձոր"],
    country: "AM",
    lng: 44.725,
    lat: 40.53138888888889
  },
  { names: ["بوزیش", "Buziaș"], country: "RO", lng: 21.6, lat: 45.65 },
  { names: ["گرشنهاین"], country: "DE", lng: 13.55, lat: 51.28333333333333 },
  {
    names: ["سودرشوپینگ", "Söderköping"],
    country: "SE",
    lng: 16.316666666666666,
    lat: 58.483333333333334
  },
  {
    names: ["تل الکبیر"],
    country: "EG",
    lng: 31.778055555555554,
    lat: 30.545555555555556
  },
  {
    names: ["ناپل", "Napoli", "Naples"],
    country: "IT",
    lng: 14.25,
    lat: 40.833333333333336
  },
  {
    names: ["لاهیجان", "لاجون"],
    country: "IR",
    lng: 50.00388888888889,
    lat: 37.20722222222223
  },
  {
    names: ["آلفلد"],
    country: "DE",
    lng: 9.826944444444445,
    lat: 51.98861111111111
  },
  {
    names: ["اکرنفورده"],
    country: "DE",
    lng: 9.837777777777779,
    lat: 54.47416666666667
  },
  { names: ["چاجوا", "滁州市"], lng: 118.3, lat: 32.3 },
  {
    names: ["بیشکک", "بیشکک (فرونزه)", "Бишкек"],
    country: "KG",
    lng: 74.61222222222221,
    lat: 42.874722222222225
  },
  {
    names: ["نویکالن"],
    country: "DE",
    lng: 12.783333333333333,
    lat: 53.81666666666667
  },
  {
    names: ["لیکوود، کلرادو"],
    country: "US",
    lng: -105.10277777777777,
    lat: 39.70638888888889
  },
  {
    names: ["آیگشات، آرماویر", "آیگشات", "Այգեշատ"],
    country: "AM",
    lng: 44.06666666666667,
    lat: 40.06666666666667
  },
  {
    names: ["تان (رون)", "Tann (Rhön)"],
    country: "DE",
    lng: 10.016666666666667,
    lat: 50.65
  },
  {
    names: ["ساکرامنتو، کالیفرنیا", "ساکرامنتو"],
    country: "US",
    lng: -121.46888888888888,
    lat: 38.55555555555555
  },
  { names: ["هاییتی"], lng: -61.233333333333334, lat: 1.1666666666666667 },
  {
    names: ["اشترنبرگ (مکلنبورگ)", "Sternberg"],
    country: "DE",
    lng: 11.816666666666666,
    lat: 53.7
  },
  {
    names: ["سان خوآن، آرژانتین", "سان خوآن", "San Juan"],
    country: "AR",
    lng: -68.5261111111111,
    lat: -31.534166666666668
  },
  {
    names: ["مانایوس", "Manaus"],
    country: "BR",
    lng: -60.016666666666666,
    lat: -3.1
  },
  {
    names: ["آپارتادو", "Apartadó"],
    country: "CO",
    lng: -76.63333333333334,
    lat: 7.883333333333333
  },
  {
    names: ["کارگی‌پیناری", "Kargıpınarı", "(Gilindire)"],
    country: "TR",
    lng: 34.416666666666664,
    lat: 36.666666666666664
  },
  {
    names: ["بیکوی", "Băicoi"],
    country: "RO",
    lng: 25.865833333333335,
    lat: 45.04527777777778
  },
  {
    names: ["توماکو", "San Andrés de Tumaco"],
    country: "CO",
    lng: -78.76472222222222,
    lat: 1.8066666666666666
  },
  {
    names: ["آرتیک", "Արթիկ"],
    country: "AM",
    lng: 43.975833333333334,
    lat: 40.617222222222225
  },
  {
    names: ["کاونتری", "City of Coventry"],
    country: "GB",
    lng: -1.5105555555555557,
    lat: 52.408055555555556
  },
  {
    names: ["اولیتا، کانزاس", "Olathe, Kansas"],
    country: "US",
    lng: -94.80305555555556,
    lat: 38.880833333333335
  },
  {
    names: ["آرگنادم", "Արեգնադեմ"],
    country: "AM",
    lng: 43.74916666666667,
    lat: 40.92861111111111
  },
  {
    names: ["ام روابه"],
    country: "SD",
    lng: 31.207866666666664,
    lat: 12.904558333333334
  },
  {
    names: ["آلن‌تاون، پنسیلوانیا"],
    country: "US",
    lng: -75.47722222222222,
    lat: 40.60166666666667
  },
  {
    names: ["تیمیشوارا", "(به رومانیایی: Timişoara)"],
    country: "RO",
    lng: 21.229999999999997,
    lat: 45.75972222222222
  },
  {
    names: ["ورین شورژا", "Վերին Շորժա"],
    country: "AM",
    lng: 45.80027777777777,
    lat: 40.09666666666667
  },
  {
    names: ["وینزن (لوهه)", "Winsen"],
    country: "DE",
    lng: 10.216666666666667,
    lat: 53.36666666666667
  },
  {
    names: ["باد رایشنهال"],
    country: "DE",
    lng: 12.876944444444446,
    lat: 47.724722222222226
  },
  {
    names: ["اشتراوبینگ"],
    country: "DE",
    lng: 12.566666666666666,
    lat: 48.88333333333333
  },
  {
    names: ["کاتانیا", "Catania", "Katáni"],
    country: "IT",
    lng: 15.083333333333334,
    lat: 37.5
  },
  {
    names: ["پورتو ولیو"],
    country: "BR",
    lng: -63.903888888888886,
    lat: -8.761944444444444
  },
  {
    names: ["ارویته", "Erwitte"],
    country: "DE",
    lng: 8.35,
    lat: 51.61666666666667
  },
  {
    names: ["کاردیف", "Dinas a Sir Caerdydd", "Cardiff"],
    country: "GB",
    lng: -3.183333333333333,
    lat: 51.483333333333334
  },
  {
    names: ["بتیم", "Betim"],
    country: "BR",
    lng: -44.19777777777777,
    lat: -19.967777777777776
  },
  {
    names: ["آیاکوچو", "Huamanga"],
    country: "PE",
    lng: -74.22444444444444,
    lat: -13.163055555555555
  },
  { names: ["بندر کنگان", "کنگون"], lng: 52.0594, lat: 27.8353 },
  {
    names: ["دروژکیفکا", "Druzhkivka", "Дружківка"],
    country: "UA",
    lng: 37.52777777777778,
    lat: 48.62138888888889
  },
  {
    names: ["کارمن ده بولیوار", "El Carmen de Bolívar"],
    country: "CO",
    lng: -75.13333333333334,
    lat: 9.716666666666667
  },
  {
    names: ["وایزماین"],
    country: "DE",
    lng: 11.216666666666667,
    lat: 50.06666666666667
  },
  {
    names: ["شانتو", "汕头市"],
    country: "CN",
    lng: 116.66666666666667,
    lat: 23.35
  },
  {
    names: ["مودانجیانگ", "牡丹江市"],
    country: "CN",
    lng: 129.63333333333333,
    lat: 44.55
  },
  {
    names: ["سولاک، ارمنستان", "سولاک", "Սոլակ"],
    country: "AM",
    lng: 44.70861111111111,
    lat: 40.46361111111111
  },
  {
    names: ["پیوترکوف کویافسکی"],
    country: "PL",
    lng: 18.500833333333333,
    lat: 52.54694444444444
  },
  {
    names: ["آنتراتسیت", "Antratsyt", "Антрацит"],
    country: "UA",
    lng: 39.09,
    lat: 48.119166666666665
  },
  {
    names: ["اولان‌باتور", "(الفبای سیریلیک:Улаанбаатар)"],
    country: "MN",
    lng: 106.91666666666667,
    lat: 47.916666666666664
  },
  {
    names: ["کویابا", "Cuiabá"],
    country: "BR",
    lng: -56.096944444444446,
    lat: -15.595833333333333
  },
  {
    names: ["هولوداو", "葫芦岛市"],
    country: "CN",
    lng: 120.83333333333333,
    lat: 40.71666666666667
  },
  {
    names: ["پونتا گروسا"],
    country: "BR",
    lng: -49.25,
    lat: -25.416666666666668
  },
  {
    names: ["پالم بی، فلوریدا", "Palm Bay"],
    country: "US",
    lng: -80.67000833333334,
    lat: 27.997922222222222
  },
  {
    names: ["بانکرید", "Bankeryd"],
    country: "SE",
    lng: 14.116666666666667,
    lat: 57.85
  },
  {
    names: ["ویل", "Wiehl"],
    country: "DE",
    lng: 7.533333333333333,
    lat: 50.95
  },
  {
    names: ["درنده (شهر)", "درنده"],
    country: "TR",
    lng: 37.51111111111111,
    lat: 38.54722222222222
  },
  {
    names: ["مورفریزبورو، تنسی"],
    country: "US",
    lng: -86.39194444444445,
    lat: 35.846111111111114
  },
  {
    names: ["رمزک آم نکا"],
    country: "DE",
    lng: 9.27638888888889,
    lat: 48.86888888888889
  },
  { names: ["رندزبرگ"], country: "DE", lng: 9.666666666666666, lat: 54.3 },
  {
    names: ["آروادا، کلرادو"],
    country: "US",
    lng: -105.1111111111111,
    lat: 39.82
  },
  {
    names: ["تیخوانا", "Tijuana"],
    country: "MX",
    lng: -117.03333333333333,
    lat: 32.525
  },
  {
    names: ["وله لویی میهی", "Valea lui Mihai", "Érmihályfalva"],
    country: "RO",
    lng: 22.13,
    lat: 47.519999999999996
  },
  {
    names: ["منشاه", "Ptolemais Hermiou"],
    country: "EG",
    lng: 31.8,
    lat: 26.483333333333334
  },
  {
    names: ["کلیمانشت-کچولت", "Călimănești"],
    country: "RO",
    lng: 24.343333333333334,
    lat: 45.23916666666667
  },
  {
    names: ["کراکوف"],
    country: "PL",
    lng: 19.933333333333334,
    lat: 50.06666666666667
  },
  {
    names: ["نوراشنیک", "Նորաշենիկ"],
    country: "AM",
    lng: 46.39083333333333,
    lat: 39.2675
  },
  {
    names: ["نیدگن", "Nideggen"],
    country: "DE",
    lng: 6.483333333333333,
    lat: 50.7
  },
  {
    names: ["پومتزیا", "Pomezia"],
    country: "IT",
    lng: 12.5,
    lat: 41.68333333333333
  },
  {
    names: ["چیکینکیرا", "Chiquinquirá"],
    country: "CO",
    lng: -73.82,
    lat: 5.61888888888889
  },
  {
    names: ["اوده‌میش"],
    country: "TR",
    lng: 27.971944444444443,
    lat: 38.23111111111111
  },
  {
    names: ["آلماتی", "Алматы"],
    country: "KZ",
    lng: 76.89583333333334,
    lat: 43.277499999999996
  },
  { names: ["سوهاج"], country: "EG", lng: 31.7, lat: 26.55 },
  { names: ["کخلفتیا", "Skellefteå"], country: "SE", lng: 20.95, lat: 64.75 },
  {
    names: ["تویبلیتز"],
    country: "DE",
    lng: 12.085277777777778,
    lat: 49.22083333333334
  },
  {
    names: ["آراگاتس، آرماویر", "آراگاتس", "Արագած"],
    country: "AM",
    lng: 44.23277777777778,
    lat: 40.218333333333334
  },
  {
    names: ["باد امس"],
    country: "DE",
    lng: 7.710555555555556,
    lat: 50.338055555555556
  },
  {
    names: ["سنت لوییس، میزوری", "سنت لوییس", "City of St. Louis"],
    country: "US",
    lng: -90.19777777777779,
    lat: 38.62722222222222
  },
  {
    names: ["خلفتی"],
    country: "TR",
    lng: 37.865833333333335,
    lat: 37.24888888888889
  },
  {
    names: ["ترویتسک، اوبلاست چلیابینسک", "Троицк"],
    country: "RU",
    lng: 61.56666666666667,
    lat: 54.083333333333336
  },
  {
    names: ["کلمبوس، اوهایو", "کلمبوس", "City of Columbus"],
    country: "US",
    lng: -82.98333333333333,
    lat: 39.983333333333334
  },
  {
    names: ["پرنتسلاو"],
    country: "DE",
    lng: 13.866666666666667,
    lat: 53.31666666666667
  },
  {
    names: ["عاشر من رمضان", "مدینه العاشر من رمضان"],
    country: "EG",
    lng: 31.366666666666667,
    lat: 30.05
  },
  {
    names: ["وارندورف", "Warendorf"],
    country: "DE",
    lng: 7.993333333333333,
    lat: 51.95388888888889
  },
  {
    names: ["نازکا"],
    country: "PE",
    lng: -74.94361111111111,
    lat: -14.828888888888889
  },
  {
    names: ["کاناکراوان", "Քանաքեռավան"],
    country: "AM",
    lng: 44.53666666666666,
    lat: 40.24722222222222
  },
  { names: ["روسلزهایم"], country: "DE", lng: 8.433333333333334, lat: 50 },
  {
    names: ["ساپورو", "札幌"],
    country: "JP",
    lng: 141.35,
    lat: 43.06666666666667
  },
  { names: ["بلیز"], lng: -88.76666666666667, lat: 17.25 },
  {
    names: ["هوهن نویندورف", "Hohen Neuendorf"],
    country: "DE",
    lng: 13.283333333333333,
    lat: 52.666666666666664
  },
  {
    names: ["اشتات‌لنگزفلد"],
    country: "DE",
    lng: 10.133055555555556,
    lat: 50.783055555555556
  },
  {
    names: ["تورفاوان", "Տորֆավան"],
    country: "AM",
    lng: 45.63333333333333,
    lat: 40.18333333333333
  },
  {
    names: ["آلتامورا", "Altamura"],
    country: "IT",
    lng: 16.55,
    lat: 40.81666666666667
  },
  { names: ["اسنا"], country: "EG", lng: 32.55, lat: 25.3 },
  { names: ["لیبرویل", "Libreville"], country: "GA", lng: 9.45, lat: 0.39 },
  {
    names: ["گارناهوویت", "Գառնահովիտ"],
    country: "AM",
    lng: 43.95623611111112,
    lat: 40.496900000000004
  },
  {
    names: ["گواساو"],
    country: "MX",
    lng: -108.47055555555556,
    lat: 25.574444444444445
  },
  {
    names: ["ایگیگه", "Iquique"],
    country: "CL",
    lng: -70.15,
    lat: -20.216666666666665
  },
  {
    names: ["ولف‌اشتاین", "Wolfstein"],
    country: "DE",
    lng: 7.606111111111111,
    lat: 49.58416666666667
  },
  {
    names: ["ناتینگهام", "City of Nottingham"],
    country: "GB",
    lng: -1.1333333333333333,
    lat: 52.95
  },
  { names: ["ویتنبرگ (براندنبورگ)"], country: "DE", lng: 11.75, lat: 53 },
  {
    names: ["آیسلینگن"],
    country: "DE",
    lng: 9.706666666666665,
    lat: 48.69333333333333
  },
  {
    names: ["کاندیرا"],
    country: "TR",
    lng: 30.16111111111111,
    lat: 41.07222222222222
  },
  {
    names: ["وایبلینگن"],
    country: "DE",
    lng: 9.316944444444443,
    lat: 48.83027777777778
  },
  { names: ["ریتبرگ"], country: "DE", lng: 8.433333333333334, lat: 51.8 },
  {
    names: ["اوریخیف", "Orikhiv", "Оріхів"],
    country: "UA",
    lng: 35.77777777777778,
    lat: 47.56944444444445
  },
  {
    names: ["مورجن", "Murgeni"],
    country: "RO",
    lng: 28.016666666666666,
    lat: 46.2
  },
  { names: ["ازنا", "اِزنا"], lng: 49.4555, lat: 33.4557 },
  {
    names: ["الوبرنهاو", "Olbernhau"],
    country: "DE",
    lng: 13.333333333333334,
    lat: 50.666666666666664
  },
  {
    names: ["لا اسپتزیا", "La Spezia"],
    country: "IT",
    lng: 9.816666666666666,
    lat: 44.1
  },
  {
    names: ["بلنکنبورگ (هارتس)"],
    country: "DE",
    lng: 10.962222222222222,
    lat: 51.79527777777778
  },
  {
    names: ["هانوی", "Hà Nội"],
    country: "VN",
    lng: 105.85,
    lat: 21.033333333333335
  },
  {
    names: ["یغیپاتروش", "Եղիպատրուշ"],
    country: "AM",
    lng: 44.474444444444444,
    lat: 40.53861111111111
  },
  { names: ["گل‌دشت (اصفهان)", "شهرک امام"], lng: 51.4551, lat: 32.6501 },
  {
    names: ["کوستا مسا، کالیفرنیا", "Costa Mesa, California"],
    country: "US",
    lng: -117.91222222222223,
    lat: 33.665
  },
  {
    names: ["آواروآ", "Avarua"],
    country: "CK",
    lng: -159.76666666666668,
    lat: -21.2
  },
  { names: ["مشهد"], lng: 59.36, lat: 36.18 },
  { names: ["دالن (زاکسن)"], country: "DE", lng: 13, lat: 51.36666666666667 },
  {
    names: ["نوریچ", "Norwich"],
    country: "GB",
    lng: -1.2966666666666666,
    lat: 52.62833333333333
  },
  {
    names: ["واتوتینه", "Vatutine", "Ватутіне"],
    country: "UA",
    lng: 31.07138888888889,
    lat: 49.011944444444445
  },
  {
    names: ["بارسلونا، ونزویلا"],
    lng: -64.71666666666667,
    lat: 10.116666666666667
  },
  {
    names: ["خیراردوت (کوندینامارکا)"],
    country: "CO",
    lng: -74.80166666666666,
    lat: 4.305
  },
  {
    names: ["لایمن (بادن)", "Leimen"],
    country: "DE",
    lng: 8.69111111111111,
    lat: 49.34805555555556
  },
  {
    names: ["آلتوتیگ"],
    country: "DE",
    lng: 12.678333333333333,
    lat: 48.22666666666667
  },
  {
    names: ["فینیکی (اوکراین)", "Винники"],
    country: "UA",
    lng: 24.129722222222224,
    lat: 49.815555555555555
  },
  {
    names: ["نغوتس", "Նեղոց"],
    country: "AM",
    lng: 44.78333333333333,
    lat: 41.13333333333333
  },
  { names: ["هموور"], country: "DE", lng: 9.139444444444443, lat: 53.7025 },
  {
    names: ["نیوکن", "Neuquén"],
    country: "AR",
    lng: -68.23333333333333,
    lat: -38.95
  },
  {
    names: ["آراموس، ارمنستان", "آراموس", "Արամուս"],
    country: "AM",
    lng: 44.66305555555555,
    lat: 40.25111111111111
  },
  { names: ["آمل", "آمِل"], lng: 52.21, lat: 36.43 },
  {
    names: ["روسو (دومینیکا)", "روسو", "Roseau"],
    country: "DM",
    lng: -61,
    lat: 15
  },
  {
    names: ["سن دیگو", "سن دییگو"],
    country: "US",
    lng: -117.16250000000001,
    lat: 32.715
  },
  {
    names: ["کریتمسته", "Kristianstad"],
    country: "SE",
    lng: 14.156666666666666,
    lat: 56.029444444444444
  },
  { names: ["اوواوا"], country: "PL", lng: 17.3, lat: 50.93333333333333 },
  {
    names: ["رایشلزهایم (وتراو)", "Reichelsheim"],
    country: "DE",
    lng: 8.8725,
    lat: 50.356944444444444
  },
  {
    names: ["نویکیرشن (کنول)", "Neukirchen"],
    country: "DE",
    lng: 9.333333333333334,
    lat: 50.86666666666667
  },
  { names: ["ایتساکار"], country: "AM", lng: 45.3, lat: 40.86666666666667 },
  {
    names: ["وینیتسا", "Ві́нниця"],
    country: "UA",
    lng: 28.483333333333334,
    lat: 49.233333333333334
  },
  {
    names: ["غلیزان، الجزایر", "غلیزان"],
    country: "DZ",
    lng: 0.55,
    lat: 35.733333333333334
  },
  {
    names: ["گرمرینگ"],
    country: "DE",
    lng: 11.366666666666667,
    lat: 48.13333333333333
  },
  {
    names: ["هوشی‌مین (شهر)", "شهر هوشی‌مین", "Thành phố Hồ Chí Minh"],
    country: "VN",
    lng: 106.68194444444445,
    lat: 10.769444444444446
  },
  { names: ["موگلن"], country: "DE", lng: 13.05, lat: 51.233333333333334 },
  {
    names: ["لیندو (مارک)"],
    country: "DE",
    lng: 12.983333333333333,
    lat: 52.96666666666667
  },
  {
    names: ["ویلکوا-هاسلوا"],
    country: "DE",
    lng: 12.516666666666667,
    lat: 50.666666666666664
  },
  {
    names: ["هالاوار", "Հալավար"],
    country: "AM",
    lng: 44.384166666666665,
    lat: 40.769999999999996
  },
  { names: ["نجف‌آباد", "نجباد"], lng: 51.368294, lat: 32.6338294 },
  {
    names: ["تتوجور، گغارکونیک", "تتوجور", "Թթուջուր"],
    country: "AM",
    lng: 45.31111111111111,
    lat: 40.64722222222222
  },
  {
    names: ["نوراکرت، گغارکونیک", "نوراکرت", "Նորակերտ"],
    country: "AM",
    lng: 45.68333333333333,
    lat: 40.26694444444444
  },
  { names: ["سلونته", "Nagyszalonta"], country: "RO", lng: 21.65, lat: 46.8 },
  {
    names: ["والدنبرگ، زاکسن", "Waldenburg"],
    country: "DE",
    lng: 12.599722222222223,
    lat: 50.87583333333333
  },
  {
    names: ["راکار", "Răcari"],
    country: "RO",
    lng: 25.733333333333334,
    lat: 44.63333333333333
  },
  {
    names: ["پاتایا", "Pattaya", "پِتایا"],
    country: "AM",
    lng: 100.49388888888889,
    lat: 13.752222222222223
  },
  { names: ["رسراث"], country: "DE", lng: 7.183333333333334, lat: 50.9 },
  {
    names: ["لنینسک، اوبلاست ولگوگراد", "Ленинск"],
    country: "RU",
    lng: 45.21666666666667,
    lat: 48.7
  },
  {
    names: ["اکاسیس", "Acacías"],
    country: "CO",
    lng: -73.75972222222222,
    lat: 3.9877777777777776
  },
  {
    names: ["یانگژیانگ", "阳江市"],
    country: "CN",
    lng: 111.96666666666667,
    lat: 21.85
  },
  {
    names: ["نگرشتی-اوآش", "Negrești-Oaș"],
    country: "RO",
    lng: 23.424166666666668,
    lat: 47.86944444444445
  },
  {
    names: ["راولپندی", "Rawalpindi", "راولپنڈی"],
    country: "PK",
    lng: 73.03333333333333,
    lat: 33.6
  },
  { names: ["اشنویه", "شنو[1]"], lng: 45.1228, lat: 37.0492 },
  {
    names: ["راوا مازوویتسکا"],
    country: "PL",
    lng: 20.25,
    lat: 51.766666666666666
  },
  {
    names: ["لانژو", "兰州市"],
    country: "CN",
    lng: 103.8,
    lat: 36.03333333333333
  },
  {
    names: ["مایکتیا"],
    country: "VE",
    lng: -66.97722222222222,
    lat: 10.595833333333333
  },
  {
    names: ["بایوتو", "包头市 · ᠪᠤᠭᠤᠲᠤᠬᠣᠲᠠ"],
    country: "CN",
    lng: 109.83333333333333,
    lat: 40.65
  },
  { names: ["بوگور", "Kota Bogor"], country: "ID", lng: 106.8, lat: -6.6 },
  { names: ["رودسر"], lng: 50.3, lat: 37.13 },
  {
    names: ["سوگوت"],
    country: "TR",
    lng: 30.18138888888889,
    lat: 40.01861111111111
  },
  {
    names: ["اولشتین", "الشتین", "Olsztyn"],
    country: "PL",
    lng: 20.483333333333334,
    lat: 53.78333333333333
  },
  {
    names: ["هیلشنباخ", "Hilchenbach"],
    country: "DE",
    lng: 8.109444444444444,
    lat: 50.998333333333335
  },
  {
    names: ["فریدبرگ، بایرن", "Friedberg"],
    country: "DE",
    lng: 10.983333333333333,
    lat: 48.35
  },
  {
    names: ["نویبورگ آن در دوناو", "Neuburg a.d.Donau"],
    country: "DE",
    lng: 11.183333333333334,
    lat: 48.733333333333334
  },
  { names: ["بیلاوا"], country: "PL", lng: 16.616666666666667, lat: 50.7 },
  {
    names: ["اورواپان"],
    country: "MX",
    lng: -102.06277777777777,
    lat: 19.420833333333334
  },
  {
    names: ["ورنه"],
    country: "DE",
    lng: 7.616666666666667,
    lat: 51.666666666666664
  },
  {
    names: ["ال کارمن ده ویوورال", "Carmen de Viboral"],
    country: "CO",
    lng: -75.33333333333333,
    lat: 6.083333333333333
  },
  {
    names: ["لا مسا (کوندینامارکا)", "La Mesa"],
    country: "CO",
    lng: -74.4625,
    lat: 4.630277777777779
  },
  {
    names: ["ابرس والده"],
    country: "DE",
    lng: 13.833055555555555,
    lat: 52.83305555555556
  },
  { names: ["گلا", "Gela"], country: "IT", lng: 14.25, lat: 37.06666666666667 },
  {
    names: ["لوبامبا", "Lobamba"],
    country: "SZ",
    lng: 31.2,
    lat: -26.466666666666665
  },
  {
    names: ["لانجار", "Լանջառ"],
    country: "AM",
    lng: 44.983333333333334,
    lat: 39.825
  },
  { names: ["بولانک"], country: "TR", lng: 42.266666666666666, lat: 39.095 },
  {
    names: ["سن پدرو گارزا گارسیا"],
    country: "MX",
    lng: -100.3,
    lat: 25.666666666666668
  },
  {
    names: ["براکنهایم"],
    country: "DE",
    lng: 9.066666666666666,
    lat: 49.083333333333336
  },
  {
    names: ["بارنتروپ"],
    country: "DE",
    lng: 9.116666666666667,
    lat: 51.98305555555556
  },
  {
    names: ["یوریماگوآس", "Yurimaguas"],
    country: "PE",
    lng: -76.08333333333333,
    lat: -5.9
  },
  {
    names: ["ابلبن"],
    country: "DE",
    lng: 10.733333333333333,
    lat: 51.28333333333333
  },
  {
    names: ["مدباخ", "Medebach"],
    country: "DE",
    lng: 8.706944444444444,
    lat: 51.197222222222216
  },
  {
    names: ["دیلینگن آن در دانوب"],
    country: "DE",
    lng: 10.466666666666667,
    lat: 48.56666666666667
  },
  { names: ["گورومس"], country: "SE", lng: 13.1, lat: 59.35 },
  {
    names: ["ماییسیان، آرماویر", "ماییسیان", "Մայիսյան"],
    country: "AM",
    lng: 44.08833333333334,
    lat: 40.16166666666666
  },
  {
    names: ["واتربری، کنتیکت", "Waterbury, Connecticut"],
    country: "US",
    lng: -73.04138888888889,
    lat: 41.55611111111111
  },
  {
    names: ["دوزجه"],
    country: "TR",
    lng: 31.15833333333333,
    lat: 40.84166666666667
  },
  {
    names: ["ارمنیک", "Ermenek"],
    country: "TR",
    lng: 32.88333333333333,
    lat: 36.63333333333333
  },
  {
    names: ["کاخوفکا", "Kakhovka", "Каховка"],
    country: "UA",
    lng: 33.46666666666667,
    lat: 46.8
  },
  { names: ["جیبوتی"], lng: 43.166666666666664, lat: 11.6 },
  {
    names: ["نیشوپینگ", "Nyköping"],
    country: "SE",
    lng: 17.00861111111111,
    lat: 58.753055555555555
  },
  {
    names: ["اشتایناخ (تورینگن)", "Steinach"],
    country: "DE",
    lng: 11.166666666666666,
    lat: 50.43333333333333
  },
  {
    names: ["باهموت", "Бахмут"],
    country: "UA",
    lng: 38.080555555555556,
    lat: 48.59138888888889
  },
  {
    names: ["استان لوری", "Լոռի մարզ"],
    country: "AM",
    lng: 44.5,
    lat: 40.916666666666664
  },
  {
    names: ["کامن"],
    country: "DE",
    lng: 7.665277777777778,
    lat: 51.59166666666667
  },
  {
    names: ["باد برایزیگ"],
    country: "DE",
    lng: 7.296388888888889,
    lat: 50.509166666666665
  },
  {
    names: ["رشیتسا", "Reşiţa"],
    country: "RO",
    lng: 21.890277777777776,
    lat: 45.3
  },
  { names: ["آلتنترپتوو"], country: "DE", lng: 13.25, lat: 53.666666666666664 },
  {
    names: ["نوریچ", "Norwich"],
    country: "GB",
    lng: -1.2966666666666666,
    lat: 52.62833333333333
  },
  {
    names: ["نوینبورگ آم راین"],
    country: "DE",
    lng: 7.561944444444444,
    lat: 47.81472222222222
  },
  {
    names: ["آرتزو", "آر ِتْزو", "Arezzo"],
    country: "IT",
    lng: 11.870000000000001,
    lat: 43.473333333333336
  },
  {
    names: ["ولینگتون", "Te Whanga-nui-a-Tara", "Wellington"],
    country: "NZ",
    lng: 174.77722222222224,
    lat: -41.288888888888884
  },
  {
    names: ["انرهودار", "Енергодар"],
    country: "UA",
    lng: 34.655833333333334,
    lat: 47.49888888888889
  },
  {
    names: [
      "بوینوس آیرس",
      "شهر خودمختار بوینوس آیرس",
      "Ciudad Autónoma de Buenos Aires"
    ],
    country: "AR",
    lng: -58.36805555555556,
    lat: -34.60333333333333
  },
  {
    names: ["نیدرزتوتسنگن"],
    country: "DE",
    lng: 10.233055555555556,
    lat: 48.54111111111111
  },
  { names: ["اترندورف"], country: "DE", lng: 8.9, lat: 53.8 },
  { names: ["صحنه (کرمانشاه)"], lng: 47.6872, lat: 34.4844 },
  {
    names: ["جرج تاون پنانگ"],
    country: "MY",
    lng: 100.31666666666666,
    lat: 5.416666666666667
  },
  {
    names: ["سوارانتس", "Սվարանց"],
    country: "AM",
    lng: 46.21027777777778,
    lat: 39.36083333333333
  },
  {
    names: ["کلکته", "কলকাতা"],
    country: "IN",
    lng: 88.36666666666666,
    lat: 22.566666666666666
  },
  { names: ["اردبیل"], lng: 48.3, lat: 38.25 },
  {
    names: ["بیتلیس", "Bitlis"],
    country: "",
    lng: 42.108333333333334,
    lat: 38.4
  },
  {
    names: ["آسته"],
    country: "IT",
    lng: 8.207777777777777,
    lat: 44.89888888888889
  },
  { names: ["باماکو", "Bamako"], country: "ML", lng: -8, lat: 12.65 },
  {
    names: ["ملطیه"],
    country: "TR",
    lng: 38.016666666666666,
    lat: 38.06666666666667
  },
  {
    names: ["آربات، ارمنستان", "آربات", "Արբաթ"],
    country: "AM",
    lng: 44.39833333333333,
    lat: 40.136944444444445
  },
  {
    names: ["آیزنهوتنشتات"],
    country: "DE",
    lng: 14.672777777777776,
    lat: 52.144999999999996
  },
  {
    names: ["فلدن آن در پگنیتس", "Velden"],
    country: "DE",
    lng: 11.516666666666667,
    lat: 49.61666666666667
  },
  {
    names: ["یاهوتین", "Яготин"],
    country: "UA",
    lng: 31.781666666666666,
    lat: 50.25694444444444
  },
  {
    names: ["مانایوس", "Manaus"],
    country: "BR",
    lng: -60.016666666666666,
    lat: -3.1
  },
  {
    names: ["یانتای", "烟台市"],
    country: "CN",
    lng: 121.38916666666667,
    lat: 37.535
  },
  {
    names: ["ادژو", "Adjud"],
    country: "RO",
    lng: 27.179722222222225,
    lat: 46.1
  },
  {
    names: ["ممینگن"],
    country: "DE",
    lng: 10.181111111111111,
    lat: 47.98777777777778
  },
  {
    names: ["بنگبو", "蚌埠市"],
    country: "CN",
    lng: 117.38333333333334,
    lat: 32.916666666666664
  },
  {
    names: ["قره‌یالان", "قره‌یالان ", "Karayılan"],
    country: "TR",
    lng: 36.233333333333334,
    lat: 36.71666666666667
  },
  {
    names: ["صلاله", "Salalah"],
    country: "OM",
    lng: 54.08972222222222,
    lat: 17.01972222222222
  },
  { names: ["گلزنکیرشن"], country: "DE", lng: 7.1, lat: 51.516666666666666 },
  { names: ["فریدون‌کنار", "فری کنار"], lng: 52.5358, lat: 36.6889 },
  {
    names: ["منیا", "المنیا"],
    country: "EG",
    lng: 30.744444444444447,
    lat: 28.119444444444444
  },
  {
    names: ["درن‌اشتاینفورت", "Drensteinfurt"],
    country: "DE",
    lng: 7.739166666666667,
    lat: 51.794444444444444
  },
  {
    names: ["لازان، آلمان", "Lassan"],
    country: "DE",
    lng: 13.833333333333334,
    lat: 53.93333333333333
  },
  {
    names: ["تسایل آم ماین"],
    country: "DE",
    lng: 10.6,
    lat: 50.016666666666666
  },
  {
    names: ["سولکا", "Solca"],
    country: "RO",
    lng: 25.831666666666667,
    lat: 47.7025
  },
  {
    names: ["کواوتیتلان ایزکلی"],
    country: "MX",
    lng: -99.21138888888889,
    lat: 19.64611111111111
  },
  {
    names: ["شی‌آن", "西安市"],
    country: "CN",
    lng: 108.9,
    lat: 34.266666666666666
  },
  { names: ["پتریلا", "Petrila"], country: "RO", lng: 23.42, lat: 45.45 },
  {
    names: ["سنار (سودان)", "Sennar"],
    country: "SD",
    lng: 33.583333333333336,
    lat: 13.55
  },
  { names: ["جیبوتی"], lng: 43.166666666666664, lat: 11.6 },
  {
    names: ["گویگانگ", "贵港市 • Gveigangj Si"],
    country: "CN",
    lng: 109.60916666666667,
    lat: 23.09611111111111
  },
  {
    names: ["تسربست"],
    country: "DE",
    lng: 12.084444444444445,
    lat: 51.96805555555556
  },
  {
    names: ["چیانگ مای", "Chiang Mai", "เชียงใหม่"],
    country: "TH",
    lng: 98.99861111111112,
    lat: 18.79527777777778
  },
  { names: ["رادوم"], country: "PL", lng: 21.166666666666668, lat: 51.4 },
  { names: ["باماکو", "Bamako"], country: "ML", lng: -8, lat: 12.65 },
  { names: ["لوشن"], country: "DE", lng: 13.319617, lat: 53.203235 },
  {
    names: ["هامبورگ", "Freie und Hansestadt Hamburg"],
    country: "DE",
    lng: 10.001388888888888,
    lat: 53.56527777777777
  },
  {
    names: ["آکوری", "Աքորի"],
    country: "AM",
    lng: 44.61611111111111,
    lat: 41.092222222222226
  },
  {
    names: ["پارشیم"],
    country: "DE",
    lng: 11.833333333333334,
    lat: 53.416666666666664
  },
  {
    names: ["بومانت، تگزاس", "City of Beaumont"],
    country: "US",
    lng: -94.12666666666667,
    lat: 30.08
  },
  {
    names: ["ماپوتو", "Maputo", "Lourenço Marques"],
    country: "MZ",
    lng: 32.583333333333336,
    lat: -25.966666666666665
  },
  { names: ["گوگلینگن"], country: "DE", lng: 9, lat: 49.06666666666667 },
  { names: ["مونتاباور"], country: "DE", lng: 7.825833333333333, lat: 50.4375 },
  {
    names: ["اسکادوفسک", "Skadovsk", "Скадовськ"],
    country: "UA",
    lng: 32.916666666666664,
    lat: 46.11666666666667
  },
  {
    names: ["کیلیملی", "Kilimli"],
    country: "TR",
    lng: 31.833333333333332,
    lat: 41.483333333333334
  },
  {
    names: ["اونگه، موره", "Ungheni"],
    country: "RO",
    lng: 24.460833333333333,
    lat: 46.48583333333333
  },
  {
    names: [
      "نوووسلیتسیا",
      "Novoselytsia ",
      "Новоселиця (اوکراینی)",
      "Noua Suliță (رومانیایی)"
    ],
    country: "MD",
    lng: 26.266666666666666,
    lat: 48.21666666666667
  },
  {
    names: ["کوش", "Կոշ"],
    country: "AM",
    lng: 44.15694444444444,
    lat: 40.302499999999995
  },
  {
    names: ["هویژو", "惠州市"],
    country: "CN",
    lng: 114.4,
    lat: 23.066666666666666
  },
  {
    names: ["قهرمان‌مرعش"],
    country: "TR",
    lng: 36.93333333333333,
    lat: 37.583333333333336
  },
  {
    names: ["هلینیانی", "Hlyniany", "Глиняни"],
    country: "UA",
    lng: 24.516666666666666,
    lat: 49.82333333333334
  },
  {
    names: ["کاجاران", "Քաջարան"],
    country: "AM",
    lng: 46.16,
    lat: 39.151111111111106
  },
  {
    names: ["ماگانگه", "ماگانگه City of Magangué"],
    country: "US",
    lng: -74.76666666666667,
    lat: 9.25
  },
  {
    names: ["شپولا", "Shpola", "Шпола"],
    country: "UA",
    lng: 31.392222222222223,
    lat: 48.999722222222225
  },
  {
    names: ["اسکافاتی", "Scafati"],
    country: "IT",
    lng: 14.533333333333333,
    lat: 40.733333333333334
  },
  { names: ["زوگدیدی", "ზუგდიდი"], country: "GE", lng: 41.85, lat: 42.5 },
  {
    names: ["لیورپول", "Liverpool"],
    country: "GB",
    lng: -2.9833333333333334,
    lat: 53.4
  },
  { names: ["قایم‌شهر"], lng: 52.8589, lat: 36.4656 },
  {
    names: ["نانگبو", "Ningbo", "宁波市"],
    country: "CN",
    lng: 121.55,
    lat: 29.866666666666667
  },
  {
    names: ["رتوایل"],
    country: "DE",
    lng: 8.624722222222223,
    lat: 48.168055555555554
  },
  {
    names: ["برهوفه", "Berehove", "Берегове (اوکراینی)"],
    country: "UA",
    lng: 22.647222222222222,
    lat: 48.205555555555556
  },
  { names: ["تیخی"], country: "PL", lng: 19, lat: 50.166666666666664 },
  {
    names: ["بلویو (واشینگتن)", "بلویو", "City of Bellevue"],
    country: "US",
    lng: -122.15916666666668,
    lat: 47.597500000000004
  },
  {
    names: ["آرهوس", "Århus"],
    country: "DK",
    lng: 10.216666666666667,
    lat: 56.15
  },
  {
    names: ["سیزاوت", "Սիզավետ"],
    country: "AM",
    lng: 43.84111111111111,
    lat: 41.105000000000004
  },
  {
    names: ["وزنسنسک", "Voznesensk", "Вознесенськ"],
    country: "UA",
    lng: 31.3,
    lat: 47.56666666666667
  },
  { names: ["نیمبی", "Ñemby"], country: "PY", lng: -57.5443, lat: -25.3935 },
  { names: ["داکا", "ঢাকা", "Dhaka"], country: "BD", lng: 90.375, lat: 23.7 },
  { names: ["ابرن"], country: "DE", lng: 10.793611111111112, lat: 50.1 },
  {
    names: ["سولتس کویافسکی"],
    country: "PL",
    lng: 18.233333333333334,
    lat: 53.083333333333336
  },
  {
    names: ["ایتا", "Itá"],
    country: "PY",
    lng: -57.35,
    lat: -25.483333333333334
  },
  {
    names: ["زیندلفینگن"],
    country: "DE",
    lng: 9.002777777777778,
    lat: 48.71333333333334
  },
  {
    names: ["آوان، آراگاتسوتن", "آوان", "Ավան"],
    country: "AM",
    lng: 44.16833333333333,
    lat: 40.33527777777778
  },
  {
    names: ["یوژنوکرایینسک", "Yuzhnoukrainsk", "Южноукраїнськ"],
    country: "UA",
    lng: 31.175,
    lat: 47.82166666666667
  },
  {
    names: ["روزنفلد (بادن-وورتمبرگ)"],
    country: "DE",
    lng: 8.724166666666667,
    lat: 48.28638888888889
  },
  {
    names: ["سالوادور، باهیا", "سالوادور", "Salvador"],
    country: "BR",
    lng: -38.46666666666667,
    lat: -12.966666666666667
  },
  {
    names: ["چونگ‌کینگ", "Chongqing", "重庆"],
    country: "AM",
    lng: 106.56666666666666,
    lat: 29.558333333333334
  },
  { names: ["تروتسبرگ"], country: "DE", lng: 12.55, lat: 48.016666666666666 },
  {
    names: ["رزیستنسیا", "Resistencia"],
    country: "AR",
    lng: -58.986666666666665,
    lat: -27.45138888888889
  },
  { names: ["السالوادور"], lng: -89.16666666666667, lat: 13.666666666666666 },
  {
    names: ["کونوتوپ", "Konotop", "Конотоп"],
    country: "UA",
    lng: 33.2,
    lat: 51.21666666666667
  },
  {
    names: ["ساسنوویتس"],
    country: "PL",
    lng: 19.133333333333333,
    lat: 50.28333333333333
  },
  {
    names: ["برگا، تورینگن", "Berga"],
    country: "DE",
    lng: 12.166666666666666,
    lat: 50.75
  },
  {
    names: [
      "منطقه آیسن",
      "Aysén Region of",
      "General Carlos Ibáñez del Campo",
      "XI Región Aysén del"
    ],
    country: "CL",
    lng: -72.06611111111111,
    lat: -43.57
  },
  {
    names: ["خراسنوهراد", "Krasnohrad", "Красноград"],
    country: "UA",
    lng: 35.45,
    lat: 49.36666666666667
  },
  {
    names: ["هاندان", "邯郸市"],
    country: "CN",
    lng: 114.48333333333333,
    lat: 36.6
  },
  {
    names: ["کایایو (پرو)", "Callao", "El Callao"],
    country: "PE",
    lng: -77.13333333333334,
    lat: -12.033333333333333
  },
  { names: ["فارسان"], lng: 50.5642, lat: 32.2569 },
  {
    names: ["اوژهورود", "Ужгород"],
    country: "UA",
    lng: 22.3,
    lat: 48.61666666666667
  },
  { names: ["اکارتسبرگ"], country: "DE", lng: 11.55, lat: 51.11666666666667 },
  { names: ["اسکندرون"], country: "TR", lng: 36.165, lat: 36.5817 },
  {
    names: ["سو فالز، داکوتای جنوبی", "Sioux Falls, South Dakota"],
    country: "US",
    lng: -96.73166666666667,
    lat: 43.53638888888889
  },
  {
    names: ["تارونیک", "Տարոնիկ"],
    country: "AM",
    lng: 44.19916666666666,
    lat: 40.13305555555556
  },
  {
    names: ["رونیبه", "Ronneby"],
    country: "SE",
    lng: 15.283333333333333,
    lat: 56.2
  },
  {
    names: ["گوزجولر", "Gözcüler", "(Alakop)"],
    country: "TR",
    lng: 35.916666666666664,
    lat: 36.38333333333333
  },
  {
    names: ["کسکین", "Keskin"],
    country: "TR",
    lng: 33.6,
    lat: 39.666666666666664
  },
  {
    names: ["یفر", "Jever"],
    country: "DE",
    lng: 7.900833333333334,
    lat: 53.574444444444445
  },
  {
    names: ["خوینوف", "Chojnów"],
    country: "PL",
    lng: 15.933333333333334,
    lat: 51.266666666666666
  },
  { names: ["قزوین", "کاسپین"], lng: 50, lat: 36.16 },
  { names: ["وازنبرگ", "Wassenberg"], country: "DE", lng: 6.15, lat: 51.1 },
  {
    names: ["سارامج", "Սարամեջ"],
    country: "AM",
    lng: 44.219166666666666,
    lat: 40.7725
  },
  {
    names: ["الکساندریا، ویرجینیا", "Alexandria, Virginia"],
    country: "US",
    lng: -77.04722222222222,
    lat: 38.80472222222222
  },
  {
    names: ["پویرتو مالدونادو"],
    country: "PE",
    lng: -69.18333333333334,
    lat: -12.6
  },
  {
    names: ["صوفیه", "София"],
    country: "BG",
    lng: 23.333333333333332,
    lat: 42.7
  },
  {
    names: ["سیوری‌حصار", "Sivrihisar"],
    country: "TR",
    lng: 31.533333333333335,
    lat: 39.45
  },
  {
    names: ["آداک، آلاسکا", "Adak"],
    country: "US",
    lng: -176.64499999999998,
    lat: 51.88333333333333
  },
  {
    names: ["ملومسلت", "Malmslätt"],
    country: "SE",
    lng: 13.033333333333333,
    lat: 55.583333333333336
  },
  { names: ["آلاجه", "Alaca"], country: "TR", lng: 34.8425, lat: 40.16833 },
  {
    names: ["بوخهلتس در نوردهایده", "بوخهلتس"],
    country: "DE",
    lng: 9.866666666666667,
    lat: 53.31666666666667
  },
  {
    names: ["چوکورجه"],
    country: "TR",
    lng: 43.61666666666667,
    lat: 37.25055555555556
  },
  { names: ["خورزوق", "خورزوک"], lng: 51.6458, lat: 32.7775 },
  {
    names: ["تگوسیگالپا", "Tegucigalpa"],
    country: "HN",
    lng: -87.21666666666667,
    lat: 14.1
  },
  {
    names: ["ورتهایم آم ماین", "Wertheim"],
    country: "DE",
    lng: 9.5175,
    lat: 49.75888888888889
  },
  {
    names: ["تساغکونک، گغارکونیک", "تساغکونک", "Ծաղկունք"],
    country: "AM",
    lng: 44.86944444444445,
    lat: 40.58305555555556
  },
  { names: ["بتوف"], country: "PL", lng: 17.5, lat: 54.13333333333333 },
  {
    names: ["پورتلند، اورگن", "پورتلند", "Portland, Oregon"],
    country: "US",
    lng: -122.68194444444445,
    lat: 45.519999999999996
  },
  { names: ["سیواس"], country: "TR", lng: 37.016666666666666, lat: 39.75 },
  {
    names: ["برج الکیفان، الجزایر", "برج الکیفان"],
    country: "DZ",
    lng: 3.1930555555555555,
    lat: 36.737500000000004
  },
  {
    names: ["سانتا روسا ده روسوس", "Santa Rosa de Osos"],
    country: "CO",
    lng: -75.46666666666667,
    lat: 6.633333333333333
  },
  {
    names: ["سن خوزه، کالیفرنیا", "سن‌خوزه", "San Jose"],
    country: "US",
    lng: -121.89194444444445,
    lat: 37.33527777777778
  },
  {
    names: ["برانگوو"],
    country: "PL",
    lng: 19.833333333333332,
    lat: 54.38333333333333
  },
  { names: ["شن‌یانگ", "沈阳市"], country: "CN", lng: 123.4, lat: 41.8 },
  {
    names: ["تساماکاسار", "Ցամաքասար"],
    country: "AM",
    lng: 43.75611111111111,
    lat: 40.46638888888889
  },
  {
    names: ["کرچ", "Керч"],
    country: "UA",
    lng: 36.46805555555556,
    lat: 45.33861111111111
  },
  {
    names: ["سیپاگیرا", "Zipaquirá, Cundinamarca"],
    country: "CO",
    lng: -74.04166666666667,
    lat: 4.947222222222223
  },
  {
    names: ["ساراگوسا", "(به اسپانیایی: Zaragoza)"],
    country: "ES",
    lng: -0.8833333333333333,
    lat: 41.65
  },
  {
    names: ["نیغده"],
    country: "TR",
    lng: 34.67916666666667,
    lat: 37.96666666666667
  },
  {
    names: ["گونتسبورگ"],
    country: "DE",
    lng: 10.271333333333333,
    lat: 48.452666666666666
  },
  {
    names: ["لانگناو (وورتمبرگ)", "Langenau"],
    country: "DE",
    lng: 10.120000000000001,
    lat: 48.49666666666667
  },
  {
    names: ["بخارکنت", "Buharkent"],
    country: "TR",
    lng: 28.742222222222225,
    lat: 37.961666666666666
  },
  {
    names: ["اورورو", "Uru Uru"],
    country: "BO",
    lng: -67.11666666666666,
    lat: -17.966666666666665
  },
  {
    names: ["تلوماچ", "Тлумач", "Tłumacz"],
    country: "UA",
    lng: 25,
    lat: 48.86666666666667
  },
  { names: ["قارص"], country: "TR", lng: 43.1, lat: 40.61666666666667 },
  {
    names: ["هابورگ، بایرن", "Harburg"],
    country: "DE",
    lng: 10.666666666666666,
    lat: 48.766666666666666
  },
  {
    names: ["پراویدنس", "Providence"],
    country: "US",
    lng: -71.42222222222223,
    lat: 41.82361111111111
  },
  {
    names: ["سانرمو", "Sanremo"],
    country: "IT",
    lng: 7.783333333333333,
    lat: 43.81666666666667
  },
  {
    names: ["لوبتس"],
    country: "DE",
    lng: 12.028333333333334,
    lat: 53.463055555555556
  },
  {
    names: ["بیلیشت", "Bilisht"],
    country: "AL",
    lng: 20.990000000000002,
    lat: 40.6275
  },
  { names: ["کفر الدوار"], country: "EG", lng: 30.13, lat: 31.13111111111111 },
  {
    names: ["چروونوهراد", "Chervonohrad"],
    country: "UA",
    lng: 24.23,
    lat: 50.39
  },
  {
    names: ["پیاترا نیم", "Piatra Neamţ"],
    country: "RO",
    lng: 26.370833333333334,
    lat: 46.927499999999995
  },
  {
    names: ["گرین‌بی، ویسکانسین", "گرین‌بی", "Green Bay"],
    country: "US",
    lng: -88.01583333333333,
    lat: 44.513333333333335
  },
  {
    names: ["بالوه", "Balve"],
    country: "DE",
    lng: 7.866666666666667,
    lat: 51.333333333333336
  },
  {
    names: ["فاینتسا", "Faenza"],
    country: "IT",
    lng: 11.883333333333333,
    lat: 44.28333333333333
  },
  {
    names: ["کلینگلتال (زاکسن)"],
    country: "DE",
    lng: 12.46861111111111,
    lat: 50.36694444444444
  },
  {
    names: ["ووشی", "无锡市"],
    country: "CN",
    lng: 120.3,
    lat: 31.566666666666666
  },
  {
    names: ["بوبو دیولاسو"],
    country: "BF",
    lng: -4.283333333333333,
    lat: 11.183333333333334
  },
  {
    names: ["کراشن", "Կրաշեն"],
    country: "AM",
    lng: 43.95,
    lat: 40.86666666666667
  },
  { names: ["اسکوروپ"], country: "SE", lng: 13.5, lat: 55.483333333333334 },
  {
    names: ["لانگن (هسن)"],
    country: "DE",
    lng: 8.666666666666666,
    lat: 49.983333333333334
  },
  { names: ["باد کامبرگ"], country: "DE", lng: 8.266666666666667, lat: 50.3 },
  { names: ["وییاویسنیو"], country: "CO", lng: -73.63333333333334, lat: 4.15 },
  {
    names: ["توسیا", "Tosya"],
    country: "TR",
    lng: 34.03333333333333,
    lat: 41.1
  },
  { names: ["تریبزیز"], country: "DE", lng: 12.75, lat: 54.083333333333336 },
  {
    names: ["استهایم"],
    country: "DE",
    lng: 10.216666666666667,
    lat: 50.46666666666667
  },
  { names: ["اوفرراس", "Overath"], country: "DE", lng: 7.3, lat: 50.95 },
  {
    names: ["موینشت", "Moineşti"],
    country: "RO",
    lng: 26.483333333333334,
    lat: 46.43333333333333
  },
  {
    names: ["گفلسبرگ", "Gevelsberg"],
    country: "DE",
    lng: 7.333333333333333,
    lat: 51.3
  },
  { names: ["کورگیدورا، کرتارو"], lng: -100.442, lat: 20.531 },
  { names: ["کوتن"], country: "DE", lng: 11.916666666666666, lat: 51.75 },
  {
    names: ["اوساکا", "大阪市"],
    country: "JP",
    lng: 135.50222222222223,
    lat: 34.693888888888885
  },
  {
    names: ["تیتو (رومانی)", "Titu"],
    country: "RO",
    lng: 25.57361111111111,
    lat: 44.66222222222222
  },
  {
    names: ["آبادان", "آبودان (لهجه آبادانی)، عَبّادان (تلفظ عربی)"],
    lng: 48.304167,
    lat: 30.339167
  },
  {
    names: ["اولوبورلو", "Uluborlu"],
    country: "TR",
    lng: 30.448333333333334,
    lat: 38.07888888888889
  },
  {
    names: ["گندواز", "Գնդեվազ"],
    country: "AM",
    lng: 45.61805555555556,
    lat: 39.759166666666665
  },
  {
    names: ["کنکورد، نیوهمپشایر", "کنکورد، نیوهمپشر", "Concord, New Hampshire"],
    country: "US",
    lng: -71.53805555555556,
    lat: 43.20666666666667
  },
  {
    names: ["اگلن", "Egeln"],
    country: "DE",
    lng: 11.433333333333334,
    lat: 51.95
  },
  {
    names: ["باریلوچه", "San Carlos de Bariloche", "Bariloche"],
    country: "AR",
    lng: -71.3,
    lat: -41.15
  },
  { names: ["اقلید", "کلیل"], lng: 52.71, lat: 31.01 },
  { names: ["گلوکسبورگ"], country: "DE", lng: 9.55, lat: 54.83361111111111 },
  {
    names: ["شاتجرک", "Շատջրեք"],
    country: "AM",
    lng: 45.80333333333333,
    lat: 40.163888888888884
  },
  { names: ["بونیگهایم"], country: "DE", lng: 9.095, lat: 49.041 },
  {
    names: ["ماستریخت", "Maastricht", "Mestreech"],
    country: "NL",
    lng: 5.683333333333334,
    lat: 50.85
  },
  {
    names: ["کوچی (شهر)", "Kōchi", "高知"],
    country: "JP",
    lng: 133.53333333333333,
    lat: 33.56666666666667
  },
  { names: ["وینیپگ"], lng: -97.13916666666667, lat: 49.89944444444444 },
  {
    names: ["باتومی", "ბათუმი"],
    country: "GE",
    lng: 41.641666666666666,
    lat: 41.645833333333336
  },
  {
    names: ["تاتول", "Թաթուլ"],
    country: "AM",
    lng: 43.814166666666665,
    lat: 40.38916666666667
  },
  {
    names: ["ویژنیتسیا", "Vyzhnytsia", "Вижниця"],
    country: "UA",
    lng: 25.191666666666666,
    lat: 48.25
  },
  {
    names: ["آنوشاوان", "Անուշավան"],
    country: "AM",
    lng: 43.98222222222223,
    lat: 40.64194444444444
  },
  {
    names: ["آکنالیج", "Ակնալիճ"],
    country: "AM",
    lng: 44.25,
    lat: 40.233333333333334
  },
  { names: ["اورشتیه", "Orăștie"], country: "RO", lng: 23.2, lat: 45.85 },
  {
    names: ["بایرویت"],
    country: "DE",
    lng: 11.578333333333333,
    lat: 49.948055555555555
  },
  { names: ["گربن‌اشتاین"], country: "DE", lng: 9.416666666666666, lat: 51.45 },
  {
    names: ["لوروت", "Լորուտ"],
    country: "AM",
    lng: 44.7725,
    lat: 40.93888888888888
  },
  {
    names: ["بلموپان", "Belmopán"],
    country: "BZ",
    lng: -88.76666666666667,
    lat: 17.25
  },
  {
    names: ["کاکاوادزور، آراگاتسوتن", "کاکاوادزور", "Կաքավաձոր"],
    country: "AM",
    lng: 44.011944444444445,
    lat: 40.343611111111116
  },
  {
    names: ["تل‌آویو", "תל אביב-יפו (عبری )", "تل اَبیب-یافا (عربی )"],
    country: "IL",
    lng: 34.78333333333333,
    lat: 32.06666666666667
  },
  {
    names: ["گرفنهاینیشن"],
    country: "DE",
    lng: 12.433333333333334,
    lat: 51.71666666666667
  },
  {
    names: ["تورانس، کالیفرنیا", "تورانس", "City of Torrance"],
    country: "US",
    lng: -118.34138888888889,
    lat: 33.834722222222226
  },
  {
    names: ["یایونده", "Yaoundé"],
    country: "CM",
    lng: 11.516666666666667,
    lat: 3.8666666666666667
  },
  {
    names: ["آگوستین کوداسی (سزار)", "Agustín Codazzi"],
    country: "CO",
    lng: -73.23333333333333,
    lat: 10.033333333333333
  },
  { names: ["آیدین"], country: "TR", lng: 27.8458, lat: 37.8444 },
  {
    names: ["المناقل"],
    country: "SD",
    lng: 32.98888888888889,
    lat: 14.245833333333332
  },
  {
    names: ["وایادولید", "(به اسپانیایی: Valladolid)"],
    country: "ES",
    lng: -4.716666666666667,
    lat: 41.63333333333333
  },
  {
    names: ["برو (سوید)", "Bro"],
    country: "SE",
    lng: 17.65,
    lat: 59.516666666666666
  },
  {
    names: ["هاگن", "Hagen"],
    country: "DE",
    lng: 7.483333333333333,
    lat: 51.36666666666667
  },
  {
    names: ["فورده (نیدرهاین)", "Voerde"],
    country: "DE",
    lng: 6.683333333333334,
    lat: 51.6
  },
  {
    names: ["لومه", "Ville de Lomé"],
    country: "TG",
    lng: 1.2125,
    lat: 6.137777777777778
  },
  {
    names: ["تساغکاهوویت", "Ծաղկահովիտ"],
    country: "AM",
    lng: 44.223055555555554,
    lat: 40.63611111111111
  },
  {
    names: ["مالمو", "Malmö"],
    country: "SE",
    lng: 13.033333333333333,
    lat: 55.583333333333336
  },
  { names: ["واتیکان"], lng: -12.45, lat: 41.9 },
  {
    names: ["بیلیتسکه", "Bilytske", "Білицьке"],
    country: "UA",
    lng: 37.18333333333333,
    lat: 48.4
  },
  {
    names: ["آستین، تگزاس", "آستین", "City of Austin"],
    country: "US",
    lng: -97.75,
    lat: 30.25
  },
  {
    names: ["پایتس"],
    country: "DE",
    lng: 14.416666666666666,
    lat: 51.86666666666667
  },
  {
    names: ["بروکسل", "(به هلندی: Brussel)", "(به فرانسوی: Bruxelles)"],
    country: "BE",
    lng: 4.35,
    lat: 50.85
  },
  {
    names: ["یوناک", "Yunak"],
    country: "TR",
    lng: 31.733333333333334,
    lat: 38.81666666666667
  },
  {
    names: ["تونیا"],
    country: "TR",
    lng: 39.29222222222222,
    lat: 40.885555555555555
  },
  {
    names: ["برنزدورف (اوبرلاوزیتس)", "Bernsdorf"],
    country: "DE",
    lng: 14.066666666666666,
    lat: 51.36666666666667
  },
  {
    names: ["والدبرول", "Waldbröl"],
    country: "DE",
    lng: 7.614999999999999,
    lat: 50.87888888888889
  },
  {
    names: ["فلباخ"],
    country: "DE",
    lng: 9.275833333333335,
    lat: 48.808611111111105
  },
  {
    names: ["مارکت‌برایت"],
    country: "DE",
    lng: 10.143611111111111,
    lat: 49.66694444444444
  },
  {
    names: ["لنکستر، کالیفرنیا", "Lancaster"],
    country: "US",
    lng: -118.15,
    lat: 34.68333333333333
  },
  {
    names: ["سن دیگو", "سن دییگو"],
    country: "US",
    lng: -117.16250000000001,
    lat: 32.715
  },
  { names: ["بارتوشتسه"], country: "PL", lng: 20.8, lat: 54.25 },
  {
    names: ["یارت‌باشی", "Yurtbaşı"],
    country: "TR",
    lng: 39.35,
    lat: 38.63333333333333
  },
  { names: ["هومبرگ"], country: "DE", lng: 9, lat: 50.71666666666667 },
  {
    names: ["سانتو توماس (آتلانتیکو)", "Santo Tomás"],
    country: "CO",
    lng: -74.91666666666667,
    lat: 10.766666666666667
  },
  {
    names: ["پورتو پرنس", "Ville de Port-au-Prince"],
    country: "HT",
    lng: -72.33333333333333,
    lat: 18.533333333333335
  },
  {
    names: ["سالوادور، باهیا", "سالوادور", "Salvador"],
    country: "BR",
    lng: -38.46666666666667,
    lat: -12.966666666666667
  },
  {
    names: ["کلینگنبرگ آم ماین"],
    country: "DE",
    lng: 9.183333333333334,
    lat: 49.78333333333333
  },
  {
    names: ["اشتات‌آلندورف"],
    country: "DE",
    lng: 9.016666666666667,
    lat: 50.833333333333336
  },
  {
    names: ["رینو، نوادا"],
    country: "US",
    lng: -119.8218111111111,
    lat: 39.52711111111111
  },
  {
    names: ["اوپلندز وزبه", "Upplands Väsby"],
    country: "SE",
    lng: 17.916666666666668,
    lat: 59.516666666666666
  },
  {
    names: ["سولداد (آتلانتیکو)", "Soledad"],
    country: "CO",
    lng: -74.75,
    lat: 10.916666666666666
  },
  {
    names: ["سانتا کلاریتا، کالیفرنیا", "City of Santa Clarita"],
    country: "US",
    lng: -118.50638888888889,
    lat: 34.416666666666664
  },
  { names: ["لندن"], country: "GB", lng: -0.1275, lat: 51.507222222222225 },
  { names: ["زوگدیدی", "ზუგდიდი"], country: "GE", lng: 41.85, lat: 42.5 },
  {
    names: ["بادن-بادن"],
    country: "DE",
    lng: 8.240833333333333,
    lat: 48.76277777777778
  },
  { names: ["ارکولانو", "Ercolano"], country: "IT", lng: 14.35, lat: 40.8 },
  {
    names: ["گلندیل، آریزونا"],
    country: "US",
    lng: -112.1863888888889,
    lat: 33.53861111111111
  },
  { names: ["لاس وگاس"], country: "US", lng: -115.1363888888889, lat: 36.175 },
  {
    names: ["میرونیفکا", "Миронівка"],
    country: "UA",
    lng: 30.983333333333334,
    lat: 49.65
  },
  {
    names: ["هوغمیک", "Հողմիկ"],
    country: "AM",
    lng: 43.81666666666667,
    lat: 40.916666666666664
  },
  {
    names: ["ویلنوهیرسک", "Вільногірськ"],
    country: "UA",
    lng: 34.028055555555554,
    lat: 48.47805555555556
  },
  { names: ["فولینو", "Foligno"], country: "IT", lng: 12.7, lat: 42.95 },
  {
    names: ["آتندورم", "Attendorn"],
    country: "DE",
    lng: 7.9,
    lat: 51.11666666666667
  },
  { names: ["ریورا", "Rivera"], country: "UY", lng: -57, lat: -31 },
  {
    names: ["فریک، ارمنستان", "فریک", "Ֆերիկ"],
    country: "AM",
    lng: 44.20944444444445,
    lat: 40.186388888888885
  },
  {
    names: ["پایاس", "Payas"],
    country: "TR",
    lng: 36.21666666666667,
    lat: 36.75
  },
  { names: ["آبنسبرگ"], country: "DE", lng: 11.85, lat: 48.8 },
  { names: ["تسون"], country: "DE", lng: 9.283333333333333, lat: 53.3 },
  {
    names: ["سن خوان باوتیستا توکستپک"],
    country: "MX",
    lng: -96.11666666666666,
    lat: 18.1
  },
  {
    names: ["دزوراشن", "Ձորաշեն"],
    country: "AM",
    lng: 44.06916666666667,
    lat: 40.93138888888889
  },
  {
    names: ["لاندسکرونا", "Landskrona"],
    country: "SE",
    lng: 12.833333333333334,
    lat: 55.86666666666667
  },
  {
    names: ["لادنبورگ", "Ladenburg"],
    country: "DE",
    lng: 8.616666666666667,
    lat: 49.46666666666667
  },
  { names: ["هاملبورگ"], country: "DE", lng: 9.9, lat: 50.11666666666667 },
  {
    names: ["شفیلد", "City of Sheffield"],
    country: "GB",
    lng: -1.4669444444444446,
    lat: 53.38361111111111
  },
  { names: ["ارزروم"], country: "TR", lng: 41.27, lat: 39.9 },
  {
    names: ["جونو، آلاسکا", "Juneau, Alaska"],
    country: "US",
    lng: -134.22972222222222,
    lat: 58.44444444444444
  },
  {
    names: ["نوی‌مونستر"],
    country: "DE",
    lng: 9.989999999999998,
    lat: 54.07138888888889
  },
  {
    names: ["کنیوستا", "Knivsta"],
    country: "SE",
    lng: 17.8,
    lat: 59.71666666666667
  },
  {
    names: ["اشکولن"],
    country: "DE",
    lng: 11.816666666666666,
    lat: 51.03333333333333
  },
  {
    names: ["جرموک", "Ջերմուկ"],
    country: "AM",
    lng: 45.67222222222222,
    lat: 39.84166666666667
  },
  {
    names: ["شبرالخیمه", "شبر الخیمه", "شبرا الخیمه"],
    country: "EG",
    lng: 31.242222222222225,
    lat: 30.128611111111113
  },
  {
    names: ["چمسنو", "Trzemeszno"],
    country: "PL",
    lng: 17.816666666666666,
    lat: 52.56666666666667
  },
  { names: ["اتلیکسکو"], country: "MX", lng: -98.45, lat: 18.9 },
  {
    names: ["کوتی، ارمنستان", "کوتی", "Կոթի"],
    country: "AM",
    lng: 45.125,
    lat: 41.135555555555555
  },
  {
    names: ["لاوف آن در پگنیتز", "Lauf a.d.Pegnitz"],
    country: "DE",
    lng: 11.277222222222223,
    lat: 49.51027777777778
  },
  {
    names: ["اسپو", "Espoo"],
    country: "AM",
    lng: 24.655555555555555,
    lat: 60.205555555555556
  },
  { names: ["ابنوب"], country: "EG", lng: 31.150088, lat: 27.266685 },
  {
    names: ["آراگاتساوان", "Արագածավան"],
    country: "AM",
    lng: 43.658055555555556,
    lat: 40.33305555555556
  },
  {
    names: ["روپه", "Rupea"],
    country: "RO",
    lng: 25.222499999999997,
    lat: 46.038888888888884
  },
  {
    names: ["دوبرلوگ-کیرشهاین"],
    country: "DE",
    lng: 13.566666666666666,
    lat: 51.61666666666667
  },
  { names: ["فرایتال"], country: "DE", lng: 13.65, lat: 51.016666666666666 },
  {
    names: ["متس ماسریک", "Մեծ Մասրիկ"],
    country: "AM",
    lng: 45.769444444444446,
    lat: 40.218611111111116
  },
  {
    names: ["اوشویمچین", "Oświęcim"],
    country: "PL",
    lng: 19.233333333333334,
    lat: 50.05
  },
  {
    names: ["نرتروف"],
    country: "DE",
    lng: 9.866666666666667,
    lat: 54.166666666666664
  },
  { names: ["سراوان"], lng: 62.334167, lat: 27.370833 },
  { names: ["وایشنفلد"], country: "DE", lng: 11.333333333333334, lat: 49.85 },
  {
    names: ["آنتیوچ، کالیفرنیا", "آنتیوچ"],
    country: "US",
    lng: -121.80583333333333,
    lat: 38.005
  },
  {
    names: ["های پوینت، کارولینای شمالی", "High Point"],
    country: "US",
    lng: -79.9975,
    lat: 35.970555555555556
  },
  {
    names: ["کوروستن", "Korosten", "Коростень"],
    country: "UA",
    lng: 28.633333333333333,
    lat: 50.95
  },
  { names: ["دتا (شهر)", "Deta"], country: "RO", lng: 21.22, lat: 45.4 },
  {
    names: ["باناز", "Banaz"],
    country: "TR",
    lng: 29.75,
    lat: 38.733333333333334
  },
  {
    names: ["اوکوسینگو"],
    country: "MX",
    lng: -92.09388888888888,
    lat: 16.906666666666666
  },
  {
    names: ["الوار، ارمنستان", "الوار", "Ալվար"],
    country: "AM",
    lng: 43.74916666666667,
    lat: 41.05083333333333
  },
  {
    names: ["پویرتو آیسن"],
    country: "CL",
    lng: -72.68333333333334,
    lat: -45.4
  },
  {
    names: ["آلتنبورگ", "Altenburg"],
    country: "DE",
    lng: 12.433333333333334,
    lat: 50.985
  },
  { names: ["پازواک"], country: "DE", lng: 14, lat: 53.5 },
  {
    names: ["ابرسبرگ"],
    country: "DE",
    lng: 11.966666666666667,
    lat: 48.083333333333336
  },
  {
    names: ["کرشنبرویش", "Korschenbroich"],
    country: "DE",
    lng: 6.516666666666667,
    lat: 51.18333333333333
  },
  { names: ["پگاو"], country: "DE", lng: 12.25, lat: 51.166666666666664 },
  {
    names: ["لا دورادا (کالداس)", "La Dorada"],
    country: "CO",
    lng: -74.664675,
    lat: 5.453838888888889
  },
  {
    names: ["مال‌کارا"],
    country: "TR",
    lng: 26.904166666666665,
    lat: 40.89333333333333
  },
  { names: ["تهران"], lng: 51.4, lat: 35.7 },
  {
    names: ["جکسون، میسیسیپی", "Jackson, Mississippi"],
    country: "US",
    lng: -90.18472222222222,
    lat: 32.29888888888889
  },
  {
    names: ["گیسن"],
    country: "DE",
    lng: 8.666666666666666,
    lat: 50.583333333333336
  },
  {
    names: ["بتن‌روژ، لوییزیانا", "بتون روژ، لویزیانا", "Baton Rouge"],
    country: "US",
    lng: -91.14027777777778,
    lat: 30.458055555555553
  },
  {
    names: ["گومز پالاسیو", "gomitos"],
    country: "MX",
    lng: -103.49833333333333,
    lat: 25.57777777777778
  },
  {
    names: ["سلشتیا ده سو", "Săliștea de Sus"],
    country: "RO",
    lng: 24.35,
    lat: 47.65
  },
  {
    names: ["ووغجی", "Ողջի"],
    country: "AM",
    lng: 43.75277777777778,
    lat: 40.809444444444445
  },
  {
    names: ["میدلند، تگزاس", "Midland, Texas"],
    country: "US",
    lng: -102.1,
    lat: 32
  },
  {
    names: ["تسیوروپینسک", "Tsiurupynsk", "Цюрупинськ"],
    country: "UA",
    lng: 32.583333333333336,
    lat: 46.63333333333333
  },
  {
    names: ["اولایا اررآ", "Olaya Herrera"],
    country: "CO",
    lng: -78.32555555555555,
    lat: 2.3469444444444445
  },
  {
    names: ["میلان", "Milano", "Milan"],
    country: "IT",
    lng: 9.190277777777778,
    lat: 45.46416666666667
  },
  { names: ["آرسک", "Арск"], country: "RU", lng: 49.88333333333333, lat: 56.1 },
  {
    names: ["نووهورود-سیورسکیی", "Novhorod-Siverskyi", "Новгород-Сіверський"],
    country: "UA",
    lng: 33.266666666666666,
    lat: 51.983333333333334
  },
  {
    names: ["باد لواسیک"],
    country: "DE",
    lng: 12.645277777777777,
    lat: 51.14472222222222
  },
  {
    names: ["اولوفستروم", "Olofström"],
    country: "SE",
    lng: 14.533333333333333,
    lat: 56.266666666666666
  },
  {
    names: ["رودل‌اشتات"],
    country: "DE",
    lng: 11.3275,
    lat: 50.716944444444444
  },
  {
    names: ["الاگیاز", "Ալագյազ"],
    country: "AM",
    lng: 44.290277777777774,
    lat: 40.68138888888889
  },
  {
    names: ["عجمان", "اماره عجمانّ"],
    country: "AE",
    lng: 55.5,
    lat: 25.416666666666668
  },
  {
    names: ["لجان", "Լեջան"],
    country: "AM",
    lng: 44.44194444444444,
    lat: 41.030277777777776
  },
  {
    names: ["سیس، ارمنستان", "سیس", "Սիս"],
    country: "AM",
    lng: 44.38638888888889,
    lat: 40.058611111111105
  },
  {
    names: ["فرانسیستوون، بوتسوانا", "Francistown"],
    country: "BW",
    lng: 27.5125,
    lat: -21.17361111111111
  },
  {
    names: ["شوپینگ (سوید)", "Köping"],
    country: "SE",
    lng: 15.983333333333333,
    lat: 59.516666666666666
  },
  {
    names: ["جاجور", "Ջաջուռ"],
    country: "AM",
    lng: 43.948055555555555,
    lat: 40.85055555555556
  },
  { names: ["اسویه‌دالا"], country: "SE", lng: 13.233333333333333, lat: 55.5 },
  {
    names: ["کانزاس‌سیتی، میزوری", "کانزاس سیتی", "Kansas City"],
    country: "US",
    lng: -94.5886111111111,
    lat: 39.109722222222224
  },
  {
    names: ["نور یرزنکا", "Նոր Երզնկա"],
    country: "AM",
    lng: 44.40472222222222,
    lat: 40.31333333333333
  },
  {
    names: ["هاربین", "哈尔滨市"],
    country: "CN",
    lng: 126.63333333333334,
    lat: 45.75
  },
  {
    names: ["هلنا (مونتانا)", "هلنا، مونتانا", "Helena, Montana"],
    country: "US",
    lng: -112.02703055555556,
    lat: 46.59580555555556
  },
  { names: ["قشم (شهر)"], lng: 56.1619, lat: 26.5729 },
  {
    names: ["بریانکا", "Brianka", "Брянка"],
    country: "UA",
    lng: 38.643055555555556,
    lat: 48.513333333333335
  },
  {
    names: ["روتن", "Rüthen"],
    country: "DE",
    lng: 8.483333333333333,
    lat: 51.49333333333333
  },
  { names: ["العیون"], country: "EH", lng: -13.2, lat: 27.15 },
  {
    names: ["بیرکنفلد", "Birkenfeld"],
    country: "DE",
    lng: 7.183333333333334,
    lat: 49.65
  },
  {
    names: ["ووسکوان", "Ոսկեվան"],
    country: "AM",
    lng: 45.06527777777777,
    lat: 41.119166666666665
  },
  {
    names: ["سانتا کلارا، کالیفرنیا", "سانتا کلارا"],
    country: "US",
    lng: -121.96916666666667,
    lat: 37.35444444444445
  },
  {
    names: ["کامپوگرانده", "Campo Grande"],
    country: "BR",
    lng: -54.611111111111114,
    lat: -20.46222222222222
  },
  {
    names: ["سن ایگناسیو", "San Ignacio"],
    country: "PY",
    lng: -57.02833333333333,
    lat: -26.886666666666667
  },
  { names: ["شهرکرد", "دهکرد"], lng: 50.86491, lat: 32.325022 },
  { names: ["دهگلان", "دێولان"], lng: 47.416, lat: 35.275 },
  { names: ["دولت‌آباد (برخوار)"], lng: 51.7, lat: 32.8 },
  {
    names: ["گوکچه‌بی"],
    country: "TR",
    lng: 32.141666666666666,
    lat: 41.308055555555555
  },
  { names: ["امیدیه"], lng: 49.5411, lat: 30.8722 },
  {
    names: ["ریبنیتز-دام‌گارتن", "Ribnitz-Damgarten"],
    country: "DE",
    lng: 12.466666666666667,
    lat: 54.25
  },
  {
    names: ["باندونگ", "Kota Bandung"],
    country: "ID",
    lng: 107.6098111111111,
    lat: -6.914744444444445
  },
  {
    names: ["ارنباو"],
    country: "DE",
    lng: 10.655555555555557,
    lat: 49.17777777777778
  },
  { names: ["ماکایو"], lng: 1.6666666666666665, lat: 2.3333333333333335 },
  {
    names: ["ادفو"],
    country: "EG",
    lng: 32.873333333333335,
    lat: 24.977777777777778
  },
  {
    names: ["البلیده"],
    country: "DZ",
    lng: 2.828333333333333,
    lat: 36.47527777777778
  },
  { names: ["گلزنکیرشن"], country: "DE", lng: 7.1, lat: 51.516666666666666 },
  { names: ["آیشاخ"], country: "DE", lng: 11.133333333333333, lat: 48.45 },
  {
    names: ["کاسالنوو دی ناپولی", "Casalnuovo di Napoli"],
    country: "IT",
    lng: 14.35,
    lat: 40.916666666666664
  },
  {
    names: ["ریبرآ پرتو", "Ribeirão Preto"],
    country: "BR",
    lng: -47.806666666666665,
    lat: -21.178333333333335
  },
  {
    names: ["اون (تک)", "Owen"],
    country: "DE",
    lng: 9.451388888888888,
    lat: 48.58833333333334
  },
  {
    names: ["فیه", "Fieni"],
    country: "RO",
    lng: 25.418333333333333,
    lat: 45.12222222222222
  },
  {
    names: ["دودوما", "Dodoma"],
    country: "TZ",
    lng: 35.74194444444444,
    lat: -6.173055555555556
  },
  {
    names: ["مشانا دولنا"],
    country: "PL",
    lng: 20.066666666666666,
    lat: 49.666666666666664
  },
  {
    names: ["وارین"],
    country: "DE",
    lng: 11.683333333333334,
    lat: 53.78333333333333
  },
  {
    names: ["بینژو (شاندونگ)", "Binzhou", "滨州市"],
    country: "CN",
    lng: 118.01666666666667,
    lat: 37.36666666666667
  },
  {
    names: ["کیرشهاین", "Kirchhain"],
    country: "DE",
    lng: 8.916666666666666,
    lat: 50.81666666666667
  },
  {
    names: ["تاراوای جنوبی", "Teinainano Urban Council", "South Tarawa"],
    country: "KI",
    lng: 172.98333333333332,
    lat: 1.3255555555555556
  },
  {
    names: ["سیوداد خوارس٬ چییوایوا", "سیوداد خوارس", "Ciudad Juárez"],
    country: "MX",
    lng: -106.48694444444445,
    lat: 31.739444444444445
  },
  { names: ["گویان"], lng: -58.166666666666664, lat: 6.766666666666667 },
  {
    names: ["امندینگن"],
    country: "DE",
    lng: 7.849166666666666,
    lat: 48.12138888888889
  },
  {
    names: ["نیدن‌اشتاین"],
    country: "DE",
    lng: 9.316666666666666,
    lat: 51.233333333333334
  },
  {
    names: ["والزروده", "Walsrode"],
    country: "DE",
    lng: 9.583333333333334,
    lat: 52.86666666666667
  },
  {
    names: ["آیگشات، واغارشاپات", "آیگشات", "Այգեշատ"],
    country: "AM",
    lng: 44.28666666666666,
    lat: 40.23583333333333
  },
  {
    names: ["باندیرما", "Bandırma"],
    country: "TR",
    lng: 27.966666666666665,
    lat: 40.35
  },
  {
    names: ["آچاجور", "Աչաջուր"],
    country: "AM",
    lng: 45.14527777777778,
    lat: 40.99027777777778
  },
  {
    names: ["لراخ", "Lörrach"],
    country: "DE",
    lng: 7.666666666666667,
    lat: 47.61666666666667
  },
  {
    names: ["تاشکند", "Ташке́нт"],
    country: "UZ",
    lng: 69.21666666666667,
    lat: 41.266666666666666
  },
  {
    names: ["کویت (شهر)", "شهر کویت", "مدینه الکویت"],
    country: "KW",
    lng: 47.97833333333333,
    lat: 29.369722222222222
  },
  {
    names: ["بوپارد"],
    country: "DE",
    lng: 7.590833333333333,
    lat: 50.231388888888894
  },
  { names: ["شاباس", "Шабац", "Šabac"], country: "RS", lng: 19.7, lat: 44.75 },
  {
    names: ["گلن‌هاوزن", "Gelnhausen"],
    country: "DE",
    lng: 9.166666666666666,
    lat: 50.2
  },
  {
    names: ["درولزهاگن", "Drolshagen"],
    country: "DE",
    lng: 7.766666666666667,
    lat: 51.03333333333333
  },
  {
    names: ["شلاتین"],
    country: "EG",
    lng: 35.58555555555556,
    lat: 23.131666666666668
  },
  {
    names: ["کوخم", "Cochem"],
    country: "DE",
    lng: 7.166666666666667,
    lat: 50.14694444444444
  },
  {
    names: ["سانی‌ویل، کالیفرنیا", "سانی ویل"],
    country: "US",
    lng: -122.0261111111111,
    lat: 37.371944444444445
  },
  { names: ["جم (بوشهر)"], lng: 52.327742, lat: 27.824085 },
  {
    names: ["باسن، ارمنستان", "باسن", "Բասեն"],
    country: "AM",
    lng: 43.990833333333335,
    lat: 40.765277777777776
  },
  {
    names: ["چبینیا", "Trzebinia"],
    country: "PL",
    lng: 19.483333333333334,
    lat: 50.166666666666664
  },
  {
    names: ["ناتینگهام", "City of Nottingham"],
    country: "GB",
    lng: -1.1333333333333333,
    lat: 52.95
  },
  {
    names: ["بوشته", "Buşteni"],
    country: "RO",
    lng: 25.537222222222223,
    lat: 45.41166666666666
  },
  { names: ["لاس وگاس"], country: "US", lng: -115.1363888888889, lat: 36.175 },
  {
    names: ["آپیا", "Apia"],
    country: "WS",
    lng: -171.76666666666668,
    lat: -13.833333333333334
  },
  {
    names: ["ایپاتوفو", "Ипатово"],
    country: "RU",
    lng: 42,
    lat: 45.71666666666667
  },
  {
    names: ["ونکوور، واشینگتن", "ونکوور"],
    country: "US",
    lng: -122.60277777777777,
    lat: 45.63361111111111
  },
  {
    names: ["نورداغی"],
    country: "TR",
    lng: 36.73972222222222,
    lat: 37.178888888888885
  },
  {
    names: ["بالیک‌پاپان", "Balikpapan"],
    country: "ID",
    lng: 116.83333333333333,
    lat: -1.25
  },
  {
    names: ["صفادشت"],
    country: "IR",
    lng: 50.83972222222222,
    lat: 35.68833333333333
  },
  {
    names: ["کورولوس", "Guarulhos"],
    country: "BR",
    lng: -46.53333333333333,
    lat: -23.466666666666665
  },
  {
    names: ["آغووریک", "Աղվորիկ"],
    country: "AM",
    lng: 43.755,
    lat: 41.075833333333335
  },
  {
    names: ["ریحانلی"],
    country: "TR",
    lng: 36.56722222222223,
    lat: 36.26916666666666
  },
  { names: ["ویندزباخ"], country: "DE", lng: 10.816666666666666, lat: 49.25 },
  { names: ["میانه (شهر)"], lng: 47.72417, lat: 37.41333 },
  { names: ["زانگرهاوزن"], country: "DE", lng: 11.3, lat: 51.46666666666667 },
  { names: ["استهبان", "سابونات"], lng: 53, lat: 30 },
  {
    names: ["متسامور (روستا)", "متسامور", "Մեծամոր"],
    country: "AM",
    lng: 44.28916666666667,
    lat: 40.07138888888889
  },
  {
    names: ["گتایا", "Gătaia"],
    country: "RO",
    lng: 21.433333333333334,
    lat: 45.43333333333333
  },
  {
    names: ["لانگنبورگ"],
    country: "DE",
    lng: 9.848611111111111,
    lat: 49.25333333333333
  },
  {
    names: ["کری، کارولینای شمالی", "Cary"],
    country: "US",
    lng: -78.80027777777778,
    lat: 35.778888888888886
  },
  {
    names: ["لور، آلمان", "Lohr a.Main"],
    country: "DE",
    lng: 9.583333333333334,
    lat: 50
  },
  {
    names: ["یوزغاد", "یوزگات"],
    country: "TR",
    lng: 34.80444444444444,
    lat: 39.82
  },
  {
    names: ["مادرید", "(به اسپانیایی: Madrid)"],
    country: "ES",
    lng: -3.716666666666667,
    lat: 40.38333333333333
  },
  { names: ["هنگانگ", "鹤岗市"], country: "CN", lng: 130.3, lat: 47.35 },
  {
    names: ["بواناخ"],
    country: "DE",
    lng: 10.833333333333334,
    lat: 49.96666666666667
  },
  {
    names: ["نوراشن، آرارات", "نوراشن", "Նորաշեն"],
    country: "AM",
    lng: 44.594722222222224,
    lat: 40.00416666666667
  },
  { names: ["ورونکی"], country: "PL", lng: 16.383333333333333, lat: 52.7 },
  {
    names: ["بورشه", "Borșa"],
    country: "RO",
    lng: 24.663055555555555,
    lat: 47.655277777777776
  },
  {
    names: ["اسکاشهامن (سوید)", "اسکاشهامن"],
    country: "SE",
    lng: 16.45,
    lat: 57.265
  },
  {
    names: ["شیلتاخ"],
    country: "DE",
    lng: 8.344722222222222,
    lat: 48.29055555555556
  },
  {
    names: ["آنامور", "Anamur"],
    country: "TR",
    lng: 32.8,
    lat: 36.016666666666666
  },
  {
    names: ["هنگ کنگ", "منطقهٔ ویژهٔ اداری", "جمهوری خلق چین هنگ‌کنگ"],
    country: "AM",
    lng: 114.1588888888889,
    lat: 22.278333333333332
  },
  { names: ["هایرابولو"], country: "TR", lng: 27.1, lat: 41.213055555555556 },
  { names: ["داراب"], lng: 54.5444, lat: 28.7668 },
  { names: ["جاووشن"], country: "PL", lng: 18.87, lat: 51.117777777777775 },
  {
    names: ["باکو", "Bakı"],
    country: "AZ",
    lng: 49.882222222222225,
    lat: 40.39527777777778
  },
  {
    names: ["لوکا (ایتالیا)", "لوکا", "Lucca"],
    country: "IT",
    lng: 10.5,
    lat: 43.85
  },
  {
    names: ["آورباخ (فوکتلاند)", "آورباخ"],
    country: "DE",
    lng: 12.4,
    lat: 50.50944444444445
  },
  {
    names: ["حسن‌آباد (ری)", "حسن آباد"],
    country: "IR",
    lng: 51.23694444444445,
    lat: 35.3675
  },
  {
    names: ["دارالسلام (مصر)", "دار السلام"],
    country: "EG",
    lng: 32.05,
    lat: 26.266666666666666
  },
  {
    names: ["اشاتس"],
    country: "DE",
    lng: 13.107222222222221,
    lat: 51.30027777777777
  },
  {
    names: ["تسلوکتسوف", "Золочів", "Złoczów"],
    country: "UA",
    lng: 24.90306111111111,
    lat: 49.807491666666664
  },
  {
    names: ["جوجوان", "Ջուջևան"],
    country: "AM",
    lng: 45.01111111111111,
    lat: 41.132222222222225
  },
  { names: ["پاناما"], lng: -79.53333333333333, lat: 8.966666666666667 },
  {
    names: ["سوالیاوا", "Svaliava", "Свалява"],
    country: "UA",
    lng: 22.98611111111111,
    lat: 48.54722222222222
  },
  {
    names: ["کاتناغبیور، کوتایک", "کاتناغبیور", "Կաթնաղբյուր"],
    country: "AM",
    lng: 44.67666666666666,
    lat: 40.25611111111111
  },
  { names: ["ولگاست"], country: "DE", lng: 13.766666666666667, lat: 54.05 },
  {
    names: ["کزنتال-مونشینگن"],
    country: "DE",
    lng: 9.12138888888889,
    lat: 48.830555555555556
  },
  {
    names: ["گرشام، اورگن", "Gresham, Oregon"],
    country: "US",
    lng: -122.43944444444445,
    lat: 45.50361111111111
  },
  {
    names: ["ورین آرتاشات", "Վերին Արտաշատ"],
    country: "AM",
    lng: 44.585,
    lat: 40.00055555555556
  },
  {
    names: ["مالین", "Malyn", "Малин"],
    country: "UA",
    lng: 29.27,
    lat: 50.76888888888889
  },
  { names: ["جهرم"], lng: 53.57, lat: 28.57 },
  {
    names: ["فگره", "Făgăraș"],
    country: "RO",
    lng: 24.974166666666665,
    lat: 45.844722222222224
  },
  {
    names: ["کوسکو (شهر)", "کوسکو", "Cusco / Cuzco (Spanish)", "Qosqo (کچوآ)"],
    country: "PE",
    lng: -71.97222222222223,
    lat: -13.525
  },
  {
    names: ["هامرفست", "Hámmárfeastta gielda"],
    country: "NO",
    lng: 23.683333333333334,
    lat: 70.66250000000001
  },
  {
    names: ["آچارکوت", "Աճարկուտ"],
    country: "AM",
    lng: 45.085,
    lat: 41.03583333333333
  },
  {
    names: ["بن", "Federal City of Bonn", "Bundesstadt Bonn"],
    country: "DE",
    lng: 7.099813888888889,
    lat: 50.73399166666667
  },
  {
    names: ["باد لیبن‌اشتاین"],
    country: "DE",
    lng: 10.354166666666666,
    lat: 50.81444444444444
  },
  {
    names: ["استهوفن"],
    country: "DE",
    lng: 8.328888888888889,
    lat: 49.70777777777778
  },
  {
    names: ["مرینگن", "Moringen"],
    country: "DE",
    lng: 9.866666666666667,
    lat: 51.7
  },
  {
    names: ["استرفلد (بای ناومبورگ)", "Osterfeld"],
    country: "DE",
    lng: 11.933055555555555,
    lat: 51.07666666666667
  },
  {
    names: ["لچکادزور", "Լճկաձոր"],
    country: "AM",
    lng: 44.916666666666664,
    lat: 41.166666666666664
  },
  {
    names: ["شاهین‌دژ", "سایین‌قالا، شاهَن‌دژ و شاهان‌دژ[1]"],
    lng: 46.55,
    lat: 36.65
  },
  {
    names: ["کتسن‌البوگتن", "Katzenelnbogen"],
    country: "DE",
    lng: 7.983333333333333,
    lat: 50.266666666666666
  },
  {
    names: [
      "ریکیاویک",
      "شهر ریکیاویک",
      "(به ایسلندی: Reykjavíkurbor)",
      "(به انگلیسی: City of Reykjavik)"
    ],
    country: "IS",
    lng: -21.933333333333334,
    lat: 64.13333333333334
  },
  {
    names: ["وایلهایم آن در تک"],
    country: "DE",
    lng: 9.538611111111111,
    lat: 48.615
  },
  {
    names: ["ورنشن", "Վերնաշեն"],
    country: "AM",
    lng: 45.36333333333334,
    lat: 39.79388888888889
  },
  {
    names: ["واینزبرگ"],
    country: "DE",
    lng: 9.285694444444445,
    lat: 49.151805555555555
  },
  {
    names: ["خارطوم", "الخرطوم"],
    country: "SD",
    lng: 32.533055555555556,
    lat: 15.633055555555556
  },
  {
    names: ["استان میدیولند", "Region Midtjylland"],
    country: "DK",
    lng: 9.5,
    lat: 56.166666666666664
  },
  {
    names: ["انجیرلیوا", "İncirliova"],
    country: "TR",
    lng: 27.723611111111108,
    lat: 37.85472222222222
  },
  {
    names: ["آقچه‌قلعه (ترکیه)", "Akçakale"],
    country: "TR",
    lng: 38.94799999999999,
    lat: 36.711000000000006
  },
  {
    names: ["والدورن"],
    country: "DE",
    lng: 9.368055555555555,
    lat: 49.58305555555556
  },
  {
    names: ["باورا", "Բավրա"],
    country: "AM",
    lng: 43.77583333333333,
    lat: 41.1275
  },
  {
    names: ["رشنو", "Râșnov"],
    country: "RO",
    lng: 25.460277777777776,
    lat: 45.593333333333334
  },
  { names: ["مارکت‌لویتن"], country: "DE", lng: 12, lat: 50.11666666666667 },
  {
    names: ["هایترزهایم"],
    country: "DE",
    lng: 7.654722222222222,
    lat: 47.875277777777775
  },
  {
    names: ["یوبرابا", "Uberaba"],
    country: "BR",
    lng: -47.93333333333333,
    lat: -19.75
  },
  {
    names: ["گرابرون", "Gerabronn"],
    country: "DE",
    lng: 9.920277777777777,
    lat: 49.24944444444444
  },
  {
    names: ["آلاشهر", "Alaşehir"],
    country: "TR",
    lng: 28.516666666666666,
    lat: 38.35
  },
  {
    names: ["لاباک، تگزاس", "لاباک", "City of Lubbock"],
    country: "US",
    lng: -101.88666666666667,
    lat: 33.56638888888889
  },
  {
    names: ["تمپا، فلوریدا", "Tampa, Florida"],
    country: "US",
    lng: -82.46472222222222,
    lat: 27.97083333333333
  },
  {
    names: ["فولریدابلانکا (سانتاندر)", "فولریدابلانکا"],
    country: "CO",
    lng: -73.06666666666666,
    lat: 7.216666666666667
  },
  {
    names: ["هولتسمیندن", "Holzminden"],
    country: "DE",
    lng: 9.448333333333334,
    lat: 51.82972222222222
  },
  {
    names: ["اربوگا", "Arboga"],
    country: "SE",
    lng: 15.838611111111112,
    lat: 59.39388888888889
  },
  {
    names: ["لاخهایم"],
    country: "DE",
    lng: 10.244444444444444,
    lat: 48.87166666666667
  },
  {
    names: ["برمن", "Bremen"],
    country: "DE",
    lng: 8.8,
    lat: 53.083333333333336
  },
  {
    names: ["پورتو نووو", "پورتو نوو", "Hogbonou, Adjacé", "Porto-Novo"],
    country: "BJ",
    lng: 2.6,
    lat: 6.466666666666667
  },
  { names: ["چیلپانسینگو"], country: "MX", lng: -99.5, lat: 17.55 },
  { names: ["گرگان", "استر آباد"], lng: 54.48, lat: 36.83 },
  {
    names: ["اشلسویگ (شهر)", "Schleswig"],
    country: "DE",
    lng: 9.570277777777777,
    lat: 54.518055555555556
  },
  {
    names: ["بالاک، ارمنستان", "Բալաք"],
    country: "AM",
    lng: 45.93888888888888,
    lat: 39.54
  },
  {
    names: ["آخالکالاکی", "(به گرجی: ახალქალაქი؛", "به ارمنی: Ախալքալաք"],
    country: "GE",
    lng: 43.486111111111114,
    lat: 41.40555555555555
  },
  {
    names: ["مانزانیلو"],
    country: "MX",
    lng: -104.31583333333333,
    lat: 19.052222222222223
  },
  {
    names: ["والترس‌هاوزن"],
    country: "DE",
    lng: 10.555833333333334,
    lat: 50.8975
  },
  { names: ["رودا شلوسکا"], country: "PL", lng: 18.7, lat: 50.266666666666666 },
  {
    names: ["گلندیل (کالیفرنیا)"],
    country: "",
    lng: -118.25,
    lat: 34.170833333333334
  },
  {
    names: ["بورگ اشتارگارد"],
    country: "DE",
    lng: 13.3,
    lat: 53.483333333333334
  },
  {
    names: ["شواباخ"],
    country: "DE",
    lng: 11.020833333333334,
    lat: 49.32916666666667
  },
  {
    names: ["هرب ام نکا"],
    country: "DE",
    lng: 8.69111111111111,
    lat: 48.445277777777775
  },
  {
    names: ["وست کووینا، کالیفرنیا"],
    country: "US",
    lng: -117.91861111111112,
    lat: 34.056666666666665
  },
  {
    names: ["چرسک"],
    country: "PL",
    lng: 17.973888888888887,
    lat: 53.79277777777778
  },
  {
    names: ["سیگتو مرمتسیه", "Sighetu Marmației"],
    country: "RO",
    lng: 23.8925,
    lat: 47.92861111111111
  },
  { names: ["هرسین"], lng: 47.5806, lat: 34.2719 },
  {
    names: ["وینتربرگ", "Winterberg"],
    country: "DE",
    lng: 8.516666666666667,
    lat: 51.2
  },
  {
    names: ["بورلادینگن"],
    country: "DE",
    lng: 9.109444444444444,
    lat: 48.290277777777774
  },
  { names: ["کمبریج"], country: "GB", lng: -0.1225, lat: 52.20805555555556 },
  {
    names: ["لندزبرگ، زاکسن-آنهالت", "Landsberg"],
    country: "DE",
    lng: 12.166666666666666,
    lat: 51.53333333333333
  },
  {
    names: ["گارلند، تگزاس", "Garland, Texas"],
    country: "US",
    lng: -96.63527777777779,
    lat: 32.907222222222224
  },
  {
    names: ["یینگکو", "营口市"],
    country: "CN",
    lng: 122.23333333333333,
    lat: 40.666666666666664
  },
  {
    names: ["وییاماریا", "Villamaría, Caldas"],
    country: "CO",
    lng: -75.51555555555555,
    lat: 5.097777777777777
  },
  { names: ["شوایش"], country: "DE", lng: 6.752222222222223, lat: 49.82 },
  {
    names: ["ترگو کربونشت", "Târgu Cărbunești"],
    country: "RO",
    lng: 23.50638888888889,
    lat: 44.958333333333336
  },
  { names: ["قرامان"], country: "TR", lng: 33.215, lat: 37.18111111111111 },
  {
    names: ["دومبروه", "Dumbrăveni"],
    country: "RO",
    lng: 24.575833333333332,
    lat: 46.2275
  },
  {
    names: ["سلوبوزیا", "Slobozia"],
    country: "RO",
    lng: 27.366111111111113,
    lat: 44.56388888888888
  },
  {
    names: ["بخارست", "București", "Buchares"],
    country: "RO",
    lng: 26.1,
    lat: 44.416666666666664
  },
  { names: ["شفاعت‌لی", "Şefaatli"], country: "TR", lng: 34.75, lat: 39.5 },
  {
    names: ["مندوسا، آرژانتین", "مندوزا", "Mendoza"],
    country: "AR",
    lng: -68.81666666666666,
    lat: -32.88333333333333
  },
  { names: ["منهایم آم راین"], country: "DE", lng: 6.9, lat: 51.1 },
  {
    names: ["وایله", "Vejle"],
    country: "DK",
    lng: 9.533333333333333,
    lat: 55.71666666666667
  },
  {
    names: ["ارلنباخ آم ماین", "Erlenbach a.Main"],
    country: "DE",
    lng: 9.16388888888889,
    lat: 49.803888888888885
  },
  { names: ["زالتسگیتر"], country: "DE", lng: 10.333333333333334, lat: 52.15 },
  {
    names: ["ابریشم (شهر)", "حسن‌آباد و باغ ابریشم و یزداباد"],
    lng: 51.5731,
    lat: 32.555
  },
  {
    names: ["ویت‌اشتوک"],
    country: "DE",
    lng: 12.485555555555555,
    lat: 53.16361111111111
  },
  {
    names: ["تاندزوت، آرماویر", "تاندزوت", "Տանձուտ"],
    country: "AM",
    lng: 44.08861111111111,
    lat: 40.077222222222225
  },
  {
    names: ["فورنباخ"],
    country: "DE",
    lng: 8.304166666666667,
    lat: 48.04555555555555
  },
  {
    names: ["مینبورگ (پریگنیتس)"],
    country: "DE",
    lng: 12.233055555555556,
    lat: 53.31666666666667
  },
  {
    names: ["ایروان", "Երևան", "Yerevan"],
    country: "AM",
    lng: 44.516666666666666,
    lat: 40.18333333333333
  },
  {
    names: ["لاینه‌فلده-وربیس"],
    country: "DE",
    lng: 10.333333333333334,
    lat: 51.38333333333333
  },
  {
    names: ["رایشنباخ (اوبرلازیتز)", "Reichenbach"],
    country: "DE",
    lng: 14.8,
    lat: 51.141666666666666
  },
  {
    names: ["بن", "Federal City of Bonn", "Bundesstadt Bonn"],
    country: "DE",
    lng: 7.099813888888889,
    lat: 50.73399166666667
  },
  { names: ["لیدینیا"], country: "SE", lng: 18.15, lat: 59.36666666666667 },
  { names: ["آبدانان", "یاوه نو[نیازمند منبع]"], lng: 47.52, lat: 32.59 },
  {
    names: ["زلوف"],
    country: "PL",
    lng: 19.216666666666665,
    lat: 51.46666666666667
  },
  {
    names: ["آراجادزور", "Առաջաձոր"],
    country: "AM",
    lng: 46.3725,
    lat: 39.26222222222222
  },
  {
    names: ["مونترآل", "Montréal"],
    country: "CA",
    lng: -73.65,
    lat: 45.516666666666666
  },
  {
    names: ["مونکتون", "مانکتون"],
    country: "CA",
    lng: -64.7713888888889,
    lat: 46.132777777777775
  },
  {
    names: ["آکسنارد، کالیفرنیا", "اوکس نارد"],
    country: "US",
    lng: -119.1825,
    lat: 34.19138888888889
  },
  {
    names: ["کیتسشر"],
    country: "DE",
    lng: 12.553500000000001,
    lat: 51.164474999999996
  },
  {
    names: ["نورآباد (دلفان)", "«نویرآباد»، «نویرآووا»"],
    lng: 47.97,
    lat: 34.08
  },
  {
    names: ["موناکوویل", "موناکو-ویل", "Monaco-Ville"],
    country: "MC",
    lng: 7.4225,
    lat: 43.73083333333334
  },
  { names: ["جوانرود", "جوانرو"], lng: 46.5172, lat: 34.7961 },
  {
    names: ["بشار، الجزایر", "بشار", "ⴱⴻⵛⵛⴰⵔ"],
    country: "DZ",
    lng: -2.216666666666667,
    lat: 31.616666666666667
  },
  {
    names: ["جزایر جورجیای جنوبی و ساندویچ جنوبی"],
    lng: -66.96666666666667,
    lat: 10.5
  },
  {
    names: ["لا ویکتوریا"],
    country: "CO",
    lng: -71.22277777777778,
    lat: 0.051388888888888894
  },
  {
    names: ["استان هوودستادن", "Region Hovedstaden"],
    country: "DK",
    lng: 12.3,
    lat: 55.93983333333333
  },
  {
    names: ["برازاویل", "Brazzaville"],
    country: "CG",
    lng: 15.291944444444445,
    lat: -4.267777777777778
  },
  {
    names: ["بایودینگ", "保定市"],
    country: "CN",
    lng: 115.46666666666667,
    lat: 38.86666666666667
  },
  { names: ["کایفنگ", "开封市"], country: "CN", lng: 114.3, lat: 34.8 },
  {
    names: ["ادمزتون، پیتکرن ایسلند", "Adamstown"],
    country: "PN",
    lng: -130.1,
    lat: -25.066666666666666
  },
  {
    names: ["اواراز", "Huaraz", "San Sebastian de Huaraz"],
    country: "PE",
    lng: -77.53333333333333,
    lat: -9.533333333333333
  },
  { names: ["وایلبورگ"], country: "DE", lng: 8.25, lat: 50.483333333333334 },
  {
    names: ["فیصل‌آباد", "فیصل آباد"],
    country: "PK",
    lng: 73.0911111111111,
    lat: 31.416666666666668
  },
  {
    names: ["بروخکوبل", "Bruchköbel"],
    country: "DE",
    lng: 8.916666666666666,
    lat: 50.18333333333333
  },
  {
    names: ["چوراتان", "Չորաթան"],
    country: "AM",
    lng: 45.480000000000004,
    lat: 40.861111111111114
  },
  { names: ["هاوتسبرگ"], country: "DE", lng: 13.633333333333333, lat: 48.65 },
  {
    names: ["بواناتال", "Baunatal"],
    country: "DE",
    lng: 9.418333333333333,
    lat: 51.25888888888889
  },
  {
    names: ["رووانیمی", "Rovaniemi"],
    country: "FI",
    lng: 25.733333333333334,
    lat: 66.5
  },
  {
    names: ["عجمان", "اماره عجمانّ"],
    country: "AE",
    lng: 55.5,
    lat: 25.416666666666668
  },
  {
    names: ["وانگن در آلگوی"],
    country: "DE",
    lng: 9.834166666666667,
    lat: 47.68583333333333
  },
  { names: ["اپلهایم"], country: "DE", lng: 8.633333333333333, lat: 49.4 },
  {
    names: ["داندونگ", "丹东市"],
    country: "CN",
    lng: 124.38333333333334,
    lat: 40.11666666666667
  },
  {
    names: ["کلوه", "Kleve"],
    country: "DE",
    lng: 6.1352777777777785,
    lat: 51.7875
  },
  {
    names: ["وایمار"],
    country: "DE",
    lng: 11.316666666666666,
    lat: 50.983333333333334
  },
  {
    names: ["نورشن، شیراک", "Նորշեն"],
    country: "AM",
    lng: 44.044444444444444,
    lat: 40.64861111111111
  },
  {
    names: ["هارتاگیوغ", "Հարթագյուղ"],
    country: "AM",
    lng: 44.04666666666667,
    lat: 40.83555555555556
  },
  {
    names: ["پچیکه", "Pecica", "Pécska"],
    country: "RO",
    lng: 21.07,
    lat: 46.169999999999995
  },
  {
    names: ["نژده، ارمنستان", "Նժդեհ"],
    country: "AM",
    lng: 45.99611111111111,
    lat: 39.375277777777775
  },
  {
    names: ["آرلینگتون، تگزاس", "Arlington, Texas"],
    country: "US",
    lng: -97.12277777777777,
    lat: 32.705000000000005
  },
  {
    names: ["پادنگ، اندونزی", "پادنگ", ""],
    country: "ID",
    lng: 100.35305555555556,
    lat: -0.95
  },
  {
    names: ["ممفیس، تنسی", "Memphis, Tennessee"],
    country: "US",
    lng: -89.97111111111111,
    lat: 35.1175
  },
  {
    names: ["آتن، جورجیا", "Athens, Georgia"],
    country: "US",
    lng: -83.38333333333334,
    lat: 33.95
  },
  {
    names: ["باد مونسر آن در اشتاین-ارنبورگ"],
    country: "DE",
    lng: 7.8438888888888885,
    lat: 49.80916666666666
  },
  {
    names: ["ریوبامبا"],
    country: "EC",
    lng: -78.64829444444445,
    lat: -1.674347222222222
  },
  {
    names: ["هایلیگن‌هافن"],
    country: "DE",
    lng: 10.979722222222222,
    lat: 54.37388888888889
  },
  {
    names: ["وال د چالکو سولیداریداد"],
    country: "MX",
    lng: -98.9388888888889,
    lat: 19.291666666666668
  },
  {
    names: ["مدینه", "اَلْمَدِینَه اَلْمَنَوَّرَه"],
    country: "SA",
    lng: 39.6,
    lat: 24.466666666666665
  },
  {
    names: ["کاله (فرانسه)", "کاله"],
    country: "FR",
    lng: 1.856388888888889,
    lat: 50.948055555555555
  },
  {
    names: ["کرتارو سیتی", "کرتارو"],
    country: "MX",
    lng: -100.39277777777778,
    lat: 20.5875
  },
  {
    names: ["عین وساره، الجزایر", "Aïn Oussera"],
    country: "DZ",
    lng: 2.904444444444444,
    lat: 35.44888888888889
  },
  {
    names: ["نیوآرک، نیوجرسی", "نیوآرک", "Newark"],
    country: "US",
    lng: -74.185,
    lat: 40.73527777777778
  },
  {
    names: ["آندیرلین"],
    country: "TR",
    lng: 36.35055555555556,
    lat: 37.57638888888889
  },
  {
    names: ["یوترسن"],
    country: "DE",
    lng: 9.669166666666666,
    lat: 53.68722222222222
  },
  {
    names: ["امان", "عمّان"],
    country: "JO",
    lng: 35.93277777777777,
    lat: 31.949722222222224
  },
  {
    names: ["یوگیاکارتا", "Kota Yogyakarta"],
    country: "ID",
    lng: 110.36444444444444,
    lat: -7.801388888888889
  },
  {
    names: ["آپوداکا"],
    country: "MX",
    lng: -100.18333333333334,
    lat: 25.783333333333335
  },
  {
    names: ["چشمه (شهر)", "Çeşme"],
    country: "TR",
    lng: 26.3,
    lat: 38.31666666666667
  },
  {
    names: ["لاپاز (بولیوی)", "لاپاز", "La Paz"],
    country: "BO",
    lng: -68.15,
    lat: -16.5
  },
  {
    names: ["املزهاوزن"],
    country: "DE",
    lng: 7.555833333333333,
    lat: 50.155833333333334
  },
  {
    names: ["ماپوتو", "Maputo", "Lourenço Marques"],
    country: "MZ",
    lng: 32.583333333333336,
    lat: -25.966666666666665
  },
  {
    names: ["ویدله", "Videle"],
    country: "RO",
    lng: 25.533333333333335,
    lat: 44.28333333333333
  },
  {
    names: ["لونه، نوردراین-وستفالن", "Löhne"],
    country: "DE",
    lng: 8.7,
    lat: 52.2
  },
  {
    names: ["اسپینال", "El Espinal", "Santa Bárbara de El Espinal"],
    country: "CO",
    lng: -74.88861111111112,
    lat: 4.152777777777779
  },
  {
    names: ["گوبن"],
    country: "DE",
    lng: 14.716666666666667,
    lat: 51.95333333333333
  },
  {
    names: ["میندلهایم"],
    country: "DE",
    lng: 10.466666666666667,
    lat: 48.03333333333333
  },
  {
    names: ["ناسایو", "Nassau"],
    country: "BS",
    lng: -77.33333333333333,
    lat: 25.066666666666666
  },
  { names: ["گوشتن"], country: "DE", lng: 11.61, lat: 51.79722222222222 },
  {
    names: ["خون کاین", "ขอนแก่น"],
    country: "TH",
    lng: 102.83333333333333,
    lat: 16.433333333333334
  },
  {
    names: ["روستاوی", "რუსთავი"],
    country: "GE",
    lng: 45,
    lat: 41.53333333333333
  },
  {
    names: ["یالی‌کاواک", "Yalikavak"],
    country: "TR",
    lng: 27.282143,
    lat: 37.10886
  },
  {
    names: ["برگکامن"],
    country: "DE",
    lng: 7.633333333333333,
    lat: 51.61666666666667
  },
  { names: ["بندر امام خمینی"], lng: 49.0153733, lat: 30.5652777 },
  {
    names: ["اورومچی", "乌鲁木齐市 · یۈرۈمچی شه‌هیری"],
    country: "CN",
    lng: 87.6,
    lat: 43.825
  },
  {
    names: ["کالیش"],
    country: "PL",
    lng: 18.083333333333332,
    lat: 51.766666666666666
  },
  {
    names: ["تساغکابر", "Ծաղկաբեր"],
    country: "AM",
    lng: 44.10722222222223,
    lat: 40.79861111111111
  },
  {
    names: ["نویکیرشن (سار)", "Neunkirchen"],
    country: "DE",
    lng: 7.166666666666667,
    lat: 49.35
  },
  {
    names: ["قاهره", "Cairo", "القاهره"],
    country: "EG",
    lng: 31.228888888888886,
    lat: 30.058055555555555
  },
  { names: ["سنت لوسیا"], lng: -60.983333333333334, lat: 14.016666666666667 },
  {
    names: ["سویا (شهر)", "سبیا", "(به اسپانیایی: Sevilla)"],
    country: "ES",
    lng: -5.986944444444444,
    lat: 37.37722222222222
  },
  { names: ["آنتیگوآ و باربودا"], lng: -61.85, lat: 17.116666666666667 },
  { names: ["آیولاس", "Ayolas"], country: "PY", lng: -56.9, lat: -27.4 },
  {
    names: ["لیتل راک، آرکانزاس"],
    country: "US",
    lng: -92.33111111111111,
    lat: 34.736111111111114
  },
  { names: ["چرنیهیف", "Чернігів"], country: "UA", lng: 31.3, lat: 51.5 },
  {
    names: ["سانتو دومینگو", "Santo Domingo"],
    country: "DO",
    lng: -69.98333333333333,
    lat: 18.5
  },
  {
    names: ["ملگار (تولیما)", "Melgar"],
    country: "CO",
    lng: -74.64277777777778,
    lat: 4.203888888888889
  },
  {
    names: ["آروشات، آرارات", "آروشات", "Արևշատ"],
    country: "AM",
    lng: 44.541666666666664,
    lat: 40.03916666666667
  },
  {
    names: ["اشنفردینگن", "Schneverdingen"],
    country: "DE",
    lng: 9.8,
    lat: 53.11666666666667
  },
  {
    names: ["اسکورچ"],
    country: "PL",
    lng: 18.52611111111111,
    lat: 53.79666666666667
  },
  { names: ["بانه"], lng: 45.8953, lat: 35.9894 },
  {
    names: ["موسینگن"],
    country: "DE",
    lng: 9.057500000000001,
    lat: 48.406388888888884
  },
  {
    names: ["کواوتیتلان"],
    country: "MX",
    lng: -99.18055555555556,
    lat: 19.672222222222224
  },
  {
    names: ["ارواین، کالیفرنیا", "ارواین", "Irvine"],
    country: "US",
    lng: -117.7925,
    lat: 33.68416666666666
  },
  {
    names: ["آمباتو، اکوادور", "San Juan Bautista de Ambato"],
    country: "EC",
    lng: -78.61972222222222,
    lat: -1.2416666666666667
  },
  {
    names: ["نویمارکت این در اوبرفالتز"],
    country: "DE",
    lng: 11.466666666666667,
    lat: 49.28333333333333
  },
  {
    names: ["بورسا"],
    country: "TR",
    lng: 29.066666666666666,
    lat: 40.18333333333333
  },
  { names: ["باد کونیش"], country: "DE", lng: 9.016666666666667, lat: 49.75 },
  {
    names: ["راندرس", "Randers"],
    country: "DK",
    lng: 10.05,
    lat: 56.46666666666667
  },
  {
    names: ["سوکه", "Söke"],
    country: "TR",
    lng: 27.410277777777775,
    lat: 37.75083333333333
  },
  {
    names: ["مالابو", "Malabo"],
    country: "GQ",
    lng: 8.766666666666667,
    lat: 3.75
  },
  {
    names: ["آینبک", "Einbeck"],
    country: "DE",
    lng: 9.866666666666667,
    lat: 51.81666666666667
  },
  {
    names: ["باد زوندن آن در تاونوس"],
    country: "DE",
    lng: 8.5,
    lat: 50.13333333333333
  },
  {
    names: ["تمپا، فلوریدا", "Tampa, Florida"],
    country: "US",
    lng: -82.46472222222222,
    lat: 27.97083333333333
  },
  {
    names: ["جیل، ارمنستان", "جیل", "Ջիլ"],
    country: "AM",
    lng: 45.453611111111115,
    lat: 40.45444444444445
  },
  {
    names: ["شرامبرگ"],
    country: "DE",
    lng: 8.384166666666665,
    lat: 48.22694444444445
  },
  {
    names: ["هایکاشن، ارمنستان", "هایکاشن", "Հայկաշեն"],
    country: "AM",
    lng: 44.30694444444444,
    lat: 40.07277777777778
  },
  {
    names: ["ششم اکتبر (شهر)", "ششم اکتبر", "السادس من اکتوبر"],
    country: "EG",
    lng: 30.966666666666665,
    lat: 29.983333333333334
  },
  {
    names: ["کوردوبا، آرژانتین", "کوردوبا", "Córdoba"],
    country: "AR",
    lng: -64.18333333333334,
    lat: -31.416666666666668
  },
  {
    names: ["هاتساوان، سیونیک", "هاتساوان", "Հացավան"],
    country: "AM",
    lng: 45.973055555555554,
    lat: 39.46277777777778
  },
  {
    names: ["سنتنیال، کلرادو", "سنتنیال"],
    country: "US",
    lng: -104.84388888888888,
    lat: 39.59638888888889
  },
  {
    names: ["مولتان", "مُلتان"],
    country: "PK",
    lng: 71.46972222222223,
    lat: 30.197777777777777
  },
  {
    names: ["ارمنت"],
    country: "EG",
    lng: 32.53333333333333,
    lat: 25.616666666666667
  },
  {
    names: ["سانتا کروس ده لوریکا", "Santa Cruz de Lorica", "Loriquero/a"],
    country: "CO",
    lng: -75.81972222222223,
    lat: 9.231666666666667
  },
  {
    names: ["واناند، آرماویر", "واناند", "Վանանդ"],
    country: "AM",
    lng: 43.81666666666667,
    lat: 40.13333333333333
  },
  {
    names: ["دینگل‌اشتت"],
    country: "DE",
    lng: 10.319444444444445,
    lat: 51.315555555555555
  },
  {
    names: ["قلیوب"],
    country: "EG",
    lng: 31.205277777777777,
    lat: 30.199722222222224
  },
  {
    names: ["کلگری", "کَلگِری", "Calgary"],
    country: "CA",
    lng: -114.05722222222222,
    lat: 51.044999999999995
  },
  {
    names: ["کادوقلی", "کادقلی"],
    country: "SD",
    lng: 29.716666666666665,
    lat: 11.016666666666667
  },
  {
    names: ["کاربی", "Կարբի"],
    country: "AM",
    lng: 44.37638888888889,
    lat: 40.33111111111111
  },
  {
    names: ["وردل", "Werdohl"],
    country: "DE",
    lng: 7.766666666666667,
    lat: 51.266666666666666
  },
  {
    names: ["ترناوه", "Târnăveni"],
    country: "RO",
    lng: 24.27,
    lat: 46.32972222222222
  },
  { names: ["الجزیره"], country: "DZ", lng: 3.216666666666667, lat: 36.7 },
  {
    names: ["ماناگویه", "ماناگوآ", "Santiago de Managua"],
    country: "NI",
    lng: -86.25138888888888,
    lat: 12.136388888888888
  },
  {
    names: ["ولیمشه", "Velimeşe"],
    country: "TR",
    lng: 27.883333333333333,
    lat: 41.25
  },
  {
    names: ["سیورودونتسک", "Severodonetsk", "Сєвєродонецьк", "Северодонецк"],
    country: "UA",
    lng: 38.5,
    lat: 48.93333333333333
  },
  {
    names: ["آرپی، ارمنستان", "آرپی", "Արփի"],
    country: "AM",
    lng: 45.26166666666666,
    lat: 39.73916666666667
  },
  {
    names: ["هانوفر", "Hannover"],
    country: "DE",
    lng: 9.716666666666667,
    lat: 52.36666666666667
  },
  { names: ["باد برکا"], country: "DE", lng: 11.280833333333334, lat: 50.9 },
  {
    names: ["فارکیرشن"],
    country: "DE",
    lng: 12.916666666666666,
    lat: 48.416666666666664
  },
  {
    names: ["هلسینکی", "Helsingin kaupunki", "Helsingfors stad"],
    country: "FI",
    lng: 24.9375,
    lat: 60.170833333333334
  },
  {
    names: ["وانفرید", "Wanfried"],
    country: "DE",
    lng: 10.166666666666666,
    lat: 51.18333333333333
  },
  {
    names: ["گومک", "Գոմք"],
    country: "AM",
    lng: 45.56916666666667,
    lat: 39.629444444444445
  },
  {
    names: ["گاردینگ"],
    country: "DE",
    lng: 8.780555555555557,
    lat: 54.330555555555556
  },
  { names: ["مشکین‌دشت", "مشکین اباد"], lng: 50.9511, lat: 35.7458 },
  { names: ["زابل"], lng: 61.4978, lat: 31.0297 },
  {
    names: ["دیپهولز", "Diepholz"],
    country: "DE",
    lng: 8.371111111111112,
    lat: 52.60722222222223
  },
  {
    names: ["لوما", "Lomma"],
    country: "SE",
    lng: 13.083333333333334,
    lat: 55.666666666666664
  },
  {
    names: ["ناگاساکی (بندر)", "ناگاساکی", "長崎"],
    country: "JP",
    lng: 129.86666666666667,
    lat: 32.78333333333333
  },
  { names: ["بندر دیر", "دَیّر"], lng: 51.937609, lat: 27.838773 },
  {
    names: ["رزنهایم", "Rosenheim"],
    country: "DE",
    lng: 12.133333333333333,
    lat: 47.85
  },
  {
    names: ["والدکیرشن"],
    country: "DE",
    lng: 13.601138888888888,
    lat: 48.73047777777778
  },
  {
    names: ["بایرسدورف (شهر)", "Baiersdorf"],
    country: "DE",
    lng: 11.016666666666667,
    lat: 49.65
  },
  {
    names: ["ارموسییو، سونورا", "ارموسییو", "Hermosillo"],
    country: "MX",
    lng: -110.95416666666667,
    lat: 29.098888888888887
  },
  {
    names: ["وزل", "Wesel"],
    country: "DE",
    lng: 6.617777777777778,
    lat: 51.65861111111111
  },
  {
    names: ["یوله", "Gävle"],
    country: "SE",
    lng: 17.141666666666666,
    lat: 60.67472222222222
  },
  {
    names: ["ینی‌جکوی", "Yeniceköy"],
    country: "TR",
    lng: 29.416666666666668,
    lat: 40.083333333333336
  },
  {
    names: ["تغنیک", "Թեղենիք"],
    country: "AM",
    lng: 44.57555555555556,
    lat: 40.42388888888889
  },
  {
    names: ["مار دل پلاتا", "Mar del Plata"],
    country: "AR",
    lng: -57.55,
    lat: -38
  },
  {
    names: ["دونسکوی، استان تولا", "Донской"],
    country: "RU",
    lng: 38.32472222222223,
    lat: 53.965833333333336
  },
  {
    names: ["مارسی", "Ville de Marseille"],
    country: "FR",
    lng: 5.369999999999999,
    lat: 43.296388888888885
  },
  {
    names: ["گغاماباک", "Գեղամաբակ"],
    country: "AM",
    lng: 45.805,
    lat: 40.16444444444444
  },
  { names: ["رهاو"], country: "DE", lng: 12.016666666666667, lat: 50.25 },
  {
    names: ["آلاشکرت، ارمنستان", "آلاشکرت", "Ալաշկերտ"],
    country: "AM",
    lng: 44.055277777777775,
    lat: 40.11333333333334
  },
  {
    names: ["شیراکاموت", "Շիրակամուտ"],
    country: "AM",
    lng: 44.15277777777778,
    lat: 40.86055555555556
  },
  {
    names: ["سالیناس، کالیفرنیا", "سالیناس"],
    country: "US",
    lng: -121.65555555555557,
    lat: 36.67777777777778
  },
  {
    names: ["راچستر، نیویورک", "راچستر", "Rochester, New York"],
    country: "US",
    lng: -77.61138888888888,
    lat: 43.16555555555556
  },
  {
    names: ["ایری، پنسیلوانیا"],
    country: "US",
    lng: -80.08521388888889,
    lat: 42.12956111111111
  },
  { names: ["قری‌خان"], country: "TR", lng: 36.36083333333333, lat: 36.4975 },
  { names: ["خوت", "Խոտ"], country: "AM", lng: 46.336111111111116, lat: 39.44 },
  {
    names: ["پیوریا، آریزونا"],
    country: "US",
    lng: -112.23861111111111,
    lat: 33.5825
  },
  {
    names: ["استری، اوکراین", "Stryi", "Стрий", "Stryj"],
    country: "UA",
    lng: 23.85027777777778,
    lat: 49.25611111111111
  },
  {
    names: ["زاریتاپ", "Զառիթափ"],
    country: "AM",
    lng: 45.50861111111111,
    lat: 39.63722222222222
  },
  {
    names: ["ملیتوپول", "Melitopol", "Мелітополь"],
    country: "UA",
    lng: 35.36666666666667,
    lat: 46.833333333333336
  },
  { names: ["اتینگن"], country: "DE", lng: 10.583333333333334, lat: 48.95 },
  {
    names: ["ماییسیان", "Մայիսյան"],
    country: "AM",
    lng: 43.82944444444445,
    lat: 40.85305555555556
  },
  {
    names: ["نکاربیشوفزهایم"],
    country: "DE",
    lng: 8.960555555555555,
    lat: 49.2925
  },
  { names: ["گتامچ", "Գետամեջ"], country: "AM", lng: 44.585, lat: 40.275 },
  {
    names: ["آشتاراک", "Աշտարակ"],
    country: "AM",
    lng: 44.361666666666665,
    lat: 40.2975
  },
  { names: ["یزد", "نام محلی:یـَـز"], lng: 54.3675, lat: 31.8972 },
  {
    names: ["آیوالیک", "Ayvalık"],
    country: "TR",
    lng: 26.694444444444446,
    lat: 39.31944444444445
  },
  {
    names: ["فرزنو، کالیفرنیا", "فرزنو"],
    country: "US",
    lng: -119.7725,
    lat: 36.74777777777778
  },
  {
    names: ["نوراباتس", "Նորաբաց"],
    country: "AM",
    lng: 44.43,
    lat: 40.10527777777778
  },
  {
    names: ["ریو براوو، تامایولیپاس", "El pueblo de la Virgen del Rio Bravo"],
    country: "MX",
    lng: -98.08888888888889,
    lat: 25.98611111111111
  },
  {
    names: ["ارنساند"],
    country: "SE",
    lng: 17.941111111111113,
    lat: 62.63611111111111
  },
  { names: ["تولتپک"], country: "MX", lng: -99.12805555555555, lat: 19.685 },
  {
    names: ["داخاو"],
    country: "DE",
    lng: 11.434166666666666,
    lat: 48.26027777777778
  },
  {
    names: ["وتر (رور)"],
    country: "DE",
    lng: 7.3950000000000005,
    lat: 51.38805555555555
  },
  {
    names: ["لیمپیو", "Limpio"],
    country: "PY",
    lng: -57.494166666666665,
    lat: -25.168333333333333
  },
  {
    names: ["هارتاشن", "Հարթաշեն"],
    country: "AM",
    lng: 43.922777777777775,
    lat: 41.00944444444445
  },
  {
    names: ["اوبرریکسینگن"],
    country: "DE",
    lng: 9.028055555555556,
    lat: 48.925555555555555
  },
  {
    names: ["لیون", "Lyon"],
    country: "FR",
    lng: 4.8422222222222215,
    lat: 45.75972222222222
  },
  {
    names: ["مارباخ آم نکا", "Marbach am Neckar"],
    country: "DE",
    lng: 9.25,
    lat: 48.93333333333333
  },
  {
    names: ["وانتا", "Vantaa – Vanda"],
    country: "FI",
    lng: 25.040277777777778,
    lat: 60.294444444444444
  },
  { names: ["خوژوف"], country: "PL", lng: 18.95, lat: 50.3 },
  {
    names: ["واردنوت", "Վարդենուտ"],
    country: "AM",
    lng: 44.36527777777778,
    lat: 40.470555555555556
  },
  { names: ["سان مارینو"], lng: 12.033333333333333, lat: 43.93333333333333 },
  {
    names: ["هیلسهایم", "Hillesheim"],
    country: "DE",
    lng: 6.675000000000001,
    lat: 50.293055555555554
  },
  { names: ["بروملا"], country: "SE", lng: 14.466666666666667, lat: 56.05 },
  {
    names: ["گورلی", "Görele"],
    country: "TR",
    lng: 39.03333333333333,
    lat: 41.03333333333333
  },
  {
    names: ["کوتبوس"],
    country: "DE",
    lng: 14.334166666666667,
    lat: 51.760555555555555
  },
  { names: ["بریستول"], country: "GB", lng: -2.5833333333333335, lat: 51.45 },
  {
    names: ["نیژین", "Nizhyn", "Ніжин"],
    country: "UA",
    lng: 31.88611111111111,
    lat: 51.03805555555555
  },
  {
    names: ["تورنتو", "Toronto"],
    country: "CA",
    lng: -79.34068611111111,
    lat: 43.71658888888889
  },
  {
    names: ["تویپیتز"],
    country: "DE",
    lng: 13.616666666666667,
    lat: 52.11666666666667
  },
  {
    names: ["آلتناو", "Altenau"],
    country: "DE",
    lng: 10.445555555555556,
    lat: 51.80277777777778
  },
  {
    names: ["هنگ کنگ", "منطقهٔ ویژهٔ اداری", "جمهوری خلق چین هنگ‌کنگ"],
    country: "AM",
    lng: 114.1588888888889,
    lat: 22.278333333333332
  },
  {
    names: ["وینندن"],
    country: "DE",
    lng: 9.397777777777778,
    lat: 48.87638888888889
  },
  {
    names: ["دورتموند"],
    country: "DE",
    lng: 7.466666666666667,
    lat: 51.516666666666666
  },
  {
    names: ["ممفیس، تنسی", "Memphis, Tennessee"],
    country: "US",
    lng: -89.97111111111111,
    lat: 35.1175
  },
  {
    names: ["بوستون", "Boston"],
    country: "US",
    lng: -71.06166666666667,
    lat: 42.35777777777778
  },
  { names: ["اوزینگن"], country: "DE", lng: 8.5375, lat: 50.33444444444444 },
  { names: ["ایگوالا"], country: "MX", lng: -99.53333333333333, lat: 18.35 },
  { names: ["هفشجان", "هوشنگان"], lng: 50.4706, lat: 32.1353 },
  {
    names: ["وروتان (سیسیان)", "Որոտան"],
    country: "AM",
    lng: 46.14138888888889,
    lat: 39.48861111111111
  },
  {
    names: ["گتاتاغ", "Գետաթաղ"],
    country: "AM",
    lng: 46.12138888888889,
    lat: 39.42472222222222
  },
  {
    names: ["کلرادو اسپرینگز، کلرادو", "Colorado Springs, Colorado"],
    country: "US",
    lng: -104.79194444444444,
    lat: 38.86333333333334
  },
  {
    names: ["نیبرو", "Nybro"],
    country: "SE",
    lng: 15.9,
    lat: 56.733333333333334
  },
  {
    names: ["هوناز", "Honaz"],
    country: "TR",
    lng: 29.264069444444445,
    lat: 37.757641666666665
  },
  {
    names: ["هال‌اشتات (بایرن)"],
    country: "DE",
    lng: 10.883333333333333,
    lat: 49.93333333333333
  },
  {
    names: ["پردا", "Predeal"],
    country: "RO",
    lng: 25.578333333333333,
    lat: 45.504444444444445
  },
  {
    names: ["فولرتون، کالیفرنیا", "City of Fullerton"],
    country: "US",
    lng: -117.92861111111111,
    lat: 33.88
  },
  {
    names: ["پولکوویسته (لهستان)", "پولکوویسته"],
    country: "PL",
    lng: 16.066666666666666,
    lat: 51.5
  },
  {
    names: ["هواینان", "淮南市"],
    lng: 116.98333333333333,
    lat: 32.61666666666667
  },
  {
    names: ["اورورو", "Uru Uru"],
    country: "BO",
    lng: -67.11666666666666,
    lat: -17.966666666666665
  },
  {
    names: ["ساوت‌همپتون", "Southampton"],
    country: "GB",
    lng: -1.40416,
    lat: 50.89696
  },
  { names: ["چانگچون", "长春市"], country: "CN", lng: 125.2, lat: 43.9 },
  {
    names: ["آیزنبرگ (تورینگن)", "Eisenberg"],
    country: "DE",
    lng: 11.9,
    lat: 50.96666666666667
  },
  {
    names: ["ژنگژو", "郑州市"],
    country: "CN",
    lng: 113.65,
    lat: 34.766666666666666
  },
  {
    names: ["مکه", "مکه المکرمه"],
    country: "SA",
    lng: 39.81666666666667,
    lat: 21.416666666666668
  },
  { names: ["شیراز"], lng: 52.543423, lat: 29.617248 },
  { names: ["مومباسا"], country: "KE", lng: 39.666666666666664, lat: -4.05 },
  {
    names: ["تمار"],
    country: "DE",
    lng: 10.615833333333333,
    lat: 50.50416666666667
  },
  {
    names: ["دیمیتروف، ارمنستان", "دیمیتروف", "Դիմիտրով"],
    country: "AM",
    lng: 44.488055555555555,
    lat: 40.00805555555556
  },
  {
    names: ["ماکنیس", "Մաքենիս"],
    country: "AM",
    lng: 45.61083333333333,
    lat: 40.12388888888889
  },
  {
    names: ["تسونیتز"],
    country: "DE",
    lng: 12.813333333333334,
    lat: 50.63027777777778
  },
  {
    names: ["دیلی سیتی، کالیفرنیا", "دیلی سیتی"],
    country: "US",
    lng: -122.46833333333333,
    lat: 37.686388888888885
  },
  {
    names: ["گوادالوپ، پرو", "Guadalupe"],
    country: "PE",
    lng: -79.47310277777778,
    lat: -7.246866666666667
  },
  { names: ["پورتوریکو"], lng: -66.06666666666666, lat: 18.45 },
  {
    names: ["بیتز", "Bitez"],
    country: "TR",
    lng: 27.383333333333333,
    lat: 37.03333333333333
  },
  {
    names: ["کانزاس‌سیتی، میزوری", "کانزاس سیتی", "Kansas City"],
    country: "US",
    lng: -94.5886111111111,
    lat: 39.109722222222224
  },
  {
    names: ["یولیش", "Jülich"],
    country: "DE",
    lng: 6.358333333333333,
    lat: 50.92222222222222
  },
  { names: ["سووا", "Suva"], country: "FJ", lng: 178, lat: -18 },
  {
    names: ["ساوث بند، ایندیانا", "South Bend, Indiana"],
    country: "US",
    lng: -86.25527777777778,
    lat: 41.6725
  },
  {
    names: ["فورت مک‌موری", "McMurray (1947–1962)"],
    country: "CA",
    lng: -111.38027777777778,
    lat: 56.72638888888889
  },
  {
    names: ["سیدی‌شهر", "Seydişehir"],
    country: "TR",
    lng: 31.85,
    lat: 37.416666666666664
  },
  {
    names: ["نورنبرگ", "Nürnberg"],
    country: "DE",
    lng: 11.083333333333334,
    lat: 49.45
  },
  { names: ["ماهدشت"], lng: 50.8128, lat: 35.7289 },
  {
    names: [
      "وولودیمیر-وولینسکیی",
      "Volodymyr-Volynsky",
      "Володимир-Волинський",
      "Włodzimierz Wołyński"
    ],
    country: "UA",
    lng: 24.322222222222223,
    lat: 50.84805555555556
  },
  {
    names: ["آستین، تگزاس", "آستین", "City of Austin"],
    country: "US",
    lng: -97.75,
    lat: 30.25
  },
  {
    names: ["بیله‌فلد", "Bielefeld"],
    country: "DE",
    lng: 8.516666666666667,
    lat: 52.016666666666666
  },
  {
    names: ["باتیپالیا", "Battipaglia"],
    country: "IT",
    lng: 14.983333333333333,
    lat: 40.61666666666667
  },
  {
    names: ["ویلنیوس", "Vilnius"],
    country: "LT",
    lng: 25.283333333333335,
    lat: 54.68333333333333
  },
  {
    names: ["جرج‌تاون", "Georgetown, Guyana"],
    country: "GY",
    lng: -58.166666666666664,
    lat: 6.8
  },
  {
    names: ["اوختیرکا", "Okhtyrka", "Охтирка"],
    country: "UA",
    lng: 34.9,
    lat: 50.3
  },
  {
    names: ["اونیه"],
    country: "TR",
    lng: 37.28333333333333,
    lat: 41.13333333333333
  },
  {
    names: ["باد زاولگاو"],
    country: "DE",
    lng: 9.500277777777777,
    lat: 48.0175
  },
  {
    names: ["مونستر", "Münster"],
    country: "DE",
    lng: 7.633333333333333,
    lat: 51.96666666666667
  },
  {
    names: ["ماراکای"],
    country: "VE",
    lng: -67.5961111111111,
    lat: 10.246944444444443
  },
  {
    names: ["لوندرینا", "Londrina"],
    country: "BR",
    lng: -51.16277777777778,
    lat: -23.310000000000002
  },
  { names: ["امبابه"], country: "EG", lng: 31, lat: 29 },
  { names: ["ناتال"], country: "BR", lng: -35.2, lat: -5.783333333333333 },
  {
    names: ["کلینگن"],
    country: "DE",
    lng: 10.933333333333334,
    lat: 51.21666666666667
  },
  {
    names: ["پایتا", "Paita"],
    country: "PE",
    lng: -81.10638888888889,
    lat: -5.091111111111111
  },
  {
    names: ["سنجورجی ده پدوره", "Sângeorgiu de Pădure", "Erdőszentgyörgy"],
    country: "RO",
    lng: 24.841666666666665,
    lat: 46.430277777777775
  },
  {
    names: ["رام‌اشتاین-میزنباخ"],
    country: "DE",
    lng: 7.554722222222222,
    lat: 49.44611111111111
  },
  { names: ["رباط‌کریم"], lng: 51.0833, lat: 35.4731 },
  {
    names: ["نیوکاسل", "City of Newcastle upon Tyne"],
    country: "GB",
    lng: -1.6,
    lat: 54.96666666666667
  },
  {
    names: ["بولتسانو", "بولزانو", "Bolzano"],
    country: "IT",
    lng: 11.35,
    lat: 46.5
  },
  { names: ["لاس وگاس"], country: "US", lng: -115.1363888888889, lat: 36.175 },
  {
    names: ["ورین گتاشن", "Վերին Գետաշեն"],
    country: "AM",
    lng: 45.24861111111111,
    lat: 40.132777777777775
  },
  {
    names: ["ونکوور، واشینگتن", "ونکوور"],
    country: "US",
    lng: -122.60277777777777,
    lat: 45.63361111111111
  },
  {
    names: ["لوهانسک", "Луганськ"],
    country: "UA",
    lng: 39.333333333333336,
    lat: 48.56666666666667
  },
  {
    names: ["فورت‌وانگن"],
    country: "DE",
    lng: 8.209166666666667,
    lat: 48.05027777777777
  },
  {
    names: ["همبرگ (افتسه)"],
    country: "DE",
    lng: 9.4,
    lat: 51.033055555555556
  },
  {
    names: ["بارسلون", "(به اسپانیایی: Barcelona)"],
    country: "ES",
    lng: 2.18,
    lat: 41.38
  },
  {
    names: ["مارکرانشتد"],
    country: "DE",
    lng: 12.221111111111112,
    lat: 51.30166666666666
  },
  {
    names: ["ونتورا، کالیفرنیا", "ونچورا"],
    country: "US",
    lng: -119.22777777777777,
    lat: 34.275
  },
  {
    names: ["نواکشوت", "نواکشوط", "Nouakchott"],
    country: "MR",
    lng: -15.95,
    lat: 18.1
  },
  {
    names: ["اوکرپ", "Åkarp"],
    country: "SE",
    lng: 13.116666666666667,
    lat: 55.65
  },
  {
    names: ["گیفهورن", "Gifhorn"],
    country: "DE",
    lng: 10.546388888888888,
    lat: 52.48861111111111
  },
  {
    names: ["راینزبرگ"],
    country: "DE",
    lng: 12.895833333333332,
    lat: 53.098333333333336
  },
  {
    names: ["اسکیلستونا", "Eskilstuna"],
    country: "SE",
    lng: 16.508333333333333,
    lat: 59.36638888888889
  },
  {
    names: ["بوکو"],
    country: "DE",
    lng: 14.083333333333334,
    lat: 52.56666666666667
  },
  {
    names: ["میناتیتلان، وراکروز"],
    country: "MX",
    lng: -94.55,
    lat: 17.983333333333334
  },
  {
    names: ["فوکویی (شهر)", "Fukui", "福井"],
    country: "JP",
    lng: 136.21666666666667,
    lat: 36.06666666666667
  },
  {
    names: ["مارماشن", "Մարմաշեն"],
    country: "AM",
    lng: 43.77194444444444,
    lat: 40.837500000000006
  },
  {
    names: ["یواخیمزتال (بارنیم)", "Joachimsthal"],
    country: "DE",
    lng: 13.75,
    lat: 52.96666666666667
  },
  {
    names: ["سیناگا (ماگدالنا)", "Ciénaga"],
    country: "CO",
    lng: -74.25,
    lat: 11.006944444444445
  },
  {
    names: ["آرتسنی", "Արծնի"],
    country: "AM",
    lng: 44.37,
    lat: 41.21416666666667
  },
  {
    names: ["باد بروکنوا"],
    country: "DE",
    lng: 9.790555555555555,
    lat: 50.309444444444445
  },
  {
    names: ["قاهره", "Cairo", "القاهره"],
    country: "EG",
    lng: 31.228888888888886,
    lat: 30.058055555555555
  },
  { names: ["اطفیح"], country: "EG", lng: 31.25, lat: 29.416666666666668 },
  { names: ["اوتوپه", "Otopeni"], country: "RO", lng: 26.07, lat: 44.55 },
  {
    names: ["هالترن آم زه", "Haltern am See"],
    country: "DE",
    lng: 7.183333333333334,
    lat: 51.75
  },
  { names: ["وایتراشتات"], country: "DE", lng: 8.6, lat: 49.9 },
  {
    names: ["لیپکی، اوبلاست تولا", "Липки"],
    country: "RU",
    lng: 37.7,
    lat: 53.93333333333333
  },
  {
    names: ["آتایورت", "Atayurt"],
    country: "TR",
    lng: 34.03333333333333,
    lat: 36.38333333333333
  },
  {
    names: ["چوریل", "Çivril"],
    country: "TR",
    lng: 29.738611111111112,
    lat: 38.30138888888889
  },
  { names: ["خوینیتسه"], country: "PL", lng: 17.55, lat: 53.7 },
  { names: ["پردیس (پردیس)"], lng: 51.8647, lat: 35.7319 },
  {
    names: ["لیشتنبرگ (اوبرفرانکن)", "Lichtenberg"],
    country: "DE",
    lng: 11.666666666666666,
    lat: 50.36666666666667
  },
  {
    names: ["هیروشیما", "Hiroshima", "広島"],
    country: "JP",
    lng: 132.45527777777778,
    lat: 34.38527777777778
  },
  {
    names: ["اودزون", "Օձուն"],
    country: "AM",
    lng: 44.61138888888889,
    lat: 41.053888888888885
  },
  {
    names: ["استرکوف"],
    country: "PL",
    lng: 19.610833333333336,
    lat: 51.901111111111106
  },
  { names: ["گواتمالا"], lng: -90.5, lat: 14.633333333333333 },
  {
    names: ["آروشات", "Արևշատ"],
    country: "AM",
    lng: 44.044444444444444,
    lat: 40.64861111111111
  },
  {
    names: ["هوگانس", "Höganäs"],
    country: "SE",
    lng: 12.566666666666666,
    lat: 56.2
  },
  {
    names: ["آمستردام", "Amsterdam"],
    country: "NL",
    lng: 4.892222222222221,
    lat: 52.37305555555555
  },
  {
    names: ["ماکاتی", "Makati"],
    country: "PH",
    lng: 121.03333333333333,
    lat: 14.55
  },
  {
    names: ["واردنیس", "Վարդենիս"],
    country: "AM",
    lng: 45.72,
    lat: 40.18055555555555
  },
  { names: ["واینهورن"], country: "DE", lng: 10.166666666666666, lat: 48.3 },
  {
    names: ["اورلتس", "Urlați"],
    country: "RO",
    lng: 26.230555555555554,
    lat: 44.99111111111111
  },
  { names: ["عالی‌شهر"], lng: 51.061944, lat: 28.934167 },
  {
    names: ["یغگیس", "یغِگیس", "Եղեգիս"],
    country: "AM",
    lng: 45.36138888888889,
    lat: 39.85888888888889
  },
  { names: ["اقبالیه", "سلطان آباد"], lng: 49.5533, lat: 36.1353 },
  {
    names: ["سانتا کلاریتا، کالیفرنیا", "City of Santa Clarita"],
    country: "US",
    lng: -118.50638888888889,
    lat: 34.416666666666664
  },
  {
    names: ["استپاناوان", "Ստեփանավան"],
    country: "AM",
    lng: 44.38408611111111,
    lat: 41.009625
  },
  {
    names: ["مریدا، یوکاتان"],
    country: "MX",
    lng: -89.61999999999999,
    lat: 20.97
  },
  { names: ["حاجی‌آباد"], lng: 28.18, lat: 55.54 },
  {
    names: ["فربنکس", "Fairbanks, Alaska"],
    country: "US",
    lng: -147.72305555555556,
    lat: 64.8436111111111
  },
  {
    names: ["منچستر", "شهر منچستر"],
    country: "GB",
    lng: -2.2333333333333334,
    lat: 53.46666666666667
  },
  { names: ["گیلانغرب", "گیه‌ڵان"], lng: 45.91, lat: 34.13 },
  {
    names: ["نوویاووریفسکه", "Novoiavorivsk"],
    country: "UA",
    lng: 23.573055555555555,
    lat: 49.93111111111111
  },
  {
    names: ["کایایو (پرو)", "Callao", "El Callao"],
    country: "PE",
    lng: -77.13333333333334,
    lat: -12.033333333333333
  },
  {
    names: ["اوزورکوف"],
    country: "PL",
    lng: 19.283333333333335,
    lat: 51.96666666666667
  },
  {
    names: ["سانتوس", "Santos"],
    country: "BR",
    lng: -46.325094444444446,
    lat: -23.93698888888889
  },
  {
    names: ["جیزه", "الجیزه"],
    country: "EG",
    lng: 31.216666666666665,
    lat: 30.016666666666666
  },
  {
    names: ["اشنباخ در اوبرفالتز", "Eschenbach i.d.OPf."],
    country: "DE",
    lng: 11.816666666666666,
    lat: 49.75
  },
  {
    names: ["اشپانگنبرگ (هسن)", "Spangenberg"],
    country: "DE",
    lng: 9.666666666666666,
    lat: 51.11666666666667
  },
  {
    names: ["لاخدنپوخیا", "Лахдепохья"],
    country: "RU",
    lng: 30.1925,
    lat: 61.52222222222222
  },
  {
    names: ["گول‌مرمره", "Gölmarmara"],
    country: "TR",
    lng: 27.916666666666668,
    lat: 38.71666666666667
  },
  {
    names: ["ساواجو", "Savuca"],
    country: "TR",
    lng: 27.4,
    lat: 37.733333333333334
  },
  {
    names: ["آرزاکان", "Արզական"],
    country: "AM",
    lng: 44.60638888888889,
    lat: 40.44944444444444
  },
  { names: ["هالستاهامار"], country: "SE", lng: 16.25, lat: 59.61666666666667 },
  {
    names: ["دومسیتز"],
    country: "DE",
    lng: 11.263333333333334,
    lat: 53.138333333333335
  },
  {
    names: ["ترک‌اوغلی"],
    country: "TR",
    lng: 36.852222222222224,
    lat: 37.39138888888889
  },
  {
    names: ["اسلوفیانسک", "Слов'янськ"],
    country: "UA",
    lng: 37.625,
    lat: 48.85333333333333
  },
  {
    names: ["ترگو اوکنا", "Târgu Ocna"],
    country: "RO",
    lng: 26.62,
    lat: 46.28
  },
  {
    names: ["رفح"],
    country: "PS",
    lng: 34.25194444444445,
    lat: 31.288611111111113
  },
  {
    names: ["کامیانکا", "Kamianka", "Кам'янка"],
    country: "UA",
    lng: 32.1,
    lat: 49.03333333333333
  },
  {
    names: ["فالتیچه", "Fălticeni"],
    country: "RO",
    lng: 26.3,
    lat: 47.459722222222226
  },
  {
    names: ["قر شهر", "قرشهر"],
    country: "TR",
    lng: 34.166666666666664,
    lat: 39.15
  },
  {
    names: ["ایساهاکیان", "Իսահակյան"],
    country: "AM",
    lng: 43.72527777777778,
    lat: 40.61666666666667
  },
  {
    names: ["کلرادو اسپرینگز، کلرادو", "Colorado Springs, Colorado"],
    country: "US",
    lng: -104.79194444444444,
    lat: 38.86333333333334
  },
  {
    names: ["سان خوان خیرون", "Girón", "San Juan Girón"],
    country: "CO",
    lng: -73.17305555555556,
    lat: 7.070833333333333
  },
  { names: ["قم"], lng: 50.88, lat: 34.66 },
  {
    names: ["الشد", "Aleşd"],
    country: "RO",
    lng: 22.396944444444443,
    lat: 47.05722222222222
  },
  {
    names: ["الیزابت، نیوجرسی", "Elizabeth, New Jersey"],
    country: "US",
    lng: -74.19353,
    lat: 40.666261
  },
  {
    names: ["تانگشان", "唐山市"],
    country: "CN",
    lng: 118.17611111111111,
    lat: 39.62305555555555
  },
  {
    names: ["رماگن"],
    country: "DE",
    lng: 7.230555555555556,
    lat: 50.578611111111115
  },
  {
    names: ["جده", "City of Jeddah", "جدّه"],
    lng: 39.172777777777775,
    lat: 21.543333333333337
  },
  {
    names: ["فرویدن‌برگ (زیگرلند)", "Freudenberg"],
    country: "DE",
    lng: 7.866666666666667,
    lat: 50.89972222222222
  },
  {
    names: ["مونیخ", "Munich", "München"],
    country: "DE",
    lng: 11.566666666666666,
    lat: 48.13333333333333
  },
  { names: ["پارس‌آباد"], lng: 47.9142, lat: 39.6503 },
  { names: ["چابهار", "چهبار"], lng: 60.643, lat: 25.2919 },
  {
    names: ["السبرگ، آلمان", "Olsberg"],
    country: "DE",
    lng: 8.483333333333333,
    lat: 51.35
  },
  {
    names: ["اناکو"],
    country: "VE",
    lng: -64.49166666666667,
    lat: 9.481944444444444
  },
  {
    names: ["واخنهایم آن در واین‌اشتارسه"],
    country: "DE",
    lng: 8.18,
    lat: 49.441111111111105
  },
  {
    names: ["استریتز"],
    country: "DE",
    lng: 14.932222222222222,
    lat: 51.014722222222225
  },
  { names: ["خمین"], lng: 50.05, lat: 33.6333 },
  {
    names: ["شیکاگو", "City of Chicago"],
    country: "US",
    lng: -87.62777777777777,
    lat: 41.88194444444444
  },
  {
    names: ["اسپوکن، واشینگتن", "اسپوکن", "City of Spokane"],
    country: "US",
    lng: -117.42500000000001,
    lat: 47.65888888888889
  },
  {
    names: ["اکران، اوهایو", "اکرون، اوهایو", "City of Akron"],
    country: "US",
    lng: -81.51777777777778,
    lat: 41.073055555555555
  },
  { names: ["تسیگنبرگ"], country: "DE", lng: 11.65, lat: 50.61666666666667 },
  {
    names: ["پاویا", "Pavia"],
    country: "IT",
    lng: 9.15,
    lat: 45.18333333333333
  },
  {
    names: ["پورتلند، اورگن", "پورتلند", "Portland, Oregon"],
    country: "US",
    lng: -122.68194444444445,
    lat: 45.519999999999996
  },
  {
    names: ["لوری برد، لوری", "لور برد", "Լոռի բերդ"],
    country: "AM",
    lng: 44.41260833333333,
    lat: 41.01263888888889
  },
  {
    names: ["آخالکالاکی", "(به گرجی: ახალქალაქი؛", "به ارمنی: Ախալքալաք"],
    country: "GE",
    lng: 43.486111111111114,
    lat: 41.40555555555555
  },
  {
    names: ["باد هارتسبورگ"],
    country: "DE",
    lng: 10.562222222222223,
    lat: 51.88111111111111
  },
  {
    names: ["اسنز، نیدرزاکسن"],
    country: "DE",
    lng: 7.612777777777778,
    lat: 53.64694444444444
  },
  {
    names: ["پلیتلی", "Pelitli"],
    country: "TR",
    lng: 39.8,
    lat: 40.983333333333334
  },
  {
    names: ["بویارکا", "Боярка"],
    country: "UA",
    lng: 30.288611111111113,
    lat: 50.32916666666667
  },
  {
    names: ["بایل‌اشاین (وورتمبرگ)", "Beilstein"],
    country: "DE",
    lng: 9.316666666666666,
    lat: 49.03333333333333
  },
  { names: ["گایتهاین"], country: "DE", lng: 12.683333333333334, lat: 51.05 },
  {
    names: ["فوکوشیما (شهر)", "福島市"],
    country: "JP",
    lng: 140.46666666666667,
    lat: 37.766666666666666
  },
  { names: ["دیادین"], country: "TR", lng: 43.67722222222222, lat: 39.54 },
  {
    names: ["جانکوی", "Dzhankoy", "Джанкой", "Canköy"],
    country: "ru",
    lng: 34.39333333333333,
    lat: 45.70861111111111
  },
  {
    names: ["تورونچووا", "Turunçova"],
    country: "TR",
    lng: 30.133333333333333,
    lat: 36.36666666666667
  },
  {
    names: ["عثمانیه (شهر)", "عثمانیه"],
    country: "TR",
    lng: 36.25,
    lat: 37.075
  },
  {
    names: ["پازارجیک"],
    country: "TR",
    lng: 37.29805555555556,
    lat: 37.48777777777778
  },
  {
    names: ["جراهوویت", "Ջրահովիտ"],
    country: "AM",
    lng: 44.47361111111111,
    lat: 40.04527777777778
  },
  {
    names: ["پورتو پرنس", "Ville de Port-au-Prince"],
    country: "HT",
    lng: -72.33333333333333,
    lat: 18.533333333333335
  },
  {
    names: ["تیره (شهر)", "Tire"],
    country: "TR",
    lng: 27.733333333333334,
    lat: 38.083333333333336
  },
  {
    names: ["مارتونی (روستا)", "مارتونی", "Մարտունի"],
    country: "AM",
    lng: 45.254444444444445,
    lat: 40.66694444444444
  },
  {
    names: ["لا پلاتا", "La Plata"],
    country: "AR",
    lng: -57.95444444444445,
    lat: -34.92111111111111
  },
  {
    names: ["ماتاموروس، تامایولیپاس"],
    country: "MX",
    lng: -97.50416666666666,
    lat: 25.879722222222224
  },
  {
    names: ["تغر", "Տեղեր"],
    country: "AM",
    lng: 44.23638888888889,
    lat: 40.34527777777778
  },
  {
    names: ["ان آربر، میشیگان", "Ann Arbor, Michigan"],
    country: "US",
    lng: -83.74833333333333,
    lat: 42.28138888888889
  },
  { names: ["الباسان"], country: "AL", lng: 20.066666666666666, lat: 41.1 },
  {
    names: ["پینار دل ریو", "Pinar del Río"],
    country: "CU",
    lng: -83.67194444444445,
    lat: 22.41222222222222
  },
  {
    names: ["استاروکوستیانتینیف", "Starokostiantyniv", "Старокостянтинів"],
    country: "UA",
    lng: 27.220277777777778,
    lat: 49.75388888888889
  },
  { names: ["لویتس"], country: "DE", lng: 13.15, lat: 53.96666666666667 },
  {
    names: ["دوبلین", "(به ایرلندی: Baile Átha Cliath)", "Dublin"],
    country: "IE",
    lng: -6.25,
    lat: 53.333333333333336
  },
  { names: ["نوین‌هاوس"], country: "DE", lng: 6.966666666666667, lat: 52.5 },
  {
    names: ["ترویشتلینگن"],
    country: "DE",
    lng: 10.909444444444444,
    lat: 48.95527777777778
  },
  { names: ["پیزا"], country: "IT", lng: 10.4, lat: 43.71666666666667 },
  {
    names: ["اورومچی", "乌鲁木齐市 · یۈرۈمچی شه‌هیری"],
    country: "CN",
    lng: 87.6,
    lat: 43.825
  },
  {
    names: ["فینستروالده"],
    country: "DE",
    lng: 13.716666666666667,
    lat: 51.63305555555556
  },
  {
    names: ["دونجینگ (شاندونگ)", "Dongying", "东营市"],
    country: "CN",
    lng: 118.46666666666667,
    lat: 37.45
  },
  {
    names: ["اشتات‌ایلم"],
    country: "DE",
    lng: 11.080833333333333,
    lat: 50.775
  },
  {
    names: ["اینگلوود، کالیفرنیا", "اینگل وود", "City of Inglewood"],
    country: "US",
    lng: -118.3461111111111,
    lat: 33.9575
  },
  {
    names: ["چیملواکان، استادو د مخیکو", "Chimalhuacán"],
    country: "MX",
    lng: -98.95416666666667,
    lat: 19.4375
  },
  {
    names: ["تموکو"],
    country: "CL",
    lng: -72.66666666666667,
    lat: -38.733333333333334
  },
  { names: ["شنژن", "深圳市"], country: "", lng: 114.1, lat: 22.55 },
  {
    names: ["شواندورف", "Schwandorf"],
    country: "DE",
    lng: 12.116666666666667,
    lat: 49.333333333333336
  },
  {
    names: ["نویبوکو"],
    country: "DE",
    lng: 11.666666666666666,
    lat: 54.016666666666666
  },
  {
    names: ["چیلاپا د آلوارز"],
    country: "MX",
    lng: -99.16666666666667,
    lat: 17.6
  },
  { names: ["آوما"], country: "DE", lng: 11.9, lat: 50.7 },
  {
    names: ["ترگو لپو", "Târgu Lăpuș"],
    country: "RO",
    lng: 23.863055555555558,
    lat: 47.4525
  },
  {
    names: ["نخو (سوید)", "نخو"],
    country: "SE",
    lng: 14.683333333333334,
    lat: 57.65
  },
  {
    names: ["کالتن‌نوردهایم"],
    country: "DE",
    lng: 10.166666666666666,
    lat: 50.63333333333333
  },
  {
    names: ["اشلوسلفلد"],
    country: "DE",
    lng: 10.616666666666667,
    lat: 49.766666666666666
  },
  {
    names: ["گلسن"],
    country: "DE",
    lng: 13.599722222222223,
    lat: 51.96666666666667
  },
  {
    names: ["برکرفلد", "Breckerfeld"],
    country: "DE",
    lng: 7.466666666666667,
    lat: 51.266666666666666
  },
  { names: ["بغداد", "Baghdad"], country: "IQ", lng: 44.422, lat: 33.325 },
  {
    names: ["آتاکنت", "Atakent"],
    country: "TR",
    lng: 34.13333333333333,
    lat: 36.4
  },
  {
    names: ["ستک", "سُتک", "Սոթք"],
    country: "AM",
    lng: 45.86472222222223,
    lat: 40.20305555555556
  },
  {
    names: ["مانیل", "مانیلا", "Lungsod ng Maynila"],
    country: "PH",
    lng: 120.96666666666667,
    lat: 14.583333333333334
  },
  {
    names: ["آکسنارد، کالیفرنیا", "اوکس نارد"],
    country: "US",
    lng: -119.1825,
    lat: 34.19138888888889
  },
  {
    names: ["سالت‌لیک‌سیتی", "Salt Lake City"],
    country: "US",
    lng: -111.88333333333334,
    lat: 40.75
  },
  {
    names: ["لرناوان", "Լեռնավան"],
    country: "AM",
    lng: 44.18444444444444,
    lat: 40.788333333333334
  },
  {
    names: ["جینهوا", "金华市"],
    country: "",
    lng: 119.65,
    lat: 29.083333333333332
  },
  {
    names: ["هووتاشن", "Հովտաշեն"],
    country: "AM",
    lng: 44.45,
    lat: 40.02444444444444
  },
  {
    names: ["یغگنادزور", "Եղեգնաձոր"],
    country: "AM",
    lng: 45.333333333333336,
    lat: 39.76111111111111
  },
  {
    names: ["سوروکابا", "Sorocaba"],
    country: "BR",
    lng: -47.45805555555556,
    lat: -23.501666666666665
  },
  {
    names: ["والدک، هسن", "Waldeck"],
    country: "DE",
    lng: 9.066666666666666,
    lat: 51.2
  },
  { names: ["محمودآباد نمونه"], lng: 49.9021, lat: 36.2887 },
  {
    names: ["ماسا (ایتالیا)", "Massa"],
    country: "IT",
    lng: 10.133333333333333,
    lat: 44.03333333333333
  },
  {
    names: ["موجور", "Mucur"],
    country: "TR",
    lng: 34.38333333333333,
    lat: 39.06666666666667
  },
  { names: ["یغنیک", "Եղնիկ"], country: "AM", lng: 43.95, lat: 40.4 },
  {
    names: ["ایساکچه", "Isaccea"],
    country: "RO",
    lng: 28.459722222222222,
    lat: 45.26972222222222
  },
  {
    names: ["زاندرزدوف-برنا"],
    country: "DE",
    lng: 12.233333333333333,
    lat: 51.61666666666667
  },
  {
    names: ["نوردنهایم", "Nordenham"],
    country: "DE",
    lng: 8.466666666666667,
    lat: 53.5
  },
  {
    names: ["آخوریان", "Ախուրյան"],
    country: "AM",
    lng: 43.896388888888886,
    lat: 40.78138888888889
  },
  {
    names: ["آلاوردی", "Ալավերդի"],
    country: "AM",
    lng: 44.65,
    lat: 41.13333333333333
  },
  { names: ["آلسلبن"], country: "DE", lng: 11.666666666666666, lat: 51.7 },
  {
    names: ["پورنبا"],
    country: "PL",
    lng: 19.33361111111111,
    lat: 50.49277777777778
  },
  {
    names: ["گدانسک", "Gdańsk"],
    country: "PL",
    lng: 18.633333333333333,
    lat: 54.36666666666667
  },
  {
    names: ["الزدورف", "Elsdorf"],
    country: "DE",
    lng: 6.566666666666666,
    lat: 50.93333333333333
  },
  { names: ["اپ‌اشتاین"], country: "DE", lng: 8.4, lat: 50.13333333333333 },
  {
    names: ["مالشین"],
    country: "DE",
    lng: 12.783333333333333,
    lat: 53.733333333333334
  },
  {
    names: ["کاخاکن", "Կախակն"],
    country: "AM",
    lng: 45.78333333333333,
    lat: 40.28333333333333
  },
  { names: ["سواستوپول", "Севастополь"], country: "UA", lng: 33.53, lat: 44.6 },
  {
    names: ["شیراک، ارمنستان", "شیراک", "Շիրակ"],
    country: "AM",
    lng: 43.921388888888885,
    lat: 40.84805555555556
  },
  {
    names: ["نوووهرودیفکا", "Novohrodivka", "Новогродівка"],
    country: "UA",
    lng: 37.339444444444446,
    lat: 48.2
  },
  {
    names: ["هلیفکس، نوا اسکوشیا", "هلیفکس", "Halifax", "Jipugtug", "Chebucto"],
    country: "CA",
    lng: -63.61,
    lat: 44.669999999999995
  },
  {
    names: ["مارکدورف"],
    country: "DE",
    lng: 9.391666666666666,
    lat: 47.72083333333334
  },
  {
    names: ["مونته‌ویدیو", "Montevideo"],
    country: "UY",
    lng: -56.18194444444444,
    lat: -34.88361111111111
  },
  {
    names: ["دالیان", "大连市"],
    country: "CN",
    lng: 121.63916666666667,
    lat: 38.920833333333334
  },
  {
    names: ["هایدهناو (زاکسن)", "Heidenau"],
    country: "DE",
    lng: 13.866666666666667,
    lat: 50.983333333333334
  },
  {
    names: ["الشترا", "Elstra"],
    country: "DE",
    lng: 14.130666666666666,
    lat: 51.220666666666666
  },
  { names: ["اهر"], lng: 47.07, lat: 38.4775 },
  {
    names: ["لوساگیوغ، آرماویر", "لوساگیوغ", "Լուսագյուղ"],
    country: "AM",
    lng: 44.269999999999996,
    lat: 40.08888888888889
  },
  {
    names: ["لوبامبا", "Lobamba"],
    country: "SZ",
    lng: 31.2,
    lat: -26.466666666666665
  },
  {
    names: ["کاندرن"],
    country: "DE",
    lng: 7.666666666666667,
    lat: 47.71666666666667
  },
  {
    names: ["باد دوبن"],
    country: "DE",
    lng: 12.585277777777778,
    lat: 51.591944444444444
  },
  {
    names: ["سولینا", "Sulina"],
    country: "RO",
    lng: 29.652777777777775,
    lat: 45.159444444444446
  },
  {
    names: ["چارلستون، کارولینای جنوبی", "City of Charleston"],
    country: "US",
    lng: -79.93333333333334,
    lat: 32.78333333333333
  },
  {
    names: ["اینسوهتسی", "Însurăţei"],
    country: "RO",
    lng: 27.616666666666667,
    lat: 44.916666666666664
  },
  { names: ["سمیرم"], lng: 51.57, lat: 31.42 },
  {
    names: ["رونکل"],
    country: "DE",
    lng: 8.155000000000001,
    lat: 50.405277777777776
  },
  {
    names: ["بولستا", "Bålsta"],
    country: "SE",
    lng: 17.5,
    lat: 59.583333333333336
  },
  {
    names: ["چاغلایان‌جریت"],
    country: "TR",
    lng: 37.293055555555554,
    lat: 37.75055555555556
  },
  {
    names: ["جاودووو"],
    country: "PL",
    lng: 20.183333333333334,
    lat: 53.233333333333334
  },
  {
    names: ["چوروم", "Çorum"],
    country: "TR",
    lng: 34.95,
    lat: 40.53333333333333
  },
  {
    names: ["اورلندو، فلوریدا", "City of Orlando"],
    country: "US",
    lng: -81.29888888888888,
    lat: 28.41583333333333
  },
  {
    names: ["کلمبو", "Colombo", "කොළඹ", "கொழும்பு"],
    country: "LK",
    lng: 79.84277777777777,
    lat: 6.934444444444445
  },
  { names: ["ویمربی"], country: "SE", lng: 15.85, lat: 57.666666666666664 },
  {
    names: ["متسینگن"],
    country: "DE",
    lng: 9.285833333333333,
    lat: 48.53666666666666
  },
  {
    names: ["تیلینگ", "铁岭市"],
    country: "CN",
    lng: 123.72626111111111,
    lat: 42.22381111111111
  },
  {
    names: ["تاشیر", "Տաշիր"],
    country: "AM",
    lng: 44.28194444444444,
    lat: 41.12444444444444
  },
  { names: ["حمیدیا"], lng: 54.378297, lat: 31.837597 },
  {
    names: ["لرنانتسک", "Լեռնանցք"],
    country: "AM",
    lng: 44.269999999999996,
    lat: 40.78
  },
  {
    names: ["فلاورجان"],
    country: "IR",
    lng: 51.50972222222222,
    lat: 32.555277777777775
  },
  {
    names: ["مایه‌باشی، گونما", "Maebashi", "前橋"],
    country: "JP",
    lng: 139.06666666666666,
    lat: 36.38333333333333
  },
  {
    names: ["مکزیکو سیتی", "Ciudad de México"],
    country: "MX",
    lng: -99.13333333333334,
    lat: 19.433333333333334
  },
  {
    names: ["آیگهات", "Այգեհատ"],
    country: "AM",
    lng: 44.59527777777778,
    lat: 41.01611111111111
  },
  {
    names: ["کوبا", "جمهوری کوبا"],
    lng: -82.38333333333334,
    lat: 23.133333333333333
  },
  {
    names: ["سورمنه", "Sürmene"],
    country: "TR",
    lng: 40.112500000000004,
    lat: 40.91416666666667
  },
  {
    names: ["المسیله، الجزایر", "المسیله"],
    country: "DZ",
    lng: 4.546944444444445,
    lat: 35.70194444444445
  },
  { names: ["بندر ماهشهر"], lng: 49.1803, lat: 30.5458 },
  { names: ["وستینا", "Vadstena"], country: "SE", lng: 14.9, lat: 58.45 },
  { names: ["ژانژیانگ", "湛江市"], country: "CN", lng: 110.4, lat: 21.2 },
  {
    names: ["دزوراگیوغ، گغارکونیک", "دزوراگیوغ", "Ձորագյուղ"],
    country: "AM",
    lng: 45.198611111111106,
    lat: 40.169444444444444
  },
  { names: ["واگهویزل"], country: "DE", lng: 8.516666666666667, lat: 49.25 },
  {
    names: ["آپارسیدا دی گویانیا"],
    country: "BR",
    lng: -49.22555555555556,
    lat: -16.822777777777777
  },
  {
    names: ["پلاتو (ماگدالنا)", "Plato"],
    country: "CO",
    lng: -74.78722222222223,
    lat: 9.791944444444445
  },
  { names: ["ویتنبورگ"], country: "DE", lng: 11.066666666666666, lat: 53.5 },
  {
    names: ["لانگنهاگن", "Langenhagen"],
    country: "DE",
    lng: 9.739999999999998,
    lat: 52.43944444444444
  },
  {
    names: ["برایتون اند هوو", "Brighton and Hove"],
    country: "GB",
    lng: -9.166666666666666,
    lat: 50.81666666666667
  },
  {
    names: ["کالامار (بولیوار)", "Calamar"],
    country: "CO",
    lng: -74.91583333333334,
    lat: 10.25
  },
  {
    names: ["دروبتا-تورنو سورین", "Drobeta-Turnu Severin"],
    country: "RO",
    lng: 22.666666666666668,
    lat: 44.56666666666667
  },
  {
    names: ["فیلادلفیا", "The City of Philadelphia"],
    country: "US",
    lng: -75.17,
    lat: 39.95333333333333
  },
  {
    names: ["مخیکالی", "Mexicali"],
    country: "MX",
    lng: -115.46777777777778,
    lat: 32.663333333333334
  },
  {
    names: ["برلین", "Berlin"],
    country: "DE",
    lng: 13.383333333333333,
    lat: 52.516666666666666
  },
  {
    names: ["سایوتومه", "São Tomé"],
    country: "ST",
    lng: 6.681388888888889,
    lat: 0.3361111111111111
  },
  {
    names: ["پلوشینگن", "Plochingen"],
    country: "DE",
    lng: 9.41638888888889,
    lat: 48.711666666666666
  },
  { names: ["نویس (شهر)", "Neuss"], country: "DE", lng: 6.7, lat: 51.2 },
  {
    names: ["کیرک‌آغاچ", "Kırkağaç"],
    country: "TR",
    lng: 27.666666666666668,
    lat: 39.1
  },
  {
    names: ["لیبنوالده", "Liebenwalde"],
    country: "DE",
    lng: 13.4,
    lat: 52.86666666666667
  },
  {
    names: ["ناخون راتچاسیما", "นครราชสีมา"],
    country: "TH",
    lng: 102.1,
    lat: 14.980555555555556
  },
  {
    names: ["بومانت، تگزاس", "City of Beaumont"],
    country: "US",
    lng: -94.12666666666667,
    lat: 30.08
  },
  {
    names: ["دوناییفتسی", "Dunaivtsi", "Дунаївці"],
    country: "UA",
    lng: 26.856944444444444,
    lat: 48.88944444444444
  },
  {
    names: ["باد زوبرنهایم"],
    country: "DE",
    lng: 7.652777777777779,
    lat: 49.78722222222222
  },
  {
    names: ["بندر سری بگاوان", "بندر سری بڬاوان", "Bandar Seri Begawan"],
    country: "BN",
    lng: 114.94222222222223,
    lat: 4.8902777777777775
  },
  { names: ["والدزاسن"], country: "DE", lng: 12.3, lat: 50 },
  {
    names: ["لوس موچیس"],
    country: "MX",
    lng: -108.99374166666666,
    lat: 25.783497222222223
  },
  {
    names: ["گرسروردورف"],
    country: "DE",
    lng: 14.016666666666667,
    lat: 51.144444444444446
  },
  {
    names: ["کلارک‌اسویل، تنسی", "Clarksville, Tennessee"],
    country: "US",
    lng: -87.35916666666667,
    lat: 36.52972222222222
  },
  {
    names: ["لودن‌شاید", "Lüdenscheid"],
    country: "DE",
    lng: 7.633333333333333,
    lat: 51.21666666666667
  },
  {
    names: ["دغدزاوان", "Դեղձավան"],
    country: "AM",
    lng: 44.93333333333333,
    lat: 41.233333333333334
  },
  { names: ["اوگوستوو"], country: "PL", lng: 22.966666666666665, lat: 53.85 },
  {
    names: ["فری‌تاون"],
    country: "SL",
    lng: -13.234444444444444,
    lat: 8.484444444444444
  },
  {
    names: ["چندی‌گر", "ਚੰਡੀਗੜ੍ਹ", "चण्डीगढ़"],
    country: "IN",
    lng: 76.78333333333333,
    lat: 30.75
  },
  {
    names: ["آرواداشت", "Արևադաշտ"],
    country: "AM",
    lng: 43.93333333333333,
    lat: 40.15
  },
  {
    names: ["پرایا", "Praia"],
    country: "CV",
    lng: -23.508333333333333,
    lat: 14.920833333333333
  },
  {
    names: ["هوف، آلمان", "Hof"],
    country: "DE",
    lng: 11.916666666666666,
    lat: 50.31666666666667
  },
  {
    names: ["ایدیل"],
    country: "TR",
    lng: 41.891666666666666,
    lat: 37.34166666666667
  },
  {
    names: ["لاهه", "Den Haag"],
    country: "NL",
    lng: 4.316666666666666,
    lat: 52.083333333333336
  },
  {
    names: ["لویویانگ", "洛阳市"],
    country: "CN",
    lng: 112.44222222222223,
    lat: 34.66972222222222
  },
  {
    names: ["آلوپکا", "Alupka", "Алупка"],
    country: "",
    lng: 34.043055555555554,
    lat: 44.41972222222222
  },
  {
    names: ["آرزنی", "Արզնի"],
    country: "AM",
    lng: 44.59583333333334,
    lat: 40.296388888888885
  },
  {
    names: ["تسووازارد", "Ծովազարդ"],
    country: "AM",
    lng: 45.0375,
    lat: 40.47694444444445
  },
  {
    names: ["مورنو ولی، کالیفرنیا", "City of Moreno Valley"],
    country: "US",
    lng: -117.22833333333334,
    lat: 33.94305555555555
  },
  {
    names: ["اسلام‌آباد"],
    country: "PK",
    lng: 73.06666666666666,
    lat: 33.71666666666667
  },
  {
    names: ["آلساندریا", "Alessandria"],
    country: "IT",
    lng: 8.616666666666667,
    lat: 44.916666666666664
  },
  {
    names: ["رمرود"],
    country: "DE",
    lng: 9.216666666666667,
    lat: 50.71666666666667
  },
  {
    names: ["فلمار", "Vellmar"],
    country: "DE",
    lng: 9.466666666666667,
    lat: 51.35
  },
  {
    names: ["لا سرنا", "La Serna"],
    country: "ES",
    lng: -4.666666666666667,
    lat: 42.416666666666664
  },
  {
    names: ["پوکرووسک", "Покровськ"],
    country: "UA",
    lng: 37.18277777777777,
    lat: 48.282777777777774
  },
  { names: ["گلاستر", "Gloucester"], country: "GB", lng: -2.24, lat: 51.87 },
  {
    names: ["دورهام، کارولینای شمالی", "Durham, North Carolina"],
    country: "US",
    lng: -78.90722222222223,
    lat: 35.98861111111111
  },
  {
    names: ["تسانداره", "Ţăndărei"],
    country: "RO",
    lng: 27.65861111111111,
    lat: 44.640277777777776
  },
  {
    names: ["پیوریا، ایلینوی"],
    country: "US",
    lng: -89.60944444444443,
    lat: 40.72083333333334
  },
  {
    names: ["فولندورف"],
    country: "DE",
    lng: 9.256666666666666,
    lat: 47.924166666666665
  },
  {
    names: ["یایونده", "Yaoundé"],
    country: "CM",
    lng: 11.516666666666667,
    lat: 3.8666666666666667
  },
  {
    names: ["بریجپورت، کنتیکت", "Bridgeport, Connecticut"],
    country: "US",
    lng: -73.19555555555556,
    lat: 41.186388888888885
  },
  {
    names: ["کاشیاس دو سو"],
    country: "BR",
    lng: -51.18333333333333,
    lat: -29.166666666666668
  },
  {
    names: ["لوبنی", "Лубни"],
    country: "UA",
    lng: 33,
    lat: 50.016666666666666
  },
  {
    names: ["زی‌هاوزن (آلتمارک)", "Seehausen"],
    country: "DE",
    lng: 11.75,
    lat: 52.86666666666667
  },
  {
    names: ["سایو پایولو", "São Paulo"],
    country: "BR",
    lng: -46.63333333333333,
    lat: -23.55
  },
  {
    names: ["هیلدن"],
    country: "DE",
    lng: 6.939444444444445,
    lat: 51.171388888888885
  },
  {
    names: ["دلبروک"],
    country: "DE",
    lng: 8.566666666666666,
    lat: 51.766666666666666
  },
  {
    names: ["سن برناردینو، کالیفرنیا", "سن برناردینو"],
    country: "US",
    lng: -117.29305555555555,
    lat: 34.129444444444445
  },
  { names: ["کزنتزا", "Cosenza"], country: "IT", lng: 16.25, lat: 39.3 },
  {
    names: ["باکایو", "Bacău"],
    country: "RO",
    lng: 26.916666666666668,
    lat: 46.583333333333336
  },
  {
    names: ["فوگتسبورگ در کایزراشتول"],
    country: "DE",
    lng: 7.631666666666667,
    lat: 48.08916666666667
  },
  { names: ["کولونگزبورن"], country: "DE", lng: 11.75, lat: 54.13333333333333 },
  { names: ["اوژشه"], country: "PL", lng: 18.75, lat: 50.15 },
  {
    names: ["کیوجا"],
    country: "IT",
    lng: 12.283333333333333,
    lat: 45.233333333333334
  },
  {
    names: ["دنیپرودزرژینسک", "کامیانسکه", "Кам'янське"],
    country: "UA",
    lng: 34.61666666666667,
    lat: 48.516666666666666
  },
  {
    names: ["خولیاکا", "Juliaca - Puno Perú"],
    country: "PE",
    lng: -70.12708333333333,
    lat: -15.490722222222221
  },
  {
    names: ["براکل، آلمان", "Brakel"],
    country: "DE",
    lng: 9.183333333333334,
    lat: 51.71666666666667
  },
  {
    names: ["بافلو، نیویورک", "بافلو", "City of Buffalo"],
    country: "US",
    lng: -78.84944444444444,
    lat: 42.90472222222222
  },
  {
    names: ["فیرزن", "Viersen"],
    country: "DE",
    lng: 6.397222222222223,
    lat: 51.25611111111111
  },
  {
    names: ["دارگون"],
    country: "DE",
    lng: 12.833333333333334,
    lat: 53.88333333333333
  },
  {
    names: ["اوبرنکیرشن"],
    country: "DE",
    lng: 9.117777777777778,
    lat: 52.26638888888889
  },
  {
    names: ["مسکو، آیداهو", "Moscow, Idaho"],
    country: "US",
    lng: -117,
    lat: 46.73
  },
  {
    names: ["کارنیس", "Կարենիս"],
    country: "AM",
    lng: 44.60722222222223,
    lat: 40.391666666666666
  },
  {
    names: ["باد لانگن‌زاسا"],
    country: "DE",
    lng: 10.646666666666667,
    lat: 51.10805555555556
  },
  { names: ["آهاوس", "Ahaus"], country: "DE", lng: 7, lat: 52.06666666666667 },
  {
    names: ["استوکتون، کالیفرنیا", "Stockton, California"],
    country: "US",
    lng: -121.30083333333333,
    lat: 37.97555555555556
  },
  {
    names: ["روزنو", "Roznov"],
    country: "RO",
    lng: 26.511666666666667,
    lat: 46.83555555555556
  },
  {
    names: ["اشتاینفورت", "Steinfurt"],
    country: "DE",
    lng: 7.344166666666666,
    lat: 52.1475
  },
  {
    names: ["اسکویرا", "Сквира"],
    country: "UA",
    lng: 29.666666666666668,
    lat: 49.71666666666667
  },
  {
    names: ["یون‌اشتات"],
    country: "DE",
    lng: 13.088611111111112,
    lat: 50.51444444444444
  },
  { names: ["کیرتورف"], country: "DE", lng: 9.1, lat: 50.766666666666666 },
  {
    names: ["پلش"],
    country: "DE",
    lng: 7.316666666666666,
    lat: 50.301111111111105
  },
  {
    names: ["وارن، میشیگان", "Warren, Michigan"],
    country: "US",
    lng: -83.02388888888889,
    lat: 42.49194444444444
  },
  {
    names: ["دالاریک", "Դալարիկ"],
    country: "AM",
    lng: 43.86027777777778,
    lat: 40.218333333333334
  },
  {
    names: ["اکشو", "Eksjö"],
    country: "SE",
    lng: 14.970277777777778,
    lat: 57.66694444444444
  },
  {
    names: ["تیمفو", "ཐིམ་ཕུག།", "Thimphu"],
    country: "BT",
    lng: 89.64166666666668,
    lat: 27.466666666666665
  },
  {
    names: ["مالابو", "Malabo"],
    country: "GQ",
    lng: 8.766666666666667,
    lat: 3.75
  },
  {
    names: ["کوسامو"],
    country: "FI",
    lng: 29.183333333333334,
    lat: 65.96666666666667
  },
  {
    names: ["اشلتاو"],
    country: "DE",
    lng: 12.95111111111111,
    lat: 50.558611111111105
  },
  {
    names: ["باغرامیان، آرماویر", "باغرامیان", "Բաղրամյան"],
    country: "AM",
    lng: 43.849444444444444,
    lat: 40.19083333333333
  },
  {
    names: ["آکبز", "Akbez"],
    country: "TR",
    lng: 36.516666666666666,
    lat: 36.85
  },
  {
    names: ["پویرتو ویلیامز"],
    country: "CL",
    lng: -67.61666666666666,
    lat: -54.93333333333333
  },
  { names: ["گرونبرگ، هسن", "Grünberg"], country: "DE", lng: 8.95, lat: 50.6 },
  { names: ["فارسکور"], country: "EG", lng: 31.713195, lat: 31.328933 },
  {
    names: ["روستاوی", "რუსთავი"],
    country: "GE",
    lng: 45,
    lat: 41.53333333333333
  },
  {
    names: ["توپلیتسا", "Toplița", "Maroshévíz"],
    country: "RO",
    lng: 25.34583333333333,
    lat: 46.92361111111111
  },
  {
    names: ["اوستولپ", "Åstorp"],
    country: "SE",
    lng: 12.947222222222223,
    lat: 56.13472222222222
  },
  {
    names: ["چیمبوته", "Chimbote"],
    country: "PE",
    lng: -78.59357222222222,
    lat: -9.14121111111111
  },
  {
    names: ["لیمانووا"],
    country: "PL",
    lng: 20.42666666666667,
    lat: 49.70055555555556
  },
  {
    names: ["نیکوزیا", "(به یونانی: Λευκωσία)", "(به ترکی استانبولی: Lefkoşa)"],
    country: "",
    lng: 33.36666666666667,
    lat: 35.166666666666664
  },
  { names: ["گالیکش", "گالیکِش"], lng: 55.4367, lat: 37.2661 },
  {
    names: ["دمشق", "Damascus"],
    country: "SY",
    lng: 3.294722222222222,
    lat: 33.51305555555555
  },
  {
    names: ["نان‌نینگ", "南宁市 · Nanzningz Si"],
    country: "CN",
    lng: 108.31666666666666,
    lat: 22.816666666666666
  },
  {
    names: ["بوتزباخ", "Butzbach"],
    country: "DE",
    lng: 8.662222222222223,
    lat: 50.43666666666666
  },
  {
    names: ["برکن (هسن)", "Borken"],
    country: "DE",
    lng: 9.267222222222223,
    lat: 51.045833333333334
  },
  {
    names: ["محمودیه (مصر)", "محمودیه", "المحمودیه"],
    country: "EG",
    lng: 30.524166666666666,
    lat: 31.183888888888887
  },
  {
    names: ["پریزن‌اشتات"],
    country: "DE",
    lng: 10.333333333333334,
    lat: 49.81666666666667
  },
  {
    names: ["ماراکای"],
    country: "VE",
    lng: -67.5961111111111,
    lat: 10.246944444444443
  },
  {
    names: ["دزوراوانک", "Ձորավանք"],
    country: "AM",
    lng: 45.106944444444444,
    lat: 40.69833333333333
  },
  {
    names: ["ارتراند"],
    country: "DE",
    lng: 13.783055555555556,
    lat: 51.36666666666667
  },
  {
    names: ["واهراوار", "Վահրավար"],
    country: "AM",
    lng: 46.18333333333333,
    lat: 38.95
  },
  { names: ["ترنتون"], country: "US", lng: -74.756138, lat: 40.221741 },
  {
    names: ["پترسون، نیوجرسی", "Paterson, New Jersey"],
    country: "US",
    lng: -74.162826,
    lat: 40.914746
  },
  {
    names: ["نوراباک", "Նորաբակ"],
    country: "AM",
    lng: 45.86666666666667,
    lat: 40.15
  },
  {
    names: ["باییا بلانکا", "Bahía Blanca"],
    country: "AR",
    lng: -62.266666666666666,
    lat: -38.71666666666667
  },
  {
    names: ["توبینگن"],
    country: "DE",
    lng: 9.055555555555557,
    lat: 48.519999999999996
  },
  {
    names: ["محله الکبری", "المحله الکبری"],
    country: "EG",
    lng: 31.167,
    lat: 30.967
  },
  {
    names: ["المالی", "Elmalı"],
    country: "TR",
    lng: 29.9,
    lat: 36.733333333333334
  },
  {
    names: ["زلترز (وستروالد)", "Selters"],
    country: "DE",
    lng: 7.7572222222222225,
    lat: 50.532222222222224
  },
  {
    names: ["سورپرایز، آریزونا"],
    country: "US",
    lng: -112.36779722222222,
    lat: 33.629194444444444
  },
  {
    names: ["اوبرلونگوتس"],
    country: "DE",
    lng: 12.716666666666667,
    lat: 50.78333333333333
  },
  {
    names: ["سمنیفکا", "Semenivka", "Семенівка"],
    country: "UA",
    lng: 32.57777777777778,
    lat: 52.175
  },
  {
    names: ["ووپرتال"],
    country: "DE",
    lng: 7.183333333333334,
    lat: 51.266666666666666
  },
  {
    names: ["اوکرایینکا، استان کیف", "اوکرایینکا", "Українка"],
    country: "UA",
    lng: 30.743491666666667,
    lat: 50.15308611111111
  },
  {
    names: ["کوربیا", "Corabia"],
    country: "RO",
    lng: 24.503333333333334,
    lat: 43.77361111111111
  },
  {
    names: ["پورت‌سعید", "بورسعید (عربی)", "Būr Saʻīd"],
    country: "EG",
    lng: 32.28333333333333,
    lat: 31.25
  },
  {
    names: ["تاونوس‌اشتاین", "Taunusstein"],
    country: "DE",
    lng: 8.15,
    lat: 50.13333333333333
  },
  {
    names: ["ماشتا", "Märsta"],
    country: "SE",
    lng: 17.85,
    lat: 59.61666666666667
  },
  {
    names: ["حربیه (شهر)", "Harbiye"],
    country: "TR",
    lng: 36.13333333333333,
    lat: 36.11666666666667
  },
  {
    names: ["کوول", "Kovel", "Ковель", "Kowel"],
    country: "UA",
    lng: 24.716666666666665,
    lat: 51.21666666666667
  },
  { names: ["کاشان", "کاشون، کاشو"], lng: 51.58, lat: 33.98 },
  {
    names: ["دزرژینسکیی، استان مسکو", "Дзержинский"],
    country: "RU",
    lng: 37.85,
    lat: 55.63333333333333
  },
  {
    names: ["رینو، نوادا"],
    country: "US",
    lng: -119.8218111111111,
    lat: 39.52711111111111
  },
  {
    names: ["هلدرونگن"],
    country: "DE",
    lng: 11.216666666666667,
    lat: 51.30138888888889
  },
  {
    names: ["آوانوس", "Avanos"],
    country: "TR",
    lng: 34.85,
    lat: 38.71666666666667
  },
  { names: ["یاکینجا", "Yakınca"], country: "TR", lng: 38.25, lat: 38.3 },
  {
    names: ["هارتاشن، سیونیک", "Հարթաշեն"],
    country: "AM",
    lng: 46.41972222222222,
    lat: 39.48583333333333
  },
  {
    names: ["پوکراشن", "Փոքրաշեն"],
    country: "AM",
    lng: 43.88333333333333,
    lat: 40.9
  },
  {
    names: ["اوشن ساید، کالیفرنیا", "اوشن ساید"],
    country: "US",
    lng: -117.32583333333334,
    lat: 33.211666666666666
  },
  {
    names: ["مونکلووا"],
    country: "MX",
    lng: -101.42222222222223,
    lat: 26.910277777777775
  },
  { names: ["بردسیر"], lng: 56.575, lat: 29.9264 },
  { names: ["آگوستوسبورگ"], country: "DE", lng: 13.1, lat: 50.81444444444444 },
  { names: ["شرندورف"], country: "DE", lng: 9.533333333333333, lat: 48.8 },
  {
    names: ["بارم‌اشتت"],
    country: "DE",
    lng: 9.766666666666667,
    lat: 53.78333333333333
  },
  {
    names: ["هولا پریستان", "Hola Prystan", "Гола Пристань"],
    country: "UA",
    lng: 32.516666666666666,
    lat: 46.516666666666666
  },
  {
    names: ["کینگستون (جزیره نورفلک)", "Daun a'Taun"],
    country: "AU",
    lng: 167.96666666666667,
    lat: -29.066666666666666
  },
  { names: ["کتالم و سادات‌شهر"], lng: 50.6961, lat: 36.8891 },
  {
    names: ["استانبول", "İstanbul"],
    country: "TR",
    lng: 28.955,
    lat: 41.01361111111111
  },
  { names: ["فولادشهر"], lng: 51.42111111111111, lat: 32.490833333333335 },
  {
    names: ["فرایزنگ"],
    country: "DE",
    lng: 11.748888888888889,
    lat: 48.40277777777778
  },
  { names: ["مولفتا", "Molfetta"], country: "IT", lng: 16.6, lat: 41.2 },
  {
    names: ["ابو تیج", "ابوتیج"],
    country: "EG",
    lng: 31.328055555555554,
    lat: 27.03666666666667
  },
  { names: ["علی‌آباد کتول", "علی‌آباد"], lng: 54.571879, lat: 36.941857 },
  {
    names: ["باد فردیریش‌شال"],
    country: "DE",
    lng: 9.216666666666667,
    lat: 49.233333333333334
  },
  {
    names: ["گرسشیرما"],
    country: "DE",
    lng: 13.278055555555556,
    lat: 50.96638888888889
  },
  {
    names: ["هونفلد"],
    country: "DE",
    lng: 9.766666666666667,
    lat: 50.666666666666664
  },
  { names: ["چورلو", "Çorlu"], country: "TR", lng: 27.8, lat: 41.15 },
  {
    names: ["شچورز", "Shchors", "Щорс"],
    country: "UA",
    lng: 31.950833333333332,
    lat: 51.82027777777778
  },
  { names: ["نورآباد (ممسنی)"], lng: 51.2, lat: 29.8 },
  {
    names: ["زولتس آم نکا"],
    country: "DE",
    lng: 8.631666666666668,
    lat: 48.36277777777778
  },
  {
    names: ["ونجو مره", "Vânju Mare"],
    country: "RO",
    lng: 22.876944444444444,
    lat: 44.43194444444444
  },
  { names: ["مارنه (هل‌اشتاین)", "Marne"], country: "DE", lng: 9, lat: 53.95 },
  {
    names: ["وایک", "Վայք"],
    country: "AM",
    lng: 45.46527777777778,
    lat: 39.69166666666666
  },
  {
    names: ["کپنهاگ", "København"],
    country: "DK",
    lng: 12.568333333333333,
    lat: 55.67611111111111
  },
  {
    names: ["دوزیچی"],
    country: "TR",
    lng: 36.45666666666667,
    lat: 37.24305555555556
  },
  {
    names: ["چولا ویستا، کالیفرنیا", "چولا ویستا"],
    country: "US",
    lng: -117.04805555555555,
    lat: 32.62777777777778
  },
  {
    names: ["میرهورود", "Миргород"],
    country: "UA",
    lng: 33.6,
    lat: 49.96666666666667
  },
  {
    names: ["هلیفکس، نوا اسکوشیا", "هلیفکس", "Halifax", "Jipugtug", "Chebucto"],
    country: "CA",
    lng: -63.61,
    lat: 44.669999999999995
  },
  { names: ["کردکوی"], lng: 54.1133, lat: 36.7917 },
  {
    names: ["پروالسک", "Perevalsk", "Перевальськ"],
    country: "UA",
    lng: 38.81666666666667,
    lat: 48.43333333333333
  },
  {
    names: ["زیمرن"],
    country: "DE",
    lng: 7.516666666666667,
    lat: 49.983333333333334
  },
  {
    names: ["بو سعده، الجزایر", "بو سعده", "بو سعاده"],
    country: "DZ",
    lng: 4.181666666666667,
    lat: 35.219166666666666
  },
  {
    names: ["اسپرینگفیلد، میزوری", "Springfield, Missouri"],
    country: "US",
    lng: -93.28611111111111,
    lat: 37.19499999999999
  },
  {
    names: ["جرادزور", "Ջրաձոր"],
    country: "AM",
    lng: 43.77194444444444,
    lat: 40.915
  },
  { names: ["اگواچیکا"], country: "CO", lng: 73.62694444444443, lat: 8.3125 },
  {
    names: ["فارل", "Varel"],
    country: "DE",
    lng: 8.136111111111111,
    lat: 53.39694444444444
  },
  {
    names: ["سایو پایولو", "São Paulo"],
    country: "BR",
    lng: -46.63333333333333,
    lat: -23.55
  },
  {
    names: ["مادرید (کوندینامارکا)", "Madrid"],
    country: "CO",
    lng: -74.26833333333333,
    lat: 4.734444444444445
  },
  { names: ["رم", "Roma"], country: "IT", lng: 12.5, lat: 41.9 },
  {
    names: ["لیمبورگ آن در لان"],
    country: "DE",
    lng: 8.066666666666666,
    lat: 50.38333333333333
  },
  {
    names: ["نوودر", "Năvodari"],
    country: "RO",
    lng: 28.613333333333333,
    lat: 44.321111111111115
  },
  {
    names: ["برنوا"],
    country: "DE",
    lng: 12.436111111111112,
    lat: 49.81027777777778
  },
  {
    names: ["پارما", "Parma"],
    country: "IT",
    lng: 10.333333333333334,
    lat: 44.8
  },
  {
    names: ["اورنج، کالیفرنیا", "City of Orange"],
    country: "US",
    lng: -117.8325,
    lat: 33.80305555555555
  },
  {
    names: ["توتتناو"],
    country: "DE",
    lng: 7.943888888888889,
    lat: 47.82944444444445
  },
  {
    names: ["کارابرد، لوری", "کارابرد", "Քարաբերդ"],
    country: "AM",
    lng: 44.52222222222222,
    lat: 40.84777777777778
  },
  {
    names: ["لوخویتسیا", "Лохвиця"],
    country: "UA",
    lng: 33.272266,
    lat: 50.359754
  },
  { names: ["آپاون", "Ապավեն"], country: "AM", lng: 44.35, lat: 41.2 },
  { names: ["هویزن‌اشتام"], country: "DE", lng: 8.8, lat: 50.05 },
  {
    names: ["سویز (شهر)", "سویز"],
    country: "EG",
    lng: 32.55,
    lat: 29.966666666666665
  },
  {
    names: ["اسنیژنه", "Snizhne", "Сніжне"],
    country: "UA",
    lng: 38.76561111111111,
    lat: 48.028277777777774
  },
  {
    names: ["تروشتلفینگن"],
    country: "DE",
    lng: 9.244444444444444,
    lat: 48.308055555555555
  },
  { names: ["بردسکن"], lng: 57.9702, lat: 35.2624 },
  {
    names: ["شورین"],
    country: "DE",
    lng: 11.416666666666666,
    lat: 53.63333333333333
  },
  { names: ["ربنیک"], country: "PL", lng: 18.55, lat: 50.1 },
  {
    names: ["آلپیرسباخ"],
    country: "DE",
    lng: 8.40388888888889,
    lat: 48.346111111111114
  },
  {
    names: ["مودیکا", "Modica"],
    country: "IT",
    lng: 14.766666666666667,
    lat: 36.85
  },
  { names: ["تهران"], lng: 51.4, lat: 35.7 },
  {
    names: ["دازل"],
    country: "DE",
    lng: 9.690277777777778,
    lat: 51.80333333333333
  },
  {
    names: ["کالوا"],
    country: "DE",
    lng: 13.950833333333332,
    lat: 51.74583333333334
  },
  {
    names: ["آرتاشات", "Արտաշատ"],
    country: "AM",
    lng: 44.550555555555555,
    lat: 39.95388888888889
  },
  {
    names: ["ووکوو"],
    country: "PL",
    lng: 22.383333333333333,
    lat: 51.92722222222222
  },
  {
    names: ["ورنویشن"],
    country: "DE",
    lng: 13.733055555555556,
    lat: 52.63305555555556
  },
  {
    names: ["بتزدورف (زیگ)", "Betzdorf"],
    country: "DE",
    lng: 7.872777777777778,
    lat: 50.785555555555554
  },
  {
    names: ["میری (مالزی)", "میری", "Miri"],
    country: "MY",
    lng: 113.99333333333334,
    lat: 4.402777777777779
  },
  {
    names: ["هایکاوان", "Հայկավան"],
    country: "AM",
    lng: 43.769999999999996,
    lat: 40.755833333333335
  },
  {
    names: ["کامو، ارمنستان", "کامو", "Կամո"],
    country: "AM",
    lng: 43.94833333333333,
    lat: 40.82805555555556
  },
  {
    names: ["ماراکایبو", "Maracaibo"],
    country: "VE",
    lng: -71.63333333333334,
    lat: 10.65
  },
  {
    names: ["بولهراد", "Bolhrad", "Болград"],
    country: "UA",
    lng: 28.61277777777778,
    lat: 45.66722222222222
  },
  {
    names: ["تلمچی", "Tălmaciu"],
    country: "RO",
    lng: 24.261111111111113,
    lat: 45.666666666666664
  },
  {
    names: ["کوبلیاکی", "Кобеляки"],
    country: "UA",
    lng: 34.2,
    lat: 49.13333333333333
  },
  {
    names: ["شولم (نوردراین-وستفالن)", "Schwelm"],
    country: "DE",
    lng: 7.266666666666667,
    lat: 51.266666666666666
  },
  {
    names: ["اشتولبرگ (راینلند)", "Stolberg"],
    country: "DE",
    lng: 6.233333333333333,
    lat: 50.766666666666666
  },
  { names: ["بیاویستوک"], country: "PL", lng: 23.15, lat: 53.11666666666667 },
  {
    names: ["بوتوشن", "Botoşani"],
    country: "RO",
    lng: 26.669444444444444,
    lat: 47.74861111111111
  },
  { names: ["دسوا-رسلا"], country: "DE", lng: 12.25, lat: 51.833333333333336 },
  {
    names: ["مولن (اشلسویگ-هل‌اشتاین)", "Mölln"],
    country: "DE",
    lng: 10.684722222222222,
    lat: 53.62694444444445
  },
  {
    names: ["هاریچ", "Հառիճ"],
    country: "AM",
    lng: 44.0075,
    lat: 40.59805555555556
  },
  {
    names: ["زایفنرزدورف"],
    country: "DE",
    lng: 14.616666666666667,
    lat: 50.93333333333333
  },
  {
    names: ["ومدینگ"],
    country: "DE",
    lng: 10.716666666666667,
    lat: 48.86666666666667
  },
  { names: ["گلوگاه"], lng: 53.8083, lat: 36.7297 },
  {
    names: ["لاینفلدن-اشتردینگن"],
    country: "DE",
    lng: 9.142777777777777,
    lat: 48.69277777777778
  },
  {
    names: ["ابرمان‌اشتات"],
    country: "DE",
    lng: 11.166666666666666,
    lat: 49.766666666666666
  },
  {
    names: ["کینگهوانگداو", "秦皇岛市"],
    country: "CN",
    lng: 119.6,
    lat: 39.93333333333333
  },
  {
    names: ["ناگانو (شهر)", "Nagano", "長野"],
    country: "JP",
    lng: 138.18333333333334,
    lat: 36.63333333333333
  },
  {
    names: ["تالین (ارمنستان)", "تالین", "Թալին"],
    country: "AM",
    lng: 43.8736625,
    lat: 40.382958333333335
  },
  {
    names: ["نوی‌اشتات آن در دانوب", "Neustadt a.d.Donau"],
    country: "DE",
    lng: 11.766666666666667,
    lat: 48.8
  },
  {
    names: ["راونا", "Ravenna"],
    country: "IT",
    lng: 12.2,
    lat: 44.416666666666664
  },
  { names: ["بدبورگ", "Bedburg"], country: "DE", lng: 6.5625, lat: 51 },
  {
    names: ["آکیتا (شهر)", "آکیتا", "秋田"],
    country: "JP",
    lng: 140.1025833333333,
    lat: 39.72002777777778
  },
  {
    names: ["میلواکی، ویسکانسین", "میلواکی", "Milwaukee"],
    country: "US",
    lng: -87.95583333333333,
    lat: 43.05222222222222
  },
  {
    names: ["اوچاکیف", "Ochakiv", "Очаків"],
    country: "UA",
    lng: 31.539166666666667,
    lat: 46.618611111111115
  },
  { names: ["کومیتان"], country: "MX", lng: -92.13333333333334, lat: 16.25 },
  {
    names: ["یانگژو", "扬州市"],
    country: "",
    lng: 119.41666666666667,
    lat: 32.4
  },
  {
    names: ["بالدیبیا", "Valdivia"],
    country: "CL",
    lng: -73.24583333333334,
    lat: -39.81388888888888
  },
  {
    names: ["هایراوانک", "Հայրավանք"],
    country: "AM",
    lng: 45.096944444444446,
    lat: 40.43444444444444
  },
  { names: ["کاترینهولم", "Katrineholm"], country: "SE", lng: 16.2, lat: 59 },
  {
    names: ["آکاپولکو، گویررو", "آکاپولکو", "Acapulco"],
    country: "MX",
    lng: -99.8825,
    lat: 16.863611111111112
  },
  {
    names: ["آدناو"],
    country: "DE",
    lng: 6.933333333333334,
    lat: 50.38333333333333
  },
  {
    names: ["میلیشوتس", "Milișăuți"],
    country: "RO",
    lng: 26.004444444444445,
    lat: 47.78638888888889
  },
  {
    names: ["روتنباخ آن در پگنیتز", "Röthenbach a.d.Pegnitz"],
    country: "DE",
    lng: 11.247499999999999,
    lat: 49.484722222222224
  },
  {
    names: ["یاماگاتا (شهر)", "Yamagata", "山形"],
    country: "JP",
    lng: 140.33333333333334,
    lat: 38.25
  },
  {
    names: ["اوجان، آراگاتسوتن", "اوجان", "Ուջան"],
    country: "AM",
    lng: 44.20472222222222,
    lat: 40.29833333333333
  },
  { names: ["کهنوج", "کهنو"], lng: 57.75, lat: 28.05 },
  {
    names: ["سن دیگو", "سن دییگو"],
    country: "US",
    lng: -117.16250000000001,
    lat: 32.715
  },
  {
    names: ["تولوکا"],
    country: "MX",
    lng: -99.6538888888889,
    lat: 19.292222222222225
  },
  { names: ["خرمشهر"], lng: 48.11, lat: 30.26 },
  {
    names: ["سانتا کلارا (کوبا)"],
    country: "CU",
    lng: -79.9649388888889,
    lat: 22.406919444444444
  },
  {
    names: ["هودیکسوال", "Hudiksvall, Sweden"],
    country: "SE",
    lng: 17.116666666666667,
    lat: 61.733333333333334
  },
  { names: ["النهود"], country: "SD", lng: 28.433333333333334, lat: 12.7 },
  { names: ["لانگیربین"], country: "NO", lng: 15.55, lat: 78.21666666666667 },
  {
    names: ["کلمبوس، جورجیا", "Columbus"],
    country: "US",
    lng: -84.94027777777778,
    lat: 32.492222222222225
  },
  {
    names: ["پیورا", "Piura"],
    country: "PE",
    lng: -80.63333333333334,
    lat: -5.2
  },
  {
    names: ["لوکاو (نیدرلاوسزیتز)"],
    country: "DE",
    lng: 13.716666666666667,
    lat: 51.85
  },
  {
    names: ["اینگولشتات"],
    country: "DE",
    lng: 11.42611111111111,
    lat: 48.76361111111111
  },
  {
    names: ["ریو برانکو", "Rio Branco"],
    country: "BR",
    lng: -67.81,
    lat: -9.974722222222223
  },
  {
    names: ["سان خوسه دل گاوریاره", "San José del Guaviare"],
    country: "CO",
    lng: -72.63333333333334,
    lat: 2.5666666666666664
  },
  {
    names: ["هاندان", "邯郸市"],
    country: "CN",
    lng: 114.48333333333333,
    lat: 36.6
  },
  {
    names: ["نجع حمادی", "Nag Hammadi"],
    country: "EG",
    lng: 32.25,
    lat: 26.05
  },
  {
    names: ["رگنسبورگ"],
    country: "DE",
    lng: 12.083333333333334,
    lat: 49.016666666666666
  },
  { names: ["سیندیرگی"], country: "TR", lng: 28.175, lat: 39.24 },
  { names: ["باربادوس"], lng: -59.53333333333333, lat: 13 },
  {
    names: ["سومرداو"],
    country: "DE",
    lng: 11.116944444444444,
    lat: 51.16166666666666
  },
  {
    names: ["اناپویما", "Anapoima"],
    country: "CO",
    lng: -74.53611111111111,
    lat: 4.550277777777778
  },
  {
    names: ["کاتنارات، لوری", "کاتنارات", "Կաթնառատ"],
    country: "AM",
    lng: 44.17944444444444,
    lat: 41.08833333333334
  },
  { names: ["بابلسر"], lng: 52.6456, lat: 36.7008 },
  {
    names: ["لرناپات", "Լեռնապատ"],
    country: "AM",
    lng: 44.39722222222222,
    lat: 40.82
  },
  {
    names: ["هوونانادزور", "Հովնանաձոր"],
    country: "AM",
    lng: 44.526944444444446,
    lat: 41.031666666666666
  },
  {
    names: ["شونگاو، بایرن", "Schongau"],
    country: "DE",
    lng: 10.9,
    lat: 47.81666666666667
  },
  {
    names: ["رزنتال (هسن)", "Rosenthal"],
    country: "DE",
    lng: 8.866666666666667,
    lat: 50.96666666666667
  },
  {
    names: ["سکاتسدیل، آریزونا"],
    country: "US",
    lng: -111.93333333333334,
    lat: 33.5
  },
  { names: ["اومول", "Åmål"], country: "SE", lng: 12.7, lat: 59.05 },
  {
    names: ["تساو، ارمنستان", "تساو", "Ծավ"],
    country: "AM",
    lng: 46.45805555555556,
    lat: 39.051944444444445
  },
  {
    names: ["لایپزیگ"],
    country: "DE",
    lng: 12.383333333333333,
    lat: 51.333333333333336
  },
  {
    names: ["مولدوا نویه", "Moldova Nouă"],
    country: "RO",
    lng: 21.663888888888888,
    lat: 44.717777777777776
  },
  {
    names: ["فیسکسیترا", "Fisksätra"],
    country: "SE",
    lng: 18.252777777777776,
    lat: 59.291666666666664
  },
  {
    names: ["جیاجیانگ", "九江市"],
    country: "CN",
    lng: 115.98722222222223,
    lat: 29.738055555555558
  },
  {
    names: ["سراشن", "Սրաշեն"],
    country: "AM",
    lng: 46.493611111111115,
    lat: 39.07888888888889
  },
  {
    names: ["لیسشیل", "Lysekil"],
    country: "SE",
    lng: 11.433333333333334,
    lat: 58.28333333333333
  },
  {
    names: ["ورین تساقکاوان", "Վերին Ծաղկավան"],
    country: "AM",
    lng: 45.33111111111111,
    lat: 40.94194444444444
  },
  {
    names: ["کیوتو", "Kyoto", "京都"],
    country: "JP",
    lng: 135.76833333333335,
    lat: 35.01166666666666
  },
  {
    names: ["باتنه، الجزایر", "باتنه", "Batna", "ⵜⴱⴰⵜⴻⵏⵜ"],
    country: "DZ",
    lng: 6.166666666666667,
    lat: 35.55
  },
  { names: ["تمی الامدید"], country: "EG", lng: 31.534338, lat: 30.909884 },
  { names: ["تسولپیش"], country: "DE", lng: 6.65, lat: 50.7 },
  {
    names: ["کراسنودوم", "Krasnodon", "Краснодон"],
    country: "UA",
    lng: 39.733333333333334,
    lat: 48.3
  },
  {
    names: ["موناکوویل", "موناکو-ویل", "Monaco-Ville"],
    country: "MC",
    lng: 7.4225,
    lat: 43.73083333333334
  },
  {
    names: ["تاندزاور", "Տանձավեր"],
    country: "AM",
    lng: 46.32833333333333,
    lat: 39.35027777777778
  },
  { names: ["تاراشچا", "Тараща"], country: "UA", lng: 30.5, lat: 49.55 },
  {
    names: ["زلب"],
    country: "DE",
    lng: 12.133333333333333,
    lat: 50.166666666666664
  },
  {
    names: ["ال کگروو، کالیفرنیا", "ال کگروو"],
    country: "US",
    lng: -121.38194444444444,
    lat: 38.43833333333333
  },
  {
    names: ["کالاما، واشینگتن", "Kalama, Washington"],
    country: "US",
    lng: -122.8425,
    lat: 46.00861111111111
  },
  {
    names: ["میرس", "Moers"],
    country: "DE",
    lng: 6.619722222222222,
    lat: 51.45916666666667
  },
  {
    names: ["اسکیل", "Eskil"],
    country: "TR",
    lng: 33.416666666666664,
    lat: 38.4
  },
  {
    names: ["باد گروند (هارز)"],
    country: "DE",
    lng: 10.238333333333333,
    lat: 51.811388888888885
  },
  {
    names: ["پاتنوس"],
    country: "TR",
    lng: 42.868611111111115,
    lat: 39.23583333333333
  },
  {
    names: ["های پوینت، کارولینای شمالی", "High Point"],
    country: "US",
    lng: -79.9975,
    lat: 35.970555555555556
  },
  {
    names: ["نیکسار", "Niksar"],
    country: "TR",
    lng: 36.96666666666667,
    lat: 40.583333333333336
  },
  {
    names: ["آغاونادزور، کوتایک", "آغاونادزور", "Աղավնաձոր"],
    country: "AM",
    lng: 44.69138888888889,
    lat: 40.58416666666667
  },
  {
    names: ["آگوستا، جورجیا", "Augusta, Georgia"],
    country: "US",
    lng: -81.97500000000001,
    lat: 33.47
  },
  {
    names: ["یحیی‌لی", "Yahyalı"],
    country: "TR",
    lng: 35.36083333333333,
    lat: 38.1
  },
  {
    names: ["آیزناخ"],
    country: "DE",
    lng: 10.320555555555556,
    lat: 50.976111111111116
  },
  {
    names: ["هورنبرگ"],
    country: "DE",
    lng: 10.616666666666667,
    lat: 52.016666666666666
  },
  {
    names: ["دونتسک", "Донецьк"],
    country: "UA",
    lng: 37.805277777777775,
    lat: 48.00277777777778
  },
  {
    names: ["اسکوپیه", "Скопје", "Skopje"],
    country: "MK",
    lng: 21.433333333333334,
    lat: 42
  },
  {
    names: ["لیمباخ-اوبرفرونا"],
    country: "DE",
    lng: 12.75,
    lat: 50.86666666666667
  },
  {
    names: ["زاپروژیا", "Запоріжжя"],
    country: "UA",
    lng: 35.166666666666664,
    lat: 47.833333333333336
  },
  {
    names: ["اسویاتوهیرسک", "Sviatohirsk", "Святогірськ"],
    country: "UA",
    lng: 37.56666666666667,
    lat: 49.03333333333333
  },
  {
    names: ["فورت کالینز، کلرادو"],
    country: "US",
    lng: -105.07805555555555,
    lat: 40.55916666666666
  },
  {
    names: ["تان‌هاوزن (بایرن)"],
    country: "DE",
    lng: 10.466666666666667,
    lat: 48.266666666666666
  },
  {
    names: ["کرفلد", "Krefeld"],
    country: "DE",
    lng: 6.566666666666666,
    lat: 51.333333333333336
  },
  { names: ["آیانجیک"], country: "TR", lng: 34.583333333333336, lat: 41.95 },
  {
    names: ["نارلیجا", "Narlıca"],
    country: "TR",
    lng: 36.21666666666667,
    lat: 36.233333333333334
  },
  { names: ["کولدینگ"], country: "", lng: 9.5, lat: 55.49166666666667 },
  {
    names: ["اولتنیتسا", "Oltenița"],
    country: "RO",
    lng: 26.636666666666667,
    lat: 44.086666666666666
  },
  {
    names: ["شارلوت، کارولینای شمالی", "شارلوت", "Charlotte"],
    country: "US",
    lng: -80.84333333333333,
    lat: 35.22694444444445
  },
  {
    names: ["دیترویت", "دیترویت، میشیگان", "Detroit"],
    country: "US",
    lng: -83.04583333333333,
    lat: 42.331388888888895
  },
  {
    names: ["آوشن", "Ավշեն"],
    country: "AM",
    lng: 44.291666666666664,
    lat: 40.725833333333334
  },
  {
    names: [
      "سیبیو",
      "(به رومانیایی: Sibiu)",
      "(به آلمانی: Hermannstadt)",
      "(به مجاری: Nagyszeben)"
    ],
    country: "RO",
    lng: 24.15222222222222,
    lat: 45.795833333333334
  },
  {
    names: ["وست ولی سیتی، یوتا", "West Valley City"],
    country: "US",
    lng: -111.99388888888889,
    lat: 40.689166666666665
  },
  { names: ["کوهدشت", "«کویه شت» و «کو شت»"], lng: 47.606335, lat: 33.534847 },
  { names: ["کاشمر"], lng: 58.4819, lat: 35.2364 },
  {
    names: ["ترویتسک، اوبلاست مسکو", "Троицк"],
    country: "RU",
    lng: 37.30916666666666,
    lat: 55.49138888888889
  },
  { names: ["الجزیره"], country: "DZ", lng: 3.216666666666667, lat: 36.7 },
  {
    names: ["تلمسان"],
    country: "DZ",
    lng: -1.3166666666666667,
    lat: 34.882777777777775
  },
  { names: ["اشمالکالدن"], country: "DE", lng: 10.45, lat: 50.71666666666667 },
  {
    names: ["دلمنهورست"],
    country: "DE",
    lng: 8.631666666666668,
    lat: 53.050555555555555
  },
  {
    names: ["ریداشتات"],
    country: "DE",
    lng: 8.504444444444445,
    lat: 49.83722222222222
  },
  {
    names: ["شانگهای", "Shanghai", "上海"],
    country: "AM",
    lng: 121.5,
    lat: 31.2
  },
  {
    names: ["کلمبو", "Colombo", "කොළඹ", "கொழும்பு"],
    country: "LK",
    lng: 79.84277777777777,
    lat: 6.934444444444445
  },
  {
    names: ["دوغس"],
    country: "AM",
    lng: 44.27166666666667,
    lat: 40.22277777777778
  },
  {
    names: ["کاپوتان", "Կապուտան"],
    country: "AM",
    lng: 44.693888888888885,
    lat: 40.324444444444445
  },
  {
    names: ["اشترکو (مارک)", "Storkow"],
    country: "DE",
    lng: 13.933333333333334,
    lat: 52.25
  },
  {
    names: ["شوارتسهایده"],
    country: "DE",
    lng: 13.866666666666667,
    lat: 51.48305555555556
  },
  {
    names: ["سن-پیر-ا-میکلون"],
    lng: -56.166666666666664,
    lat: 46.78333333333333
  },
  {
    names: ["چیوا، ارمنستان", "چیوا"],
    country: "AM",
    lng: 45.14083333333333,
    lat: 39.76722222222222
  },
  { names: ["نصیرشهر"], lng: 51.1369, lat: 35.4953 },
  {
    names: ["هفیی", "(به چینی: 合肥)"],
    country: "",
    lng: 117.28333333333333,
    lat: 31.866666666666667
  },
  {
    names: ["آرتسوابرد", "Արծվաբերդ"],
    country: "AM",
    lng: 45.471111111111114,
    lat: 40.83361111111111
  },
  {
    names: ["تساغکالانج", "Ծաղկալանջ"],
    country: "AM",
    lng: 44.2275,
    lat: 40.2
  },
  {
    names: ["اشچینسکو، زدروج", "Trzcińsko-Zdrój"],
    country: "PL",
    lng: 14.616666666666667,
    lat: 52.96666666666667
  },
  {
    names: ["یغوارد", "Եղվարդ"],
    country: "AM",
    lng: 44.481388888888894,
    lat: 40.32166666666667
  },
  { names: ["ماکو"], lng: 44.5586, lat: 39.2867 },
  {
    names: ["یینچوان", "Yinchuan", "银川", "یٍ چُوًا‎"],
    country: "CN",
    lng: 106.26666666666667,
    lat: 38.46666666666667
  },
  {
    names: ["کانکون", "Cancun"],
    country: "MX",
    lng: -86.8475,
    lat: 21.160555555555554
  },
  {
    names: ["موسینسک", "Miusynsk", "Міусинськ"],
    country: "UA",
    lng: 38.885,
    lat: 48.07555555555556
  },
  {
    names: ["اسکوپیه", "Скопје", "Skopje"],
    country: "MK",
    lng: 21.433333333333334,
    lat: 42
  },
  {
    names: ["الینگن"],
    country: "DE",
    lng: 10.966666666666667,
    lat: 49.016666666666666
  },
  {
    names: ["هیمنه", "Haymana"],
    country: "TR",
    lng: 32.5,
    lat: 39.43333333333333
  },
  {
    names: ["موسکرا (کوندینامارکا)", "Mosquera"],
    country: "CO",
    lng: -74.23277777777778,
    lat: 4.707777777777778
  },
  { names: ["مشرنیش"], country: "DE", lng: 6.65, lat: 50.6 },
  {
    names: ["مس، فرانسه", "مس", "Metz"],
    country: "FR",
    lng: 6.177777777777778,
    lat: 49.12027777777778
  },
  {
    names: ["مغارت", "Մղարթ"],
    country: "AM",
    lng: 44.5825,
    lat: 40.99805555555556
  },
  {
    names: ["انجامنا", "نجامنا", "Ndjamena"],
    country: "TD",
    lng: 15.049166666666666,
    lat: 12.113055555555555
  },
  {
    names: ["کورونل اوویدو", "Coronel Oviedo"],
    country: "PY",
    lng: -56.45,
    lat: -25.416666666666668
  },
  {
    names: ["کالاما، واشینگتن", "Kalama, Washington"],
    country: "US",
    lng: -122.8425,
    lat: 46.00861111111111
  },
  {
    names: ["مکزیکو سیتی", "Ciudad de México"],
    country: "MX",
    lng: -99.13333333333334,
    lat: 19.433333333333334
  },
  {
    names: ["متس آیروم", "Մեծ Այրում"],
    country: "AM",
    lng: 44.81916666666667,
    lat: 41.17166666666667
  },
  {
    names: ["دیپلدیزوالده"],
    country: "DE",
    lng: 13.666666666666666,
    lat: 50.89333333333333
  },
  { names: ["مکزیک"], lng: -99.36666666666666, lat: 19.05 },
  { names: ["ستو ماره", "Satu Mare"], country: "RO", lng: 22.89, lat: 47.79 },
  {
    names: ["اوبرنبورگ آم ماین", "Obernburg a.Main"],
    country: "DE",
    lng: 9.141388888888889,
    lat: 49.84
  },
  {
    names: ["حمیدیه (حمیدیه)", "حمیدیه"],
    country: "IR",
    lng: 48.26861111111111,
    lat: 31.485
  },
  {
    names: ["رولا"],
    country: "DE",
    lng: 10.366666666666667,
    lat: 50.89194444444444
  },
  { names: ["نیشابور"], lng: 58.79, lat: 36.21 },
  {
    names: ["براونزویل، تگزاس", "Brownsville, Texas"],
    country: "US",
    lng: -97.48444444444445,
    lat: 25.93027777777778
  },
  { names: ["چهاردانگه (اسلام‌شهر)"], lng: 50.8467, lat: 35.8369 },
  { names: ["سردرود"], lng: 46.4922, lat: 37.9836 },
  {
    names: ["میازاکی", "Miyazaki", "宮崎"],
    country: "JP",
    lng: 131.41666666666666,
    lat: 31.916666666666668
  },
  {
    names: ["آرتسواشن", "Արծվաշեն"],
    country: "AM",
    lng: 45.51555555555556,
    lat: 40.64611111111111
  },
  {
    names: ["سیگیشوآرا", "Sighiṣoara"],
    country: "RO",
    lng: 24.791111111111114,
    lat: 46.216944444444444
  },
  {
    names: ["آوستا", "Avesta"],
    country: "SE",
    lng: 16.168333333333333,
    lat: 60.14555555555555
  },
  {
    names: ["پرت آو اسپاین", "Port of Spain"],
    country: "TT",
    lng: -61.516666666666666,
    lat: 10.666666666666666
  },
  {
    names: ["هندرسون، نوادا", "Henderson, Nevada"],
    country: "US",
    lng: -114.98333333333333,
    lat: 36.03333333333333
  },
  { names: ["گرس-گراو"], country: "DE", lng: 8.485, lat: 49.91916666666666 },
  {
    names: ["دودراشتات", "Duderstadt"],
    country: "DE",
    lng: 10.259722222222223,
    lat: 51.5125
  },
  {
    names: ["اکران، اوهایو", "اکرون، اوهایو", "City of Akron"],
    country: "US",
    lng: -81.51777777777778,
    lat: 41.073055555555555
  },
  {
    names: ["بانگی", "Bangui"],
    country: "CF",
    lng: 18.583333333333332,
    lat: 4.366666666666666
  },
  {
    names: ["جده", "City of Jeddah", "جدّه"],
    lng: 39.172777777777775,
    lat: 21.543333333333337
  },
  { names: ["کرمانشاه", "کرماشان[1][2]"], lng: 47.065, lat: 34.3142 },
  { names: ["واها", "芜湖市"], lng: 118.39250000000001, lat: 31.37 },
  {
    names: ["نیکوپول، اوکراین", "نیکوپول", "Нікополь"],
    country: "UA",
    lng: 34.4,
    lat: 47.56666666666667
  },
  {
    names: ["گورژوف ویلکوپولسکی", "Gorzów Wielkopolski"],
    country: "PL",
    lng: 15.233333333333333,
    lat: 52.733333333333334
  },
  {
    names: ["ریمینی", "Rimini"],
    country: "IT",
    lng: 12.566666666666666,
    lat: 44.05
  },
  { names: ["ونکوور"], country: "CA", lng: -123.1, lat: 49.25 },
  {
    names: ["تاتو (روستا)", "Տաթև"],
    country: "AM",
    lng: 46.24,
    lat: 39.38166666666667
  },
  {
    names: ["سوخومی", "სოხუმი", "Аҟәа"],
    country: "GE",
    lng: 41.015277777777776,
    lat: 43.00333333333333
  },
  {
    names: ["پورتو"],
    country: "",
    lng: -8.621952777777778,
    lat: 41.16214166666666
  },
  {
    names: ["گلیبولو", "Gelibolu"],
    country: "TR",
    lng: 26.666666666666668,
    lat: 40.4
  },
  {
    names: ["همپتون، ویرجینیا", "Hampton, Virginia"],
    country: "US",
    lng: -76.36,
    lat: 37.03472222222222
  },
  {
    names: ["اشتوک‌آخ"],
    country: "DE",
    lng: 9.011388888888888,
    lat: 47.85138888888889
  },
  { names: ["آسپرگ"], country: "DE", lng: 9.133333333333333, lat: 48.9 },
  {
    names: ["میتو (کلمبیا)", "Mitú"],
    country: "CO",
    lng: -70.17333333333333,
    lat: 1.1983333333333333
  },
  {
    names: ["اشتات ولهن"],
    country: "DE",
    lng: 14.032222222222224,
    lat: 50.956944444444446
  },
  {
    names: ["بریندیزی"],
    country: "IT",
    lng: 17.933333333333334,
    lat: 40.63333333333333
  },
  {
    names: ["ورشو", "Warszawa"],
    country: "PL",
    lng: 21.016666666666666,
    lat: 52.233333333333334
  },
  {
    names: ["آپنا", "Ափնա"],
    country: "AM",
    lng: 44.39611111111111,
    lat: 40.43944444444444
  },
  {
    names: ["فراون‌اشتاین (ارتسگبیرگه)", "Frauenstein"],
    country: "DE",
    lng: 13.538055555555555,
    lat: 50.801944444444445
  },
  {
    names: ["ریو دو ژانیرو"],
    lng: -43.19638888888888,
    lat: -22.90833333333333
  },
  { names: ["قروه"], lng: 47.804166, lat: 35.156666 },
  {
    names: ["وارداناشن", "Վարդանաշեն"],
    country: "AM",
    lng: 44.190555555555555,
    lat: 40.05166666666666
  },
  {
    names: ["یراسخ", "Երասխ"],
    country: "AM",
    lng: 44.83555555555556,
    lat: 39.73083333333334
  },
  { names: ["فجه", "Făget"], country: "RO", lng: 22.18, lat: 45.85 },
  {
    names: ["سستو سان جووانی"],
    country: "IT",
    lng: 9.233333333333333,
    lat: 45.53333333333333
  },
  {
    names: ["شینینگ", "Xining", "西宁"],
    country: "CN",
    lng: 101.76666666666667,
    lat: 36.63333333333333
  },
  {
    names: ["جابواتاو دوس گواراراپیس"],
    country: "BR",
    lng: -35.01555555555556,
    lat: -8.112222222222222
  },
  { names: ["دهلی", "दिल्ली"], country: "IN", lng: 77.23, lat: 28.61 },
  { names: ["عنابه"], country: "DZ", lng: 7.766666666666667, lat: 36.9 },
  {
    names: [
      "استاریی کریم",
      "Staryi Krym",
      "Старий Крим",
      "Старый Крым",
      "Eski Qırım"
    ],
    country: "UA",
    lng: 35.08861111111111,
    lat: 45.02916666666667
  },
  { names: ["وینیپگ"], lng: -97.13916666666667, lat: 49.89944444444444 },
  {
    names: ["هاگوی", "Հագվի"],
    country: "AM",
    lng: 44.583333333333336,
    lat: 41.06666666666667
  },
  {
    names: ["بیلسکو بیاوا"],
    country: "PL",
    lng: 19.044444444444448,
    lat: 49.822500000000005
  },
  {
    names: ["مهندسین (استان جیزه)", "مهندسین"],
    country: "EG",
    lng: 31,
    lat: 29
  },
  { names: ["ایذه", "مال امیر"], lng: 49.52, lat: 31.5 },
  {
    names: ["افوریه", "Eforie"],
    country: "RO",
    lng: 28.633333333333333,
    lat: 44.06666666666667
  },
  {
    names: ["لا ویکتوریا (واییه دل کایوکا)", "La Victoria"],
    country: "CO",
    lng: -76.0363888888889,
    lat: 4.521388888888889
  },
  {
    names: ["قورقودالی", "Korkuteli"],
    country: "TR",
    lng: 30.2,
    lat: 37.06666666666667
  },
  {
    names: ["فلن", "Flen"],
    country: "SE",
    lng: 16.583333333333332,
    lat: 59.05
  },
  {
    names: ["گاو-آلگسهایم"],
    country: "DE",
    lng: 8.016666666666667,
    lat: 49.95
  },
  {
    names: ["اشتارنبرگ"],
    country: "DE",
    lng: 11.340555555555556,
    lat: 47.99722222222222
  },
  {
    names: ["وینستون-سیلم", "وینستون-سِیلم"],
    country: "US",
    lng: -80.26049166666667,
    lat: 36.10276388888889
  },
  {
    names: ["تایچونگ", "Taichung", "臺中市"],
    country: "TW",
    lng: 120.66666666666667,
    lat: 24.15
  },
  {
    names: ["ورقله، الجزایر", "ورقله", "وَرڤله"],
    country: "DZ",
    lng: 5.316666666666666,
    lat: 31.95
  },
  {
    names: ["امالفی، انتیوکوا", "Amalfi"],
    country: "CO",
    lng: -75.08333333333333,
    lat: 6.916666666666667
  },
  {
    names: ["ووسکپار", "Ոսկեպար"],
    country: "AM",
    lng: 45.0575,
    lat: 41.06472222222222
  },
  {
    names: ["دوبوفکا، استان ولگوگراد", "Дубовка"],
    country: "RU",
    lng: 44.833333333333336,
    lat: 49.05
  },
  {
    names: ["سالا، سوید", "سالا"],
    country: "SE",
    lng: 16.6,
    lat: 59.916666666666664
  },
  {
    names: ["اتسو، شیگا", "Ōtsu", "大津"],
    country: "JP",
    lng: 135.85,
    lat: 35.016666666666666
  },
  {
    names: ["اوبرکوخن", "Oberkochen"],
    country: "DE",
    lng: 10.105277777777777,
    lat: 48.78388888888889
  },
  {
    names: ["نوراشن، لوری", "نوراشن", "Նորաշեն"],
    country: "AM",
    lng: 44.327222222222225,
    lat: 41.18805555555555
  },
  {
    names: ["خوارز، نویوو لیون"],
    country: "MX",
    lng: -100.08333333333333,
    lat: 25.65
  },
  {
    names: ["فیرفیلد، کالیفرنیا", "فیرفیلد"],
    country: "US",
    lng: -122.05416666666666,
    lat: 38.257777777777775
  },
  { names: ["لبیون-وتین"], country: "DE", lng: 11.9, lat: 51.63333333333333 },
  {
    names: ["مدوفکا", "Մեդովկա"],
    country: "AM",
    lng: 44.345555555555556,
    lat: 41.12277777777778
  },
  {
    names: ["اوبرآسباخ"],
    country: "DE",
    lng: 10.958333333333332,
    lat: 49.42194444444444
  },
  {
    names: ["یاماگوچی (شهر)", "Yamaguchi", "山口"],
    country: "JP",
    lng: 131.46666666666667,
    lat: 34.18333333333333
  },
  {
    names: ["اوبروایسباخ/تورینگنروالد"],
    country: "DE",
    lng: 11.144444444444444,
    lat: 50.58277777777778
  },
  {
    names: ["هیرشبرگ (زاله)", "Hirschberg"],
    country: "DE",
    lng: 11.82,
    lat: 50.405833333333334
  },
  {
    names: ["فیرفیلد، کالیفرنیا", "فیرفیلد"],
    country: "US",
    lng: -122.05416666666666,
    lat: 38.257777777777775
  },
  {
    names: ["کالی (شهر)", "Cali"],
    country: "CO",
    lng: -76.52222222222223,
    lat: 3.4205555555555556
  },
  {
    names: ["میرامار، فلوریدا", "City of Miramar"],
    country: "US",
    lng: -80.2825,
    lat: 25.978888888888886
  },
  { names: ["ووتس‌واوک", "Włocławek"], country: "PL", lng: 19.05, lat: 52.65 },
  {
    names: ["بوستون", "Boston"],
    country: "US",
    lng: -71.06166666666667,
    lat: 42.35777777777778
  },
  {
    names: ["جرامبار", "Ջրամբար"],
    country: "AM",
    lng: 44.433055555555555,
    lat: 40.481944444444444
  },
  {
    names: ["اورنج، کالیفرنیا", "City of Orange"],
    country: "US",
    lng: -117.8325,
    lat: 33.80305555555555
  },
  {
    names: ["سیونیک (روستا)", "سیونیک", "Սյունիք"],
    country: "AM",
    lng: 46.46805555555556,
    lat: 39.203611111111115
  },
  {
    names: ["پومونا، کالیفرنیا", "پومونا", "City of Pomona"],
    country: "US",
    lng: -117.75583333333333,
    lat: 34.06083333333333
  },
  { names: ["خوانسار"], lng: 50.1852, lat: 33.1316 },
  {
    names: ["توکیو"],
    country: "JP",
    lng: 139.71499999999997,
    lat: 35.70055555555556
  },
  {
    names: ["والدنبورگ، بادن-وورتمبرگ", "Waldenburg"],
    country: "DE",
    lng: 9.633333333333333,
    lat: 49.18333333333333
  },
  { names: ["لوند", "Lund"], country: "SE", lng: 13.2, lat: 55.7 },
  {
    names: ["بوجومبورا", "Bujumbura"],
    country: "BI",
    lng: 29.366666666666667,
    lat: -3.3833333333333333
  },
  {
    names: ["سوت (رومانی)", "Sovata", "Szováta"],
    country: "RO",
    lng: 25.074444444444445,
    lat: 46.596111111111114
  },
  { names: ["کیریتز"], country: "DE", lng: 12.4, lat: 52.95 },
  {
    names: ["پلتنبرگ", "Plettenberg"],
    country: "DE",
    lng: 7.883333333333333,
    lat: 51.21666666666667
  },
  {
    names: ["لرناهوویت، لوری", "لرناهوویت", "Լեռնահովիտ"],
    country: "AM",
    lng: 44.309999999999995,
    lat: 41.17027777777778
  },
  {
    names: ["لاتسن", "Laatzen"],
    country: "DE",
    lng: 9.8,
    lat: 52.31666666666667
  },
  {
    names: ["نشاوان", "Նշավան"],
    country: "AM",
    lng: 44.525277777777774,
    lat: 40.02638888888889
  },
  { names: ["شهرضا", "قمشه"], lng: 51.86, lat: 32.01 },
  {
    names: ["اولدنبورگ این هل‌اشتاین", "Oldenburg in Holstein"],
    country: "DE",
    lng: 10.883333333333333,
    lat: 54.3
  },
  { names: ["کاتوویتس", "شهرکاتوویتس"], country: "PL", lng: 19, lat: 50.25 },
  { names: ["قوچان", "خبوشان"], lng: 58.3034, lat: 37.0622 },
  {
    names: ["سانتوس", "Santos"],
    country: "BR",
    lng: -46.325094444444446,
    lat: -23.93698888888889
  },
  {
    names: ["بوخوم"],
    country: "DE",
    lng: 7.215833333333333,
    lat: 51.481944444444444
  },
  {
    names: ["سانتیاگو دوتوکومان", "Tucumán"],
    country: "AR",
    lng: -65.21666666666667,
    lat: -26.816666666666666
  },
  { names: ["زاهدان"], lng: 60.86277777777778, lat: 29.49638888888889 },
  {
    names: ["بلگرن"],
    country: "DE",
    lng: 13.133333333333333,
    lat: 51.483333333333334
  },
  {
    names: ["بوسک، اوکراین", "Busk", "Буськ"],
    country: "UA",
    lng: 24.616666666666667,
    lat: 49.96666666666667
  },
  {
    names: ["داکینگ", "大庆市"],
    country: "CN",
    lng: 125,
    lat: 46.583333333333336
  },
  {
    names: ["کامپالا", "Kampala"],
    country: "UG",
    lng: 32.58111111111111,
    lat: 0.3136111111111111
  },
  { names: ["چاییرالان", "Çayıralan"], country: "TR", lng: 35.65, lat: 39.3 },
  { names: ["بهبهان", "بهبهو"], lng: 50.2417, lat: 30.5959 },
  {
    names: ["وتسلار", "Wetzlar"],
    country: "DE",
    lng: 8.5,
    lat: 50.56666666666667
  },
  {
    names: ["یزچمبیه ازدرویی", "Jastrzębie-Zdrój"],
    country: "PL",
    lng: 18.583333333333332,
    lat: 49.95
  },
  {
    names: ["پراگ", "Praha"],
    country: "CZ",
    lng: 14.416666666666666,
    lat: 50.083333333333336
  },
  { names: ["بوجوا", "亳州市"], lng: 115.75, lat: 33.86666666666667 },
  { names: ["کبودرآهنگ", "کورنگ"], lng: 48.7294, lat: 35.1961 },
  {
    names: ["فتش", "Fetești"],
    country: "RO",
    lng: 27.82361111111111,
    lat: 44.415
  },
  {
    names: ["وایسنبرگ (اوبرلواسزیتس)", "Stadt Weißenberg"],
    country: "DE",
    lng: 14.666666666666666,
    lat: 51.2
  },
  {
    names: ["حکاری"],
    country: "TR",
    lng: 43.733333333333334,
    lat: 37.583333333333336
  },
  {
    names: ["وینزر، انتاریو", "وینزر", "Windsor"],
    country: "CA",
    lng: -83,
    lat: 42.28333333333333
  },
  { names: ["رم", "Roma"], country: "IT", lng: 12.5, lat: 41.9 },
  {
    names: ["آراگاتسوتن (روستا)", "آراگاتسوتن", "Արագածոտն"],
    country: "AM",
    lng: 44.18277777777777,
    lat: 40.25833333333333
  },
  {
    names: ["هایلباد هایلیگن‌اشتات"],
    country: "DE",
    lng: 10.13861111111111,
    lat: 51.37888888888889
  },
  {
    names: ["اتنهایم"],
    country: "DE",
    lng: 7.811944444444444,
    lat: 48.25555555555555
  },
  { names: ["شوژو", "徐州市"], country: "CN", lng: 117.21, lat: 34.26 },
  {
    names: ["پالما ده مایورکا", "(به اسپانیایی: Palma de Mallorca)"],
    country: "ES",
    lng: 2.65,
    lat: 39.56666666666667
  },
  {
    names: ["سالتا", "Salta"],
    country: "AR",
    lng: -65.41666666666667,
    lat: -24.783333333333335
  },
  {
    names: ["داتونگ", "大同市"],
    country: "CN",
    lng: 113.3,
    lat: 40.083333333333336
  },
  {
    names: ["کلشترباخ"],
    country: "DE",
    lng: 8.531111111111112,
    lat: 50.06166666666666
  },
  {
    names: ["هت یای", "หาดใหญ่"],
    country: "TH",
    lng: 100.46666666666667,
    lat: 7.016666666666667
  },
  {
    names: ["نوراشن، گغارکونیک", "نوراشن", "Նորաշեն"],
    country: "AM",
    lng: 45.022777777777776,
    lat: 40.504444444444445
  },
  {
    names: ["بارو، آلاسکا", "Barrow"],
    country: "US",
    lng: -156.76638888888888,
    lat: 71.29555555555555
  },
  {
    names: ["پیتربورو", "Peterborough"],
    country: "GB",
    lng: -0.25,
    lat: 52.583333333333336
  },
  {
    names: ["داویت بک، ارمنستان", "Դավիթ Բեկ"],
    country: "AM",
    lng: 46.49527777777778,
    lat: 39.31805555555556
  },
  {
    names: ["وستمینستر، کلرادو"],
    country: "US",
    lng: -105.05,
    lat: 39.86666666666667
  },
  {
    names: ["ایندیاناپلیس", "ایندیاناپولیس، ایندیانا"],
    country: "US",
    lng: -86,
    lat: 39
  },
  { names: ["لباخ"], country: "DE", lng: 6.91, lat: 49.41 },
  {
    names: ["اوبرهارز آم بروکن"],
    country: "DE",
    lng: 10.816666666666666,
    lat: 51.71666666666667
  },
  {
    names: ["آرویس", "Արևիս"],
    country: "AM",
    lng: 45.901111111111106,
    lat: 39.405
  },
  { names: ["شراتس"], country: "PL", lng: 18.75, lat: 51.6 },
  { names: ["یزد", "نام محلی:یـَـز"], lng: 54.3675, lat: 31.8972 },
  {
    names: ["فارگو، داکوتای شمالی", "شهر فارگو", "City of Fargo"],
    country: "US",
    lng: -96.78944444444444,
    lat: 46.87722222222222
  },
  { names: ["نیکاراگویه"], lng: -86.26666666666667, lat: 12.15 },
  {
    names: ["شرونانتز", "Շրվենանց"],
    country: "AM",
    lng: 46.39138888888889,
    lat: 39.28333333333333
  },
  {
    names: ["گویانیا", "Municipality of Goiânia"],
    country: "BR",
    lng: -49.25,
    lat: -16.666666666666668
  },
  {
    names: ["سوریک، آراگاتسوتن", "سوریک", "Սորիկ"],
    country: "AM",
    lng: 43.71666666666667,
    lat: 40.4
  },
  {
    names: ["ماریلیا"],
    country: "BR",
    lng: -49.94583333333333,
    lat: -22.21388888888889
  },
  {
    names: ["آلاپلی"],
    country: "TR",
    lng: 31.383333333333333,
    lat: 41.18333333333333
  },
  {
    names: ["مارماریک", "Մարմարիկ"],
    country: "AM",
    lng: 44.66833333333333,
    lat: 40.58277777777778
  },
  {
    names: ["کوندواکان"],
    country: "MX",
    lng: -93.16666666666667,
    lat: 18.066666666666666
  },
  {
    names: ["بوخاتوف"],
    country: "PL",
    lng: 19.366666666666667,
    lat: 51.36666666666667
  },
  {
    names: ["والتروپ", "Waltrop"],
    country: "DE",
    lng: 7.383333333333334,
    lat: 51.61666666666667
  },
  { names: ["گرس-بیبراو"], country: "DE", lng: 8.833333333333334, lat: 49.8 },
  {
    names: ["کارمیرگیوغ", "Կարմիրգյուղ"],
    country: "AM",
    lng: 45.18388888888889,
    lat: 40.330555555555556
  },
  {
    names: ["لایشلینگن"],
    country: "DE",
    lng: 7.016666666666667,
    lat: 51.11666666666667
  },
  {
    names: ["برن‌اشتات آن در آیگن"],
    country: "DE",
    lng: 14.82638888888889,
    lat: 51.045833333333334
  },
  {
    names: ["آگاراکاوان", "Ագարակավան"],
    country: "AM",
    lng: 44.06666666666667,
    lat: 40.333333333333336
  },
  {
    names: ["ماینبورگ", "Mainburg"],
    country: "DE",
    lng: 11.783333333333333,
    lat: 48.65
  },
  {
    names: ["اشفینتوخوویتسه"],
    country: "PL",
    lng: 18.916666666666668,
    lat: 50.31666666666667
  },
  {
    names: ["جاکارتا", "Daerah Khusus Ibu Kota Jakarta"],
    country: "ID",
    lng: 106.8,
    lat: -6.2
  },
  {
    names: ["بیه سپیره", "Baia Sprie"],
    country: "RO",
    lng: 23.68861111111111,
    lat: 47.66083333333333
  },
  {
    names: ["بووادزور", "Բովաձոր"],
    country: "AM",
    lng: 44.405277777777776,
    lat: 41.03666666666666
  },
  {
    names: ["پاپانتلا، وراکروز"],
    country: "MX",
    lng: -97.32,
    lat: 20.447777777777777
  },
  {
    names: ["کوبفربرگ"],
    country: "DE",
    lng: 11.566666666666666,
    lat: 50.11666666666667
  },
  {
    names: ["واشتون", "Տաշտուն"],
    country: "AM",
    lng: 46.17194444444444,
    lat: 39.06472222222222
  },
  { names: ["ماکایو"], lng: 1.6666666666666665, lat: 2.3333333333333335 },
  {
    names: ["سیوداد بولیوار", "Ciudad Bolívar"],
    country: "VE",
    lng: -63.527499999999996,
    lat: 8.0875
  },
  { names: ["هاتسفلد (ادر)"], country: "DE", lng: 8.55, lat: 51 },
  {
    names: ["زونترا", "Sontra"],
    country: "DE",
    lng: 9.933333333333334,
    lat: 51.06666666666667
  },
  {
    names: ["سیم، اوبلاست چلیابینسک", "Сим"],
    country: "RU",
    lng: 57.7,
    lat: 54.983333333333334
  },
  { names: ["کوناجیک", "Konacık"], country: "TR", lng: 27.4, lat: 37.05 },
  {
    names: ["روتا"],
    country: "DE",
    lng: 12.417222222222222,
    lat: 51.197222222222216
  },
  {
    names: ["سان خوزه (کاستاریکا)", "سان خوزه", "San José"],
    country: "CR",
    lng: -84.08333333333333,
    lat: 9.933333333333334
  },
  { names: ["ایمنهاوزن"], country: "DE", lng: 9.5, lat: 51.416666666666664 },
  {
    names: ["آزاتاوان", "Ազատավան"],
    country: "AM",
    lng: 44.5,
    lat: 39.983333333333334
  },
  {
    names: ["نشویل", "The City of Nashville"],
    country: "US",
    lng: -86.78333333333333,
    lat: 36.166666666666664
  },
  { names: ["نابورگ"], country: "DE", lng: 12.166666666666666, lat: 49.45 },
  {
    names: ["سیاتل، واشینگتن", "سیاتل", "Seattle"],
    country: "US",
    lng: -122.33305555555555,
    lat: 47.609722222222224
  },
  {
    names: ["نانپینگ", "南平市"],
    country: "CN",
    lng: 118.18333333333334,
    lat: 26.65
  },
  {
    names: ["ناهاپتاوان", "Նահապետավան"],
    country: "AM",
    lng: 44.016666666666666,
    lat: 40.6
  },
  {
    names: ["جیوآجیو", "Geoagiu"],
    country: "RO",
    lng: 23.2,
    lat: 45.919999999999995
  },
  {
    names: ["پکن", "Beijing", "北京"],
    country: "AM",
    lng: 116.39166666666668,
    lat: 39.913888888888884
  },
  {
    names: ["تولیدو، اوهایو", "Toledo, Ohio"],
    country: "US",
    lng: -83.57527777777777,
    lat: 41.66555555555556
  },
  {
    names: ["آنتاروت", "Անտառուտ"],
    country: "AM",
    lng: 44.266666666666666,
    lat: 40.35
  },
  {
    names: ["الیگودرز", "آلیورز، الورز[نیازمند منبع]"],
    lng: 49.67,
    lat: 33.37
  },
  {
    names: ["چیگورودو", "Chigorodó"],
    country: "CO",
    lng: -76.68333333333334,
    lat: 7.666666666666667
  },
  {
    names: ["دورهام، کارولینای شمالی", "Durham, North Carolina"],
    country: "US",
    lng: -78.90722222222223,
    lat: 35.98861111111111
  },
  {
    names: ["پروومایسک، استان میکولاییف", "Pervomaisk", "Первомайськ"],
    country: "UA",
    lng: 30.85,
    lat: 48.04388888888889
  },
  {
    names: ["گینزویل، فلوریدا", "Gainesville, Florida"],
    country: "US",
    lng: -82.32499299999999,
    lat: 29.651999
  },
  {
    names: ["جیاموسی", "佳木斯市"],
    country: "CN",
    lng: 130.31666666666666,
    lat: 46.8
  },
  {
    names: ["گیلبرت، آریزونا", "Gilbert, Arizona"],
    country: "US",
    lng: -111.78916666666666,
    lat: 33.35
  },
  { names: ["بهار (شهر)"], lng: 48.56, lat: 34.54 },
  {
    names: ["گینگن آن در برنتس"],
    country: "DE",
    lng: 10.245,
    lat: 48.62166666666667
  },
  {
    names: ["خاچپار", "Խաչփառ"],
    country: "AM",
    lng: 44.403055555555554,
    lat: 40.12583333333333
  },
  {
    names: ["وادسو (شهرک)", "وادسو", "Vesisaari", "Čáhcesuolu"],
    lng: 29.731388888888887,
    lat: 70.08027777777778
  },
  {
    names: ["کینگزتاون", "Kingstown"],
    country: "VC",
    lng: -61.233333333333334,
    lat: 13.166666666666666
  },
  {
    names: ["فوساگاسوگا", "Fusagasugá"],
    country: "CO",
    lng: -74.35,
    lat: 4.333333333333333
  },
  {
    names: ["ارکلنز", "Erkelenz"],
    country: "DE",
    lng: 6.316666666666666,
    lat: 51.083333333333336
  },
  {
    names: ["کوتا بهارو", "کوت بهارو"],
    country: "MY",
    lng: 102.25,
    lat: 6.133333333333334
  },
  {
    names: ["پوشیکنو، ارمنستان", "پوشیکنو"],
    country: "AM",
    lng: 44.40888888888889,
    lat: 40.958333333333336
  },
  {
    names: ["سوکره", "Sucre", "Charcas, La Plata"],
    country: "BO",
    lng: -65.25,
    lat: -19.033333333333335
  },
  {
    names: ["اشپایشینگن"],
    country: "DE",
    lng: 8.737777777777778,
    lat: 48.075833333333335
  },
  {
    names: ["برکارات", "Բերքառատ"],
    country: "AM",
    lng: 44.16888888888889,
    lat: 40.68138888888889
  },
  { names: ["خرم‌آباد", "خورمووه"], lng: 48.35, lat: 33.48 },
  { names: ["آزاتاشن", "Ազատաշեն"], country: "AM", lng: 44.415, lat: 40.135 },
  { names: ["واراشتاین", "Warstein"], country: "DE", lng: 8.35, lat: 51.45 },
  {
    names: ["براونزویل، تگزاس", "Brownsville, Texas"],
    country: "US",
    lng: -97.48444444444445,
    lat: 25.93027777777778
  },
  {
    names: ["مکه", "مکه المکرمه"],
    country: "SA",
    lng: 39.81666666666667,
    lat: 21.416666666666668
  },
  {
    names: ["انکوریج", "Anchorage"],
    country: "US",
    lng: -149.9,
    lat: 61.21666666666667
  },
  {
    names: ["لنگفلد"],
    country: "DE",
    lng: 13.183333333333334,
    lat: 50.71666666666667
  },
  {
    names: ["خندزورسک", "Խնձորեսկ"],
    country: "AM",
    lng: 46.433611111111105,
    lat: 39.51222222222222
  },
  {
    names: ["کلوژ-نپوکا", "(به رومانیایی: Cluj-Napoca)"],
    country: "RO",
    lng: 23.583333333333332,
    lat: 46.766666666666666
  },
  {
    names: ["ازینه", "Ezine"],
    country: "TR",
    lng: 26.333333333333332,
    lat: 39.78333333333333
  },
  { names: ["تامالی"], country: "GH", lng: -0.8533333333333333, lat: 9.4075 },
  {
    names: ["هوامبو، آنگولا", "Huambo"],
    country: "AO",
    lng: 15.733333333333333,
    lat: -12.766666666666667
  },
  { names: ["فنیقه", "Finike"], country: "TR", lng: 30.15, lat: 36.3 },
  {
    names: ["دزوراموت", "Ձորամուտ"],
    country: "AM",
    lng: 44.29,
    lat: 41.19972222222222
  },
  { names: ["آزادشهر", "شاه‌پسند"], lng: 55.0833, lat: 37.0831 },
  {
    names: ["بزدوقان", "Bozdoğan"],
    country: "TR",
    lng: 28.310277777777777,
    lat: 37.672777777777775
  },
  {
    names: ["بوکارامانگا", "Bucaramanga"],
    country: "CO",
    lng: -73.13333333333334,
    lat: 7.133333333333334
  },
  {
    names: ["اوروت", "Ուռուտ"],
    country: "AM",
    lng: 44.39694444444444,
    lat: 41.071111111111115
  },
  { names: ["پولهایم", "Pulheim"], country: "DE", lng: 6.8, lat: 51 },
  { names: ["دمنهور"], country: "EG", lng: 30.47, lat: 31.040555555555557 },
  {
    names: ["کیتاکیوشو، فوکویوکا", "کیتاکیوشو", "北九州"],
    country: "JP",
    lng: 130.88333333333333,
    lat: 33.88333333333333
  },
  {
    names: ["تارانت"],
    country: "DE",
    lng: 13.580833333333333,
    lat: 50.983333333333334
  },
  {
    names: ["واد مدنی", "ودمدنی"],
    country: "SD",
    lng: 33.516666666666666,
    lat: 14.4
  },
  {
    names: ["هانگا روآ"],
    country: "CL",
    lng: -109.41666666666667,
    lat: -27.133333333333333
  },
  {
    names: ["سمارانگ", "Kota Semarang"],
    country: "ID",
    lng: 110.41666666666667,
    lat: -6.966666666666667
  },
  {
    names: ["مغرادزور", "Մեղրաձոր"],
    country: "AM",
    lng: 44.64972222222222,
    lat: 40.61472222222223
  },
  { names: ["مشگین‌شهر", "خیاو"], lng: 47.665, lat: 38.4047 },
  {
    names: ["گل‌شهر (ترکیه)", "Gülşehir"],
    country: "TR",
    lng: 34.61666666666667,
    lat: 38.75
  },
  {
    names: ["واینگارتن (وورتمبرگ)", "Weingarten"],
    country: "DE",
    lng: 9.644444444444444,
    lat: 47.80916666666666
  },
  {
    names: ["اکاریگوا", "Acarigua"],
    country: "VE",
    lng: -69.20194444444445,
    lat: 9.559722222222224
  },
  {
    names: ["لچاپ", "Լճափ"],
    country: "AM",
    lng: 45.065,
    lat: 40.461111111111116
  },
  {
    names: ["اودسا", "Одесса"],
    country: "UA",
    lng: 30.733333333333334,
    lat: 46.46666666666667
  },
  {
    names: ["جی‌لین", "استان جیلین", "Jilin Province", "吉林"],
    country: "AM",
    lng: 126.2,
    lat: 43.7
  },
  {
    names: ["آنشان (چین)", "鞍山市"],
    country: "CN",
    lng: 122.98333333333333,
    lat: 41.11666666666667
  },
  {
    names: ["اکس-آن-پرووانس", "اکس-ان-پرووانس", "Aix-en-Provence"],
    country: "FR",
    lng: 62.20305555555556,
    lat: 34.341944444444444
  },
  {
    names: ["گوانتانامو"],
    country: "CU",
    lng: -75.21388888888889,
    lat: 20.136666666666667
  },
  {
    names: ["گرنینگن (آلمان)"],
    country: "DE",
    lng: 11.216666666666667,
    lat: 51.93333333333333
  },
  {
    names: ["کارلس‌بد، کالیفرنیا", "کارلس بد"],
    country: "US",
    lng: -117.29694444444445,
    lat: 33.121944444444445
  },
  {
    names: ["هوشی‌مین (شهر)", "شهر هوشی‌مین", "Thành phố Hồ Chí Minh"],
    country: "VN",
    lng: 106.68194444444445,
    lat: 10.769444444444446
  },
  {
    names: ["جانفیدا", "Ջանֆիդա"],
    country: "AM",
    lng: 44.020833333333336,
    lat: 40.04555555555555
  },
  {
    names: ["یریشو"],
    country: "DE",
    lng: 12.016666666666667,
    lat: 52.483333333333334
  },
  { names: ["لامباره", "Lambaré"], country: "PY", lng: -57.64, lat: -25.33 },
  {
    names: ["فیننبورگ", "Vienenburg"],
    country: "DE",
    lng: 10.561111111111112,
    lat: 51.95305555555556
  },
  {
    names: ["یوزفوو"],
    country: "PL",
    lng: 21.236944444444447,
    lat: 52.135555555555555
  },
  {
    names: ["چکالووکا", "Չկալովկա"],
    country: "AM",
    lng: 44.97888888888889,
    lat: 40.50833333333333
  },
  {
    names: ["دلینگن، سار", "Dillingen"],
    country: "DE",
    lng: 6.733333333333333,
    lat: 49.35
  },
  {
    names: ["دینزلاکن", "Dinslaken"],
    country: "DE",
    lng: 6.733333333333333,
    lat: 51.56666666666667
  },
  {
    names: ["برزنبروک"],
    country: "DE",
    lng: 7.916666666666667,
    lat: 52.53333333333333
  },
  {
    names: ["سویانا", "Sullana"],
    country: "PE",
    lng: -80.51666666666667,
    lat: -4.9
  },
  {
    names: ["لوننینگ", "Löningen"],
    country: "DE",
    lng: 7.766666666666667,
    lat: 52.71666666666667
  },
  {
    names: ["یوتربورگ"],
    country: "DE",
    lng: 13.072777777777777,
    lat: 51.99333333333333
  },
  {
    names: ["ایدار-اوبراشتاین"],
    country: "DE",
    lng: 7.313055555555556,
    lat: 49.71138888888889
  },
  { names: ["کوتاییسی", "ქუთაისი"], country: "GE", lng: 42.7, lat: 42.25 },
  { names: ["کیرشنلامیتز"], country: "DE", lng: 11.95, lat: 50.15 },
  {
    names: ["تیمرا"],
    country: "SE",
    lng: 17.325833333333332,
    lat: 62.48694444444445
  },
  {
    names: ["ساگون (کوردوبا)", "Sahagún, Córdoba"],
    country: "CO",
    lng: -75.44777777777779,
    lat: 8.949444444444445
  },
  {
    names: ["لودینگ‌هاوزن"],
    country: "DE",
    lng: 7.444444444444445,
    lat: 51.768055555555556
  },
  {
    names: ["امان", "عمّان"],
    country: "JO",
    lng: 35.93277777777777,
    lat: 31.949722222222224
  },
  {
    names: ["کواب"],
    country: "DE",
    lng: 7.762777777777778,
    lat: 50.088055555555556
  },
  {
    names: ["تموکو"],
    country: "CL",
    lng: -72.66666666666667,
    lat: -38.733333333333334
  },
  {
    names: ["دربن (رومانی)", "Darabani"],
    country: "RO",
    lng: 26.589166666666664,
    lat: 48.186388888888885
  },
  { names: ["لیندنبرگ ایم آلگوی"], country: "DE", lng: 9.9, lat: 47.6 },
  {
    names: ["پزارو", "Pesaro"],
    country: "IT",
    lng: 12.9,
    lat: 43.916666666666664
  },
  {
    names: ["اولو، فنلاند", "اولو", "Oulun kaupunki"],
    country: "FI",
    lng: 25.466666666666665,
    lat: 65.01666666666667
  },
  {
    names: ["هرات", "هِرات", "Herāt"],
    country: "AF",
    lng: 62.20305555555556,
    lat: 34.341944444444444
  },
  {
    names: ["بلومفونتن", "Bloemfontein"],
    country: "ZA",
    lng: 26.216666666666665,
    lat: -29.1
  },
  {
    names: ["ینا"],
    country: "DE",
    lng: 11.586111111111112,
    lat: 50.92722222222222
  },
  {
    names: ["باد کوتزتینگ"],
    country: "DE",
    lng: 12.855,
    lat: 49.176944444444445
  },
  {
    names: ["پاراماریبو", "Paramaribo"],
    country: "SR",
    lng: -55.166666666666664,
    lat: 5.866666666666667
  },
  {
    names: ["آلتنشتایگ"],
    country: "DE",
    lng: 8.604722222222222,
    lat: 48.58638888888889
  },
  {
    names: ["صفاقس"],
    country: "TN",
    lng: 10.766666666666667,
    lat: 34.733333333333334
  },
  {
    names: [
      "پاچوکا، ایدالگو",
      "Pachuca de Soto (اسپانیایی )",
      "Nju̱nthe (Otomi)"
    ],
    country: "MX",
    lng: -98.75,
    lat: 20.1
  },
  { names: ["اشبورن"], country: "DE", lng: 8.57, lat: 50.14361111111111 },
  {
    names: ["آرارات، ارمنستان", "آرارات", "Արարատ"],
    country: "AM",
    lng: 44.714444444444446,
    lat: 39.809444444444445
  },
  {
    names: ["بوردو", "Ville de Bordeaux"],
    country: "FR",
    lng: 0.5783333333333334,
    lat: 44.83861111111111
  },
  {
    names: ["نینبورگ (زاله)", "Nienburg"],
    country: "DE",
    lng: 11.75,
    lat: 51.81666666666667
  },
  {
    names: ["نیکوزیا", "(به یونانی: Λευκωσία)", "(به ترکی استانبولی: Lefkoşa)"],
    country: "",
    lng: 33.36666666666667,
    lat: 35.166666666666664
  },
  {
    names: ["آیرک", "Այրք"],
    country: "AM",
    lng: 45.79055555555556,
    lat: 40.12388888888889
  },
  {
    names: ["کولیاچان", "Culiacán"],
    country: "MX",
    lng: -107.38549722222223,
    lat: 24.804850000000002
  },
  {
    names: ["سکیکده، الجزایر", "سکیکده"],
    country: "DZ",
    lng: 6.9,
    lat: 36.86666666666667
  },
  {
    names: ["سالیناس، کالیفرنیا", "سالیناس"],
    country: "US",
    lng: -121.65555555555557,
    lat: 36.67777777777778
  },
  {
    names: ["هاملن", "Hameln"],
    country: "DE",
    lng: 9.36,
    lat: 52.10305555555556
  },
  {
    names: ["سنتنیال، کلرادو", "سنتنیال"],
    country: "US",
    lng: -104.84388888888888,
    lat: 39.59638888888889
  },
  {
    names: ["ساوث بند، ایندیانا", "South Bend, Indiana"],
    country: "US",
    lng: -86.25527777777778,
    lat: 41.6725
  },
  {
    names: ["مگورل", "Măgurele"],
    country: "RO",
    lng: 26.066111111111113,
    lat: 44.39472222222222
  },
  { names: ["قسنطینه", "قُسَنطینه"], country: "DZ", lng: 6.6, lat: 36.35 },
  {
    names: ["بتزن‌اشتاین"],
    country: "DE",
    lng: 11.417636111111111,
    lat: 49.68027222222222
  },
  {
    names: ["میربوش"],
    country: "DE",
    lng: 6.666666666666667,
    lat: 51.266666666666666
  },
  {
    names: ["لوول، ماساچوست", "City of Lowell"],
    country: "US",
    lng: -71.31472222222222,
    lat: 42.63944444444444
  },
  {
    names: ["مارک‌نویکیرشن"],
    country: "DE",
    lng: 12.316666666666666,
    lat: 50.31666666666667
  },
  {
    names: ["آیگهوویت", "Այգեհովիտ"],
    country: "AM",
    lng: 45.25194444444445,
    lat: 40.974444444444444
  },
  {
    names: ["ورمس", "Worms"],
    country: "DE",
    lng: 8.360833333333334,
    lat: 49.63305555555556
  },
  {
    names: ["آنتوفاگاستا", "Antofagasta"],
    country: "CL",
    lng: -70.4,
    lat: -23.65
  },
  {
    names: ["فریونگ، بایرن", "Freyung"],
    country: "DE",
    lng: 13.55,
    lat: 48.80555555555555
  },
  {
    names: ["یلونایف", "Somba K'e"],
    country: "CA",
    lng: -114.39750000000001,
    lat: 62.44222222222222
  },
  { names: ["دونا"], country: "DE", lng: 13.8575, lat: 50.95472222222222 },
  { names: ["هشتگرد"], lng: 50.6069, lat: 35.9528 },
  {
    names: ["رزویل، کالیفرنیا", "رزویل"],
    country: "US",
    lng: -121.28944444444444,
    lat: 38.7525
  },
  {
    names: ["باکنانگ"],
    country: "DE",
    lng: 9.430555555555555,
    lat: 48.94638888888888
  },
  { names: ["مارینگا"], country: "BR", lng: -51.916666666666664, lat: -23.4 },
  {
    names: ["اویینگن"],
    country: "DE",
    lng: 9.591944444444445,
    lat: 48.70583333333334
  },
  {
    names: ["اوبرلینگن"],
    country: "DE",
    lng: 9.158333333333333,
    lat: 47.766666666666666
  },
  {
    names: ["نویبراندنبورگ"],
    country: "DE",
    lng: 13.261111111111111,
    lat: 53.55694444444444
  },
  {
    names: ["نرکین هاند", "Ներքին Հանդ"],
    country: "AM",
    lng: 46.51694444444444,
    lat: 39.04111111111111
  },
  {
    names: ["نووی سونتس"],
    country: "PL",
    lng: 20.697222222222223,
    lat: 49.62388888888889
  },
  {
    names: ["هسیش لیشتناو", "Hessisch Lichtenau"],
    country: "DE",
    lng: 9.716666666666667,
    lat: 51.2
  },
  {
    names: ["چیکوا", "Ciacova"],
    country: "RO",
    lng: 21.133333333333333,
    lat: 45.5
  },
  {
    names: ["نوی‌اشتات بای کبورگ", "Neustadt b.Coburg"],
    country: "DE",
    lng: 11.121111111111112,
    lat: 50.32888888888889
  },
  {
    names: ["اوباکوی", "Obaköy"],
    country: "TR",
    lng: 32.06666666666667,
    lat: 36.55
  },
  {
    names: ["اشچیانکا", "Trzcianka"],
    country: "PL",
    lng: 16.466666666666665,
    lat: 53.05
  },
  {
    names: ["آکسفورد", "Oxford"],
    country: "GB",
    lng: -1.2577777777777779,
    lat: 51.75194444444445
  },
  {
    names: ["میترتایش"],
    country: "DE",
    lng: 12.233333333333333,
    lat: 49.93333333333333
  },
  { names: ["مرودشت"], lng: 52.83, lat: 29.8 },
  {
    names: ["فولینگن"],
    country: "DE",
    lng: 9.226111111111111,
    lat: 48.46555555555556
  },
  {
    names: ["ایکستلاهواک د رایون"],
    country: "MX",
    lng: -99.76694444444445,
    lat: 19.56888888888889
  },
  {
    names: ["اردو (شهر)", "اردو"],
    country: "TR",
    lng: 37.88333333333333,
    lat: 40.983333333333334
  },
  {
    names: ["دامه (منطقه وشتا)", "Damme"],
    country: "DE",
    lng: 8.198611111111111,
    lat: 52.520833333333336
  },
  {
    names: ["آسونسیون", "Asunción"],
    country: "PY",
    lng: -57.666666666666664,
    lat: 25.266666666666666
  },
  {
    names: ["سانتیاگو د کوبا", "Santiago de Cuba"],
    country: "CU",
    lng: -75.82055555555556,
    lat: 20.028333333333332
  },
  { names: ["چیا (کلمبیا)", "Chía"], country: "CO", lng: 74.05, lat: 4.85 },
  {
    names: ["لستر", "City of Leicester"],
    country: "GB",
    lng: -1.13852,
    lat: 52.63422
  },
  {
    names: ["حلب", "حَلب"],
    country: "SY",
    lng: 37.166666666666664,
    lat: 36.21666666666667
  },
  {
    names: ["بوخن (ادنوالد)"],
    country: "DE",
    lng: 9.323333333333332,
    lat: 49.52166666666667
  },
  {
    names: ["بازوم", "Բազում"],
    country: "AM",
    lng: 44.44555555555555,
    lat: 40.86805555555556
  },
  {
    names: ["خنکویان", "Խնկոյան"],
    country: "AM",
    lng: 44.019999999999996,
    lat: 40.83972222222222
  },
  {
    names: ["کاراهونج", "Քարահունջ"],
    country: "AM",
    lng: 46.35888888888889,
    lat: 39.47916666666667
  },
  {
    names: ["گموندن (ورا)"],
    country: "DE",
    lng: 8.966666666666667,
    lat: 50.96666666666667
  },
  {
    names: ["هوباردزی", "Հոբարձի"],
    country: "AM",
    lng: 44.494166666666665,
    lat: 40.96027777777778
  },
  { names: ["اشترلن"], country: "DE", lng: 6.266666666666667, lat: 51.45 },
  {
    names: ["فونگزاشتات"],
    country: "DE",
    lng: 8.604444444444445,
    lat: 49.80555555555555
  },
  {
    names: ["فایهینگن آن در انتس"],
    country: "DE",
    lng: 8.956388888888888,
    lat: 48.93277777777777
  },
  {
    names: ["فیلیپسبپورگ", "Philippsburg"],
    country: "DE",
    lng: 8.45,
    lat: 49.233333333333334
  },
  {
    names: ["آزنوادزور", "Ազնվաձոր"],
    country: "AM",
    lng: 44.41694444444444,
    lat: 40.87694444444445
  },
  {
    names: ["اسکاندیدو، کالیفرنیا", "اسکاندیدو"],
    country: "US",
    lng: -117.08083333333333,
    lat: 33.124722222222225
  },
  {
    names: ["آدل‌جوز"],
    country: "TR",
    lng: 42.746944444444445,
    lat: 38.80583333333333
  },
  {
    names: ["بوک دل ریو، وراکروز"],
    country: "MX",
    lng: -96.10777777777777,
    lat: 19.105555555555558
  },
  {
    names: ["لاوتا", "Lauta"],
    country: "DE",
    lng: 14.099722222222223,
    lat: 51.448055555555555
  },
  { names: ["دتلباخ"], country: "DE", lng: 10.183333333333334, lat: 49.8 },
  {
    names: ["کلمبیا، میزوری", "Columbia, Missouri"],
    country: "US",
    lng: -92.33388888888888,
    lat: 38.94833333333333
  },
  {
    names: ["راینهایم (اودنوالد)"],
    country: "DE",
    lng: 8.830833333333333,
    lat: 49.82694444444445
  },
  {
    names: ["اولریش‌اشتاین"],
    country: "DE",
    lng: 9.2,
    lat: 50.583333333333336
  },
  {
    names: ["میرنوهراد", "Мирноград"],
    country: "UA",
    lng: 37.268055555555556,
    lat: 48.29111111111111
  },
  { names: ["نهاوند"], lng: 48.3658, lat: 34.1919 },
  {
    names: ["اوهاناوان", "Օհանավան"],
    country: "AM",
    lng: 44.38305555555556,
    lat: 40.34583333333334
  },
  {
    names: ["هوش (رومانی)", "Huși"],
    country: "RO",
    lng: 28.059722222222224,
    lat: 46.674166666666665
  },
  {
    names: ["خارتسیزک", "Khartsyzk", "Харцизьк"],
    country: "UA",
    lng: 38.1425,
    lat: 48.04277777777778
  },
  {
    names: ["دموین، آیووا", "City of Des Moines"],
    country: "US",
    lng: -93.62083333333332,
    lat: 41.590833333333336
  },
  {
    names: ["پالیکیر", "Palikir"],
    country: "FM",
    lng: 158.185,
    lat: 6.917777777777778
  },
  {
    names: ["کمپیناس"],
    country: "BR",
    lng: -47.05722222222222,
    lat: -22.90083333333333
  },
  {
    names: ["بتن‌روژ، لوییزیانا", "بتون روژ، لویزیانا", "Baton Rouge"],
    country: "US",
    lng: -91.14027777777778,
    lat: 30.458055555555553
  },
  {
    names: ["اینه‌گول", "İnegöl"],
    country: "TR",
    lng: 29.513333333333332,
    lat: 40.07805555555556
  },
  {
    names: ["ساسکاتون", "Saskatoon"],
    country: "CA",
    lng: -106.68333333333334,
    lat: 52.13333333333333
  },
  {
    names: ["فورشتنبورگ"],
    country: "DE",
    lng: 9.566666666666666,
    lat: 49.28333333333333
  },
  {
    names: ["رکلینگهاوزن"],
    country: "DE",
    lng: 7.161944444444445,
    lat: 51.585
  },
  {
    names: ["لیژ", "Liège"],
    country: "BE",
    lng: 5.566666666666666,
    lat: 50.63333333333333
  },
  {
    names: ["پاینه", "Peine"],
    country: "DE",
    lng: 10.23361111111111,
    lat: 52.32027777777778
  },
  {
    names: ["هرلیو", "Hârlău"],
    country: "RO",
    lng: 26.911388888888887,
    lat: 47.42777777777778
  },
  {
    names: ["لیدز"],
    country: "GB",
    lng: -1.5491666666666666,
    lat: 53.79972222222222
  },
  {
    names: ["مامودزو", "Mamoudzou"],
    country: "FR",
    lng: 45.22777777777778,
    lat: -12.780555555555557
  },
  {
    names: ["دمشق", "Damascus"],
    country: "SY",
    lng: 3.294722222222222,
    lat: 33.51305555555555
  },
  {
    names: ["ایغدیر"],
    country: "TR",
    lng: 44.03333333333333,
    lat: 39.916666666666664
  },
  {
    names: ["برست", "Brest"],
    country: "FR",
    lng: -4.485555555555556,
    lat: 48.39083333333333
  },
  {
    names: ["یرنه، سودتلیا", "Järna"],
    country: "SE",
    lng: 17.566666666666666,
    lat: 59.083333333333336
  },
  { names: ["شبستر"], lng: 45.702778, lat: 38.180278 },
  {
    names: ["گوریشنی پلاونی", "Горішні Плавні"],
    country: "UA",
    lng: 33.666666666666664,
    lat: 49.016666666666666
  },
  {
    names: ["وورث آن در راین"],
    country: "DE",
    lng: 8.260277777777778,
    lat: 49.05166666666666
  },
  {
    names: ["هاله (شهر)", "Independent City of Halle (Saale), زاکسن-آنهالت"],
    country: "DE",
    lng: 11.966666666666667,
    lat: 51.483333333333334
  },
  {
    names: ["پوساداس", "Posadas"],
    country: "AR",
    lng: -55.88333333333333,
    lat: -27.366666666666667
  },
  {
    names: ["سانتا آنا (ماگدالنا)", "Santa Ana"],
    country: "CO",
    lng: -74.57,
    lat: 9.319
  },
  {
    names: ["المعادی", "Maadi"],
    country: "EG",
    lng: 31.25,
    lat: 29.966666666666665
  },
  {
    names: ["اویلتسن", "Uelzen"],
    country: "DE",
    lng: 10.565833333333334,
    lat: 52.96472222222223
  },
  {
    names: ["سینت جانز، نیوفاندلند و لابرادور", "سینت جانز"],
    country: "CA",
    lng: -52.70722222222223,
    lat: 47.5675
  },
  {
    names: ["آراکس، واغارشاپات", "آراکس", "Արաքս"],
    country: "AM",
    lng: 44.30277777777778,
    lat: 40.05472222222222
  },
  {
    names: ["باد هررن‌آلب"],
    country: "DE",
    lng: 8.440833333333334,
    lat: 48.800555555555555
  },
  {
    names: ["لیون", "Lyon"],
    country: "FR",
    lng: 4.8422222222222215,
    lat: 45.75972222222222
  },
  {
    names: ["گروجونتس", "Grudządz"],
    country: "PL",
    lng: 18.766666666666666,
    lat: 53.483333333333334
  },
  { names: ["زننوالد"], country: "DE", lng: 13.65, lat: 51.683055555555555 },
  {
    names: ["اورجونیکیدزه، اوکراین", "اورجونیکیدزه", "Орджонікідзе"],
    country: "UA",
    lng: 34.05,
    lat: 47.666666666666664
  },
  {
    names: ["سن ژرمن آن له", "Saint-Germain-en-Laye"],
    country: "FR",
    lng: 2.093888888888889,
    lat: 48.89888888888889
  },
  {
    names: ["هازلاخ"],
    country: "DE",
    lng: 8.086944444444445,
    lat: 48.27777777777778
  },
  {
    names: ["پولاتلی", "Polatlı"],
    country: "TR",
    lng: 32.15,
    lat: 39.583333333333336
  },
  {
    names: ["بلینا", "البلینا"],
    country: "EG",
    lng: 32,
    lat: 26.233333333333334
  },
  {
    names: ["مونشنبرگ"],
    country: "DE",
    lng: 14.139722222222222,
    lat: 52.50361111111111
  },
  {
    names: ["گوموش‌خانه", "Gümüşhane"],
    country: "TR",
    lng: 39.483333333333334,
    lat: 40.46666666666667
  },
  {
    names: ["زینتسیگ"],
    country: "DE",
    lng: 7.251944444444445,
    lat: 50.54527777777778
  },
  {
    names: ["آتان، ارمنستان", "آتان", "Աթան"],
    country: "AM",
    lng: 44.84916666666667,
    lat: 40.93388888888889
  },
  {
    names: ["اوستریش-وینکل", "Oestrich-Winkel"],
    country: "DE",
    lng: 8,
    lat: 50
  },
  {
    names: ["آرمیانسک", "Armyansk", "Армянськ", "Армянск", "Ermeni Bazar"],
    country: "UA",
    lng: 33.690555555555555,
    lat: 46.11472222222223
  },
  {
    names: ["سوسر", "Սուսեր"],
    country: "AM",
    lng: 43.733333333333334,
    lat: 40.466944444444444
  },
  {
    names: ["چبنیکا", "Trzebnica"],
    country: "PL",
    lng: 17.06138888888889,
    lat: 51.305
  },
  {
    names: ["راس‌الخیمه", "Emirate of Ras al-Khaimah", "اماره راس الخیمه"],
    country: "AE",
    lng: 55.95,
    lat: 25.783333333333335
  },
  {
    names: ["یاش", "(به رومانیایی: Iaşi)"],
    country: "RO",
    lng: 27.590277777777775,
    lat: 47.15694444444444
  },
  {
    names: ["اغیردیر", "Eğirdir"],
    country: "TR",
    lng: 30.850555555555555,
    lat: 37.875
  },
  {
    names: ["ایزلون", "Iserlohn"],
    country: "DE",
    lng: 7.666666666666667,
    lat: 51.38333333333333
  },
  {
    names: ["باد لیبن‌زل"],
    country: "DE",
    lng: 8.731388888888889,
    lat: 48.774166666666666
  },
  {
    names: ["روبل، موریتس"],
    country: "DE",
    lng: 12.60611111111111,
    lat: 53.376111111111115
  },
  {
    names: ["زالتسبورگ", "زالتسبورگ، اتریش"],
    country: "AT",
    lng: 13.033333333333333,
    lat: 47.8
  },
  {
    names: ["کورونا، کالیفرنیا", "Corona"],
    country: "US",
    lng: -117.56666666666666,
    lat: 33.86666666666667
  },
  {
    names: ["کراکوف"],
    country: "PL",
    lng: 19.933333333333334,
    lat: 50.06666666666667
  },
  {
    names: ["راینبرگ", "Rheinberg"],
    country: "DE",
    lng: 6.600555555555555,
    lat: 51.54666666666667
  },
  {
    names: ["بنونیس", "Բնունիս"],
    country: "AM",
    lng: 46.005833333333335,
    lat: 39.44444444444444
  },
  { names: ["شنژن", "深圳市"], country: "", lng: 114.1, lat: 22.55 },
  { names: ["هاوسا"], country: "TR", lng: 26.81638888888889, lat: 41.55 },
  {
    names: ["ایندیاناپلیس", "ایندیاناپولیس، ایندیانا"],
    country: "US",
    lng: -86,
    lat: 39
  },
  {
    names: ["اوباخ-پالنبرگ", "Übach-Palenberg"],
    country: "DE",
    lng: 6.1194444444444445,
    lat: 50.91972222222222
  },
  {
    names: ["مونشن‌گلادباخ", "Mönchengladbach"],
    country: "DE",
    lng: 6.433333333333334,
    lat: 51.2
  },
  {
    names: ["سالتا", "Salta"],
    country: "AR",
    lng: -65.41666666666667,
    lat: -24.783333333333335
  },
  {
    names: ["پارتیزاک", "Պարտիզակ"],
    country: "AM",
    lng: 44,
    lat: 40.28333333333333
  },
  {
    names: ["موره (رومانی)", "Moreni"],
    country: "RO",
    lng: 25.644444444444446,
    lat: 44.98027777777778
  },
  { names: ["کوار"], lng: 52.62, lat: 29.11 },
  {
    names: ["آورسا", "Aversa"],
    country: "IT",
    lng: 14.2,
    lat: 40.96666666666667
  },
  {
    names: ["هالنبرگ", "Hallenberg"],
    country: "DE",
    lng: 8.623055555555556,
    lat: 51.111666666666665
  },
  {
    names: ["سلطان‌خانی", "Sultanhanı"],
    country: "TR",
    lng: 33.55,
    lat: 38.25
  },
  { names: ["خمام", "خومام"], lng: 49.393, lat: 37.2321 },
  {
    names: ["میراک", "Միրաք"],
    country: "AM",
    lng: 44.32416666666667,
    lat: 40.644999999999996
  },
  { names: ["همدان"], lng: 48.52, lat: 34.8 },
  {
    names: ["پوابلو، کلرادو"],
    country: "US",
    lng: -104.62027777777777,
    lat: 38.26694444444444
  },
  {
    names: ["شتن (شهر)", "Schotten"],
    country: "DE",
    lng: 9.116666666666667,
    lat: 50.5
  },
  { names: ["تلیک", "Թլիկ"], country: "AM", lng: 43.61666666666667, lat: 40.4 },
  {
    names: ["رمشاید", "Remscheid"],
    country: "DE",
    lng: 7.2,
    lat: 51.18333333333333
  },
  { names: ["میلانووک"], country: "PL", lng: 20.65, lat: 52.11666666666667 },
  { names: ["انتبه", "Entebbe"], country: "UG", lng: 32.46, lat: 0.05 },
  {
    names: ["کروشنی‌ویتسه"],
    country: "PL",
    lng: 19.17,
    lat: 52.25361111111111
  },
  { names: ["تبریز"], lng: 46.3, lat: 38.08 },
  { names: ["آکرا", "Accra"], country: "GH", lng: -0.2, lat: 5.55 },
  {
    names: ["سکاره (سوید)", "Skåre"],
    country: "SE",
    lng: 13.433333333333334,
    lat: 59.43333333333333
  },
  {
    names: ["ایستد", "Ystad"],
    country: "SE",
    lng: 13.833333333333334,
    lat: 55.416666666666664
  },
  {
    names: ["مودنا", "Modena"],
    country: "IT",
    lng: 10.933333333333334,
    lat: 44.65
  },
  {
    names: ["سالی، ارمنستان", "سالی", "Սալլի"],
    country: "AM",
    lng: 45.276666666666664,
    lat: 39.87361111111111
  },
  {
    names: ["سوابرد", "Սևաբերդ"],
    country: "AM",
    lng: 44.79833333333333,
    lat: 40.277499999999996
  },
  {
    names: ["ویکتوریا (براشوو)", "Victoria"],
    country: "RO",
    lng: 24.69,
    lat: 45.74277777777778
  },
  {
    names: ["کوپیچینتسی", "Kopychyntsi", "Копичинці"],
    country: "UA",
    lng: 25.912777777777777,
    lat: 49.10805555555556
  },
  { names: ["مرند"], lng: 46, lat: 38.35 },
  {
    names: ["لیما", "Lima"],
    country: "PE",
    lng: -77.02833333333334,
    lat: -12.043333333333333
  },
  {
    names: ["چورتکیف", "Chortkiv", "Чортків"],
    country: "UA",
    lng: 25.790555555555557,
    lat: 49.0075
  },
  {
    names: ["سیول", "سیول ", "Seoul", "서울시"],
    country: "KR",
    lng: 126.96666666666667,
    lat: 37.56666666666667
  },
  {
    names: ["باری (ایتالیا)", "باری", "Bari"],
    country: "IT",
    lng: 16.866666666666667,
    lat: 41.125277777777775
  },
  {
    names: ["سن-دنی، ریونیون", "سن-دونی", "Saint-Denis"],
    country: "FR",
    lng: 55.4481,
    lat: 20.8789
  },
  {
    names: ["سارالانج", "Սարալանջ"],
    country: "AM",
    lng: 44.02027777777778,
    lat: 40.625277777777775
  },
  {
    names: ["مارل، آلمان", "Marl"],
    country: "DE",
    lng: 7.116666666666666,
    lat: 51.666666666666664
  },
  { names: ["هایلبرون"], country: "DE", lng: 9.216666666666667, lat: 49.15 },
  {
    names: ["کچی‌بورلو", "Keçiborlu"],
    country: "TR",
    lng: 30.302222222222223,
    lat: 37.94305555555555
  },
  {
    names: ["آگاراک (روستا)، سیونیک", "آگاراک", "Ագարակ"],
    country: "AM",
    lng: 46.54722222222222,
    lat: 39.20388888888889
  },
  {
    names: ["پورتو آلگری", "Porto Alegre"],
    country: "BR",
    lng: -51.230000000000004,
    lat: -30.033055555555556
  },
  {
    names: ["دزوراکاپ", "Ձորակապ"],
    country: "AM",
    lng: 43.86666666666667,
    lat: 40.56666666666667
  },
  {
    names: ["نیوپورت نیوز، ویرجینیا", "Newport News, Virginia"],
    country: "US",
    lng: -76.48444444444445,
    lat: 37.07083333333334
  },
  {
    names: ["مانهایم"],
    country: "DE",
    lng: 8.469166666666666,
    lat: 49.48888888888889
  },
  {
    names: ["بیلبایو", "(به اسپانیایی: Bilbao)"],
    country: "ES",
    lng: -2.923611111111111,
    lat: 43.25694444444444
  },
  {
    names: ["منطقه آتاکاما", "Atacama Region", "III Región de Atacama"],
    country: "CL",
    lng: -70.33222222222221,
    lat: -27.366666666666667
  },
  {
    names: ["فورت‌وین، ایندیانا", "Fort Wayne, Indiana"],
    country: "US",
    lng: -85.13916666666667,
    lat: 41.080555555555556
  },
  { names: ["جایاپورا"], country: "ID", lng: 140.717, lat: -2.533 },
  {
    names: ["باد پیرمونت"],
    country: "DE",
    lng: 9.26361111111111,
    lat: 51.986666666666665
  },
  { names: ["سنندج", "سنه"], lng: 46.9989, lat: 35.3172 },
  {
    names: ["باد والدزی"],
    country: "DE",
    lng: 9.751944444444444,
    lat: 47.92111111111111
  },
  {
    names: ["کمپیا تورزی", "Câmpia Turzii"],
    country: "RO",
    lng: 23.88,
    lat: 46.54861111111111
  },
  {
    names: ["لیزبارک وارمینگسکی"],
    country: "PL",
    lng: 20.583333333333332,
    lat: 54.11666666666667
  },
  { names: ["انگلهولم", "Ängelholm"], country: "SE", lng: 12.85, lat: 56.25 },
  {
    names: ["هایتاغ", "Հայթաղ"],
    country: "AM",
    lng: 44.22972222222222,
    lat: 40.18083333333333
  },
  {
    names: ["مسقط"],
    country: "OM",
    lng: 58.591944444444444,
    lat: 23.608611111111113
  },
  {
    names: ["دارگچیت"],
    country: "TR",
    lng: 41.724444444444444,
    lat: 37.545833333333334
  },
  {
    names: ["شاموت", "Շամուտ"],
    country: "AM",
    lng: 44.78333333333333,
    lat: 40.93333333333333
  },
  {
    names: ["زاربورگ"],
    country: "DE",
    lng: 6.550277777777778,
    lat: 49.60916666666667
  },
  {
    names: ["آرنی", "آرِنی", "Արենի"],
    country: "AM",
    lng: 45.18388888888889,
    lat: 39.72083333333334
  },
  {
    names: ["نیویورک", "نیویورک سیتی"],
    country: "US",
    lng: -74,
    lat: 40.71666666666667
  },
  {
    names: ["کالارکا (کیندیو)", "Calarcá, Quindío"],
    country: "CO",
    lng: -75.65027777777779,
    lat: 4.531944444444444
  },
  {
    names: ["کوتا کینابالو", "Kota Kinabalu"],
    country: "MY",
    lng: 116.0952,
    lat: 5.9714
  },
  {
    names: ["اولان‌باتور", "(الفبای سیریلیک:Улаанбаатар)"],
    country: "MN",
    lng: 106.91666666666667,
    lat: 47.916666666666664
  },
  {
    names: ["آنسرمانویوو (واییه دل کایوکا)", "Ansermanuevo"],
    country: "CO",
    lng: -76,
    lat: 4.8
  },
  {
    names: ["رودنتال"],
    country: "DE",
    lng: 11.066666666666666,
    lat: 50.28333333333333
  },
  { names: ["فرسنیلو"], country: "MX", lng: -102.86749999999999, lat: 23.175 },
  {
    names: ["لانجانیست", "Լանջանիստ"],
    country: "AM",
    lng: 44.95,
    lat: 39.86666666666667
  },
  {
    names: ["سن کریستوبال د لاس کساس", "Jovel"],
    country: "MX",
    lng: -92.63833333333334,
    lat: 16.736666666666668
  },
  {
    names: ["نویکیرشن-ولوین", "Neukirchen-Vluyn"],
    country: "DE",
    lng: 6.558333333333334,
    lat: 51.44166666666666
  },
  { names: ["گادبوش"], country: "DE", lng: 11.116666666666667, lat: 53.7 },
  {
    names: ["کمپیناس"],
    country: "BR",
    lng: -47.05722222222222,
    lat: -22.90083333333333
  },
  {
    names: ["پشاتاوان", "Փշատավան"],
    country: "AM",
    lng: 44.0675,
    lat: 40.04055555555556
  },
  {
    names: ["ماسیس (روستا)", "ماسیس", "Մասիս"],
    country: "AM",
    lng: 44.43611111111111,
    lat: 40.06722222222223
  },
  {
    names: ["رسیفی", "Recife"],
    country: "BR",
    lng: -34.88333333333333,
    lat: -8.05
  },
  { names: ["جزایر فالکلند"], lng: -57.85, lat: -51.7 },
  {
    names: ["نیدراشتتن"],
    country: "DE",
    lng: 9.918055555555554,
    lat: 49.40083333333333
  },
  {
    names: ["کانزاس‌سیتی، میزوری", "کانزاس سیتی", "Kansas City"],
    country: "US",
    lng: -94.5886111111111,
    lat: 39.109722222222224
  },
  {
    names: ["پمبروک پاینز، فلوریدا", "City of Pembroke Pines"],
    country: "US",
    lng: -80.31361111111111,
    lat: 26.0125
  },
  {
    names: ["مونتزا", "Monza"],
    country: "IT",
    lng: 9.266666666666667,
    lat: 45.583333333333336
  },
  {
    names: ["دروژبا، اوکراین", "Druzhba", "Дружба"],
    country: "UA",
    lng: 33.94305555555555,
    lat: 52.04861111111111
  },
  {
    names: ["هنینگسواگ", "Honningsvåg"],
    lng: 25.976666666666667,
    lat: 70.9786111111111
  },
  {
    names: ["ایلرتیسن"],
    country: "DE",
    lng: 10.083333333333334,
    lat: 48.21666666666667
  },
  {
    names: ["ساراگوسا", "(به اسپانیایی: Zaragoza)"],
    country: "ES",
    lng: -0.8833333333333333,
    lat: 41.65
  },
  {
    names: [
      "کوالا لامپور",
      "قلمروی فدرالی کوالالامپور",
      "Wilayah Persekutuan Kuala Lumpur"
    ],
    country: "MY",
    lng: 101.69333333333334,
    lat: 3.1475
  },
  {
    names: ["المزهورن"],
    country: "DE",
    lng: 9.651111111111112,
    lat: 53.75194444444445
  },
  { names: ["شهر جدید هشتگرد"], lng: 50.44, lat: 35.58 },
  {
    names: ["دورتموند"],
    country: "DE",
    lng: 7.466666666666667,
    lat: 51.516666666666666
  },
  {
    names: ["آمبرگ"],
    country: "DE",
    lng: 11.848333333333334,
    lat: 49.44444444444444
  },
  {
    names: ["موبیل، آلاباما", "Mobile, Alabama"],
    country: "US",
    lng: -88.04305555555555,
    lat: 30.694444444444446
  },
  {
    names: ["جزیره کیش", "آبخُست (جزیره) کیش", "Kish"],
    country: "IR",
    lng: 53.96666666666667,
    lat: 26.533333333333335
  },
  { names: ["کومانا"], country: "VE", lng: -64.1675, lat: 10.456388888888888 },
  { names: ["اتسهوهه"], country: "DE", lng: 9.516388888888889, lat: 53.925 },
  {
    names: ["کمنیتس"],
    country: "DE",
    lng: 12.916666666666666,
    lat: 50.833333333333336
  },
  {
    names: ["پورت سنت لوسی، فلوریدا", "The City of Port St. Lucie, Florida"],
    country: "US",
    lng: -80.35499999999999,
    lat: 27.27583333333333
  },
  {
    names: ["ویارجو", "Viareggio"],
    country: "IT",
    lng: 10.233333333333333,
    lat: 43.86666666666667
  },
  {
    names: ["لنجنه"],
    country: "PL",
    lng: 19.112222222222222,
    lat: 50.12694444444445
  },
  { names: ["پیزا"], country: "IT", lng: 10.4, lat: 43.71666666666667 },
  { names: ["ویچنزا"], country: "IT", lng: 11.55, lat: 45.55 },
  {
    names: ["کمپیا", "Câmpina"],
    country: "RO",
    lng: 25.740000000000002,
    lat: 45.13
  },
  { names: ["هیتس‌آکر"], country: "DE", lng: 11.05, lat: 53.13333333333333 },
  {
    names: ["باشگیوغ", "Բաշգյուղ"],
    country: "AM",
    lng: 43.96666666666667,
    lat: 40.95
  },
  {
    names: ["بلو هوریزونته", "Belo Horizonte"],
    country: "BR",
    lng: -43.93333333333333,
    lat: -19.916666666666668
  },
  {
    names: ["بیرید", "Bjärred"],
    country: "SE",
    lng: 13.016666666666667,
    lat: 55.71666666666667
  },
  {
    names: ["لویتکیرش ایم آلگاو"],
    country: "DE",
    lng: 10.022222222222224,
    lat: 47.82555555555556
  },
  { names: ["کریفیی ریه", "Кривий ріг"], country: "UA", lng: 48, lat: 29 },
  {
    names: ["لاپاز، باخا کالیفرنیا سور", "لا پاس", "La Paz"],
    country: "MX",
    lng: -110.31083333333333,
    lat: 24.142222222222223
  },
  {
    names: ["بایامو"],
    country: "CU",
    lng: -76.64277777777778,
    lat: 20.381666666666668
  },
  {
    names: ["هرمون، ارمنستان", "هرمون", "Հերմոն"],
    country: "AM",
    lng: 45.42638888888889,
    lat: 39.879444444444445
  },
  {
    names: ["تاپاچولا", "Tapachula"],
    country: "MX",
    lng: -92.26666666666667,
    lat: 14.9
  },
  {
    names: ["باد شواندوا"],
    country: "DE",
    lng: 14.15,
    lat: 50.916666666666664
  },
  {
    names: ["میلواکی، ویسکانسین", "میلواکی", "Milwaukee"],
    country: "US",
    lng: -87.95583333333333,
    lat: 43.05222222222222
  },
  {
    names: ["سارایونو", "Sarayönü"],
    country: "TR",
    lng: 32.4,
    lat: 38.266666666666666
  },
  {
    names: ["کارتاخنا، کلمبیا", "کارتاخنا"],
    country: "CO",
    lng: -75.5,
    lat: 10.4
  },
  {
    names: ["تیتیزی-نیواشتات"],
    country: "DE",
    lng: 8.214722222222221,
    lat: 47.91222222222222
  },
  {
    names: ["مرگاوان", "Մրգավան"],
    country: "AM",
    lng: 44.53333333333333,
    lat: 39.96611111111111
  },
  {
    names: ["اویتروده آم هارتس"],
    country: "DE",
    lng: 10.252222222222223,
    lat: 51.728611111111114
  },
  {
    names: ["اوزلار", "Uslar"],
    country: "DE",
    lng: 9.635833333333332,
    lat: 51.65972222222222
  },
  {
    names: ["دالامان", "Dalaman"],
    country: "TR",
    lng: 28.8,
    lat: 36.766666666666666
  },
  {
    names: ["نایروبی", "Nairobi"],
    country: "KE",
    lng: 36.81666666666667,
    lat: -1.2833333333333332
  },
  { names: ["مریوان"], lng: 46.17, lat: 35.52 },
  {
    names: ["کارپی (مودنا)", "Chèrp"],
    country: "IT",
    lng: 10.883333333333333,
    lat: 44.78333333333333
  },
  {
    names: ["رزیستنسیا", "Resistencia"],
    country: "AR",
    lng: -58.986666666666665,
    lat: -27.45138888888889
  },
  {
    names: ["لرش (راینگاو)", "Lorch"],
    country: "DE",
    lng: 7.803333333333333,
    lat: 50.04416666666666
  },
  {
    names: ["داوتاشن", "Դավթաշեն"],
    country: "AM",
    lng: 43.96666666666667,
    lat: 40.36666666666667
  },
  {
    names: ["فلکنبی", "Falkenberg"],
    country: "SE",
    lng: 12.49111111111111,
    lat: 56.905277777777776
  },
  {
    names: ["چالکو د دایاز کورروبیس"],
    country: "MX",
    lng: -98.89750000000001,
    lat: 19.264722222222222
  },
  { names: ["نیزیپ"], country: "TR", lng: 37.79722222222222, lat: 37.01 },
  {
    names: ["کرمونا", "Cremona"],
    country: "IT",
    lng: 10.033333333333333,
    lat: 45.13333333333333
  },
  {
    names: ["پژاسنش"],
    country: "PL",
    lng: 20.883333333333333,
    lat: 53.016666666666666
  },
  {
    names: ["شوتسینگن", "Schwetzingen"],
    country: "DE",
    lng: 8.566666666666666,
    lat: 49.38333333333333
  },
  { names: ["بالن‌اشتات"], country: "DE", lng: 11.237499999999999, lat: 51.72 },
  {
    names: ["واردنیک", "Վարդենիկ"],
    country: "AM",
    lng: 45.436388888888885,
    lat: 40.135
  },
  {
    names: ["لهاسا", "Lhasa", ""],
    country: "CN",
    lng: 91.11666666666666,
    lat: 29.65
  },
  {
    names: ["لیونبه (سوید)", "Ljungby"],
    country: "SE",
    lng: 13.933333333333334,
    lat: 56.833333333333336
  },
  {
    names: ["کلارک‌اسویل، تنسی", "Clarksville, Tennessee"],
    country: "US",
    lng: -87.35916666666667,
    lat: 36.52972222222222
  },
  {
    names: ["لونتسناو"],
    country: "DE",
    lng: 12.753055555555555,
    lat: 50.963055555555556
  },
  { names: ["کامیاران", "کامیران"], lng: 46.94, lat: 34.8 },
  {
    names: ["مونشنبرنزدورف"],
    country: "DE",
    lng: 11.933333333333334,
    lat: 50.81666666666667
  },
  {
    names: ["تسوواک", "Ծովակ"],
    country: "AM",
    lng: 45.63388888888889,
    lat: 40.18277777777777
  },
  {
    names: ["اشلیبن"],
    country: "DE",
    lng: 13.383055555555556,
    lat: 51.71666666666667
  },
  {
    names: ["هرتن", "Herten"],
    country: "DE",
    lng: 7.133333333333334,
    lat: 51.6
  },
  {
    names: ["فرویدنبرگ (بادن)", "Freudenberg"],
    country: "DE",
    lng: 9.333333333333334,
    lat: 49.75
  },
  {
    names: ["ایلمناو"],
    country: "DE",
    lng: 10.919444444444444,
    lat: 50.68388888888889
  },
  {
    names: ["بوژاکان", "Բուժական"],
    country: "AM",
    lng: 44.52055555555555,
    lat: 40.45527777777778
  },
  {
    names: ["تامپره", "Tampere"],
    country: "AM",
    lng: 23.766666666666666,
    lat: 61.5
  },
  {
    names: ["ساچله", "Săcele", "Szecseleváros"],
    country: "RO",
    lng: 25.709722222222222,
    lat: 45.62
  },
  {
    names: ["اوبرکیرش (بادن)", "Oberkirch"],
    country: "DE",
    lng: 8.078888888888889,
    lat: 48.530833333333334
  },
  {
    names: ["تالسا، اکلاهما", "Tulsa, Oklahoma"],
    country: "US",
    lng: -95.93722222222223,
    lat: 36.13138888888889
  },
  { names: ["سونسوال"], country: "SE", lng: 17.316666666666666, lat: 62.4 },
  {
    names: ["فریدلند (نیدرلاوسیتز)", "Friedland"],
    country: "DE",
    lng: 14.266666666666667,
    lat: 52.1
  },
  { names: ["فونچال"], country: "", lng: -16.916666666666668, lat: 32.65 },
  {
    names: ["مصطفی کمال پاشا (شهر)", "مصطفی کمال پاشا"],
    country: "TR",
    lng: 28.4116667,
    lat: 40.0352778
  },
  {
    names: ["لرناگوگ", "Լեռնագոգ"],
    country: "AM",
    lng: 43.908055555555556,
    lat: 40.25694444444444
  },
  {
    names: ["لرته", "Lehrte"],
    country: "DE",
    lng: 9.966666666666667,
    lat: 52.36666666666667
  },
  {
    names: ["مونروویا", "Monrovia"],
    country: "LR",
    lng: -10.801388888888889,
    lat: 6.3133333333333335
  },
  {
    names: ["اشپرینگه", "Springe"],
    country: "DE",
    lng: 9.55,
    lat: 52.21666666666667
  },
  {
    names: ["تربین"],
    country: "DE",
    lng: 13.199722222222222,
    lat: 52.21666666666667
  },
  { names: ["درگز"], lng: 59.1058, lat: 37.4575 },
  {
    names: ["روتنبورگ آم نکا"],
    country: "DE",
    lng: 8.934444444444445,
    lat: 48.477222222222224
  },
  {
    names: ["گلیویتسه"],
    country: "PL",
    lng: 18.666666666666668,
    lat: 50.28333333333333
  },
  {
    names: ["هوشاکرت", "Հուշակերտ"],
    country: "AM",
    lng: 43.92638888888889,
    lat: 40.08111111111111
  },
  {
    names: ["شهرستان آرلینگتون، ویرجینیا", "آرلینگتون", "Arlington County"],
    country: "US",
    lng: -77.10833333333333,
    lat: 38.88027777777778
  },
  {
    names: ["ابرو (رومانی)", "Abrud"],
    country: "RO",
    lng: 23.063333333333333,
    lat: 46.27388888888889
  },
  {
    names: ["سو فالز، داکوتای جنوبی", "Sioux Falls, South Dakota"],
    country: "US",
    lng: -96.73166666666667,
    lat: 43.53638888888889
  },
  {
    names: ["شیرگیزوالده-کیرشاو"],
    country: "DE",
    lng: 14.433333333333334,
    lat: 51.1
  },
  {
    names: ["فرانکنبرگ، زاکسن", "Frankenberg"],
    country: "DE",
    lng: 13.037777777777778,
    lat: 50.91083333333333
  },
  {
    names: ["سادبری بزرگ", "Greater Sudbury", "Grand Sudbury"],
    country: "CA",
    lng: -81.01,
    lat: 46.49
  },
  {
    names: ["هرات", "هِرات", "Herāt"],
    country: "AF",
    lng: 62.20305555555556,
    lat: 34.341944444444444
  },
  {
    names: ["اشلوتهایم"],
    country: "DE",
    lng: 10.65638888888889,
    lat: 51.246944444444445
  },
  {
    names: ["باد وورزاخ"],
    country: "DE",
    lng: 9.899444444444445,
    lat: 47.909444444444446
  },
  {
    names: ["کالاوان", "Կալավան"],
    country: "AM",
    lng: 45.11666666666667,
    lat: 40.65
  },
  {
    names: ["گلاوخاو"],
    country: "DE",
    lng: 12.544444444444444,
    lat: 50.82333333333334
  },
  { names: ["هاسفورت"], country: "DE", lng: 10.5, lat: 50.016666666666666 },
  {
    names: ["سیلاو"],
    country: "MX",
    lng: -101.42805555555556,
    lat: 20.947777777777777
  },
  { names: ["گلپایگان"], lng: 50.175584, lat: 33.27538 },
  {
    names: ["ویسن", "Wissen, Deutschland"],
    country: "DE",
    lng: 7.735,
    lat: 50.7825
  },
  {
    names: ["ادنکوبن"],
    country: "DE",
    lng: 8.127222222222223,
    lat: 49.28388888888889
  },
  {
    names: ["گینزویل، فلوریدا", "Gainesville, Florida"],
    country: "US",
    lng: -82.32499299999999,
    lat: 29.651999
  },
  {
    names: ["تدهولم", "Tidaholm"],
    country: "SE",
    lng: 13.95,
    lat: 58.18333333333333
  },
  {
    names: ["دژو (شاندونگ)", "Dezhou", "德州市"],
    lng: 116.26666666666667,
    lat: 37.43333333333333
  },
  {
    names: ["ملاکا (شهر)", "ملاکا", "Malacca City"],
    country: "MY",
    lng: 102.38444444444445,
    lat: 2.1888888888888887
  },
  {
    names: ["تسارنتین آن در زال‌زی"],
    country: "DE",
    lng: 10.916666666666666,
    lat: 53.53333333333333
  },
  {
    names: ["بانگی", "Bangui"],
    country: "CF",
    lng: 18.583333333333332,
    lat: 4.366666666666666
  },
  {
    names: ["سیراکیوس، نیویورک", "سیراکیوس", "Syracuse"],
    country: "US",
    lng: -76.14416666666668,
    lat: 43.04694444444444
  },
  {
    names: ["بوگن (شهر)", "Bogen"],
    country: "DE",
    lng: 12.683333333333334,
    lat: 48.916666666666664
  },
  {
    names: ["المولویا د خوارز"],
    country: "MX",
    lng: -99.75722222222223,
    lat: 19.36888888888889
  },
  {
    names: ["کالمار"],
    country: "SE",
    lng: 16.36277777777778,
    lat: 56.66138888888889
  },
  { names: ["اوکسنفورت"], country: "DE", lng: 10.066666666666666, lat: 49.65 },
  { names: ["خوی"], lng: 44.9478, lat: 38.5525 },
  {
    names: ["زانگاکتون", "Զանգակատուն"],
    country: "AM",
    lng: 45.051111111111105,
    lat: 39.809444444444445
  },
  {
    names: ["تلاوی", "თელავი"],
    country: "GE",
    lng: 45.483333333333334,
    lat: 41.916666666666664
  },
  {
    names: ["ایمولا", "Imola", "Iômla"],
    country: "IT",
    lng: 11.716666666666667,
    lat: 44.35
  },
  {
    names: ["پورت بلر", "पोर्ट ब्लेयर"],
    country: "IN",
    lng: 92.73777777777778,
    lat: 11.668333333333333
  },
  {
    names: ["آنتورپ", "Antwerpen"],
    country: "BE",
    lng: 4.4,
    lat: 51.21666666666667
  },
  {
    names: ["اوانتا", "Huanta", "Wanta"],
    country: "PE",
    lng: -74.2475,
    lat: -12.939722222222223
  },
  {
    names: ["واراگاوان", "Վարագավան"],
    country: "AM",
    lng: 45.33833333333334,
    lat: 40.956944444444446
  },
  {
    names: ["کراسار", "Կրասար"],
    country: "AM",
    lng: 43.82333333333334,
    lat: 41.01777777777777
  },
  {
    names: ["تسل در ویزنتال"],
    country: "DE",
    lng: 7.851388888888889,
    lat: 47.706944444444446
  },
  {
    names: ["غازی عینتاب", "Antep"],
    country: "TR",
    lng: 37.38333333333333,
    lat: 37.06666666666667
  },
  {
    names: ["چرکاسی", "Черка́си"],
    country: "UA",
    lng: 32.05972222222222,
    lat: 49.44444444444444
  },
  {
    names: ["فلسبرگ (هسن)", "Felsberg"],
    country: "DE",
    lng: 9.416666666666666,
    lat: 51.13333333333333
  },
  { names: ["شاهدشهر"], lng: 51.0839, lat: 35.5714 },
  {
    names: ["مانزفیلد"],
    country: "DE",
    lng: 11.454722222222221,
    lat: 51.594166666666666
  },
  {
    names: ["ساوانا، جورجیا", "ساوانا, جورجیا", "Savannah, Georgia"],
    country: "US",
    lng: -81.0911111111111,
    lat: 32.08111111111111
  },
  {
    names: ["نویمبریان", "Նոյեմբերյան"],
    country: "AM",
    lng: 44.993611111111115,
    lat: 41.1725
  },
  {
    names: ["وارداوانک", "Վարդավանք"],
    country: "AM",
    lng: 46.5,
    lat: 39.233333333333334
  },
  {
    names: ["شوستکا", "Shostka", "Шостка"],
    country: "UA",
    lng: 33.483333333333334,
    lat: 51.86666666666667
  },
  {
    names: ["هاکوداته", "Hakodate", "函館"],
    country: "JP",
    lng: 140.73333333333332,
    lat: 41.766666666666666
  },
  {
    names: ["لاگوس"],
    country: "NG",
    lng: 3.3958333333333335,
    lat: 6.453055555555555
  },
  {
    names: ["لوگوژ", "Lugoj"],
    country: "RO",
    lng: 21.900555555555552,
    lat: 45.68611111111111
  },
  {
    names: ["ناوکالپان د خوارز، استادو د مخیکو"],
    country: "MX",
    lng: -99.23777777777778,
    lat: 19.475277777777777
  },
  {
    names: ["ستییا", "Slatina"],
    country: "RO",
    lng: 24.36416666666667,
    lat: 44.42972222222222
  },
  {
    names: ["سانتیاگو", "Santiago"],
    country: "CL",
    lng: -70.66666666666667,
    lat: 33.45
  },
  {
    names: ["هانوی", "Hà Nội"],
    country: "VN",
    lng: 105.85,
    lat: 21.033333333333335
  },
  { names: ["زرقان"], lng: 52.43, lat: 29.46 },
  {
    names: ["قزلچه‌حمام", "Kızılcahamam"],
    country: "TR",
    lng: 32.65,
    lat: 40.46666666666667
  },
  {
    names: ["اشتایناو آن در اشتراسه", "Steinau an der Straße"],
    country: "DE",
    lng: 9.466666666666667,
    lat: 50.31666666666667
  },
  {
    names: ["گواش (شهر)", "گواش"],
    country: "TR",
    lng: 43.105555555555554,
    lat: 38.297777777777775
  },
  {
    names: ["جنوا", "Genoa", "Genova"],
    country: "IT",
    lng: 8.932777777777778,
    lat: 44.41111111111111
  },
  {
    names: ["اورشووا", "Orșova"],
    country: "RO",
    lng: 22.39611111111111,
    lat: 44.72527777777778
  },
  {
    names: ["کوزاکلی", "Kozaklı,Turkey"],
    country: "TR",
    lng: 34.85,
    lat: 39.21666666666667
  },
  {
    names: ["ال بانکو", "El Banco"],
    country: "CO",
    lng: -73.97472222222223,
    lat: 8.998333333333333
  },
  {
    names: ["تریبرگ ایم شوارزوالد"],
    country: "DE",
    lng: 8.231666666666667,
    lat: 48.130833333333335
  },
  {
    names: ["فورتالزا", "Fortaleza"],
    country: "BR",
    lng: -38.54277777777778,
    lat: -3.7183333333333333
  },
  {
    names: ["تورگوت‌ریس", "Turgutreis"],
    country: "TR",
    lng: 27.266666666666666,
    lat: 37.016666666666666
  },
  {
    names: ["موگادیشو", "Mogadishu", "مقدیشو"],
    country: "SO",
    lng: 45.35,
    lat: 2.033333333333333
  },
  {
    names: ["چرینیولا", "Cerignola"],
    country: "IT",
    lng: 15.9,
    lat: 41.266666666666666
  },
  {
    names: ["یغوارد، سیونیک", "Եղվարդ"],
    country: "AM",
    lng: 46.56055555555555,
    lat: 39.224722222222226
  },
  {
    names: ["شاهرود", "،[1] چخره، امام شهر، امام رود"],
    lng: 55.0167,
    lat: 36.4167
  },
  {
    names: ["کیروفسک، اوبلاست لنینگراد", "Кировск"],
    country: "RU",
    lng: 30.983333333333334,
    lat: 59.86666666666667
  },
  {
    names: ["پولو، ایلینوی"],
    country: "US",
    lng: -89.57722222222222,
    lat: 41.98694444444445
  },
  {
    names: ["ورین دوین", "Վերին Դվին"],
    country: "AM",
    lng: 44.590833333333336,
    lat: 40.025277777777774
  },
  {
    names: ["اولکساندریا", "Olexandria", "Олександрія"],
    country: "UA",
    lng: 33.11666666666667,
    lat: 48.666666666666664
  },
  {
    names: ["آرلینگتون، تگزاس", "Arlington, Texas"],
    country: "US",
    lng: -97.12277777777777,
    lat: 32.705000000000005
  },
  {
    names: ["لانجازات", "Լանջազատ"],
    country: "AM",
    lng: 44.57777777777778,
    lat: 40.061388888888885
  },
  {
    names: ["سانتا آنا، کالیفرنیا", "سانتا آنا", "Santa Ana"],
    country: "US",
    lng: -117.88138888888888,
    lat: 33.740833333333335
  },
  { names: ["وسترزباخ"], country: "DE", lng: 9.3, lat: 50.266666666666666 },
  {
    names: ["آدیس آبابا", "አዲስ አበባ"],
    country: "ET",
    lng: 38.7,
    lat: 9.633333333333333
  },
  {
    names: ["مارگاهوویت", "Մարգահովիտ"],
    country: "AM",
    lng: 44.6875,
    lat: 40.738055555555555
  },
  {
    names: ["تیرانا", "Tiranë", "Tirana"],
    country: "AL",
    lng: 19.82,
    lat: 41.330000000000005
  },
  {
    names: ["ورشو", "Warszawa"],
    country: "PL",
    lng: 21.016666666666666,
    lat: 52.233333333333334
  },
  {
    names: ["هانکاوان", "Հանքավան"],
    country: "AM",
    lng: 44.481388888888894,
    lat: 40.64416666666666
  },
  {
    names: ["آکونک", "Ակունք"],
    country: "AM",
    lng: 45.72,
    lat: 40.15222222222222
  },
  {
    names: ["زالبورگ-ابرزدورف"],
    country: "DE",
    lng: 11.7,
    lat: 50.49166666666667
  },
  {
    names: ["خوزه ازوتا، گویررو", "Ixtapa-Zihuatanejo"],
    country: "MX",
    lng: -101.55111111111111,
    lat: 17.644444444444446
  },
  { names: ["مدیین"], country: "CO", lng: -75.5751361111111, lat: 6.235925 },
  {
    names: ["آقچه‌آباد", "Akçaabat"],
    country: "TR",
    lng: 39.55,
    lat: 41.016666666666666
  },
  {
    names: ["کهو سیلوانیه", "Cehu Silvaniei", "Szilágycseh"],
    country: "RO",
    lng: 23.28666666666667,
    lat: 47.418055555555554
  },
  { names: ["جیرفت"], lng: 57.6626, lat: 29.2111 },
  {
    names: ["هوکستر"],
    country: "DE",
    lng: 9.366666666666667,
    lat: 51.766666666666666
  },
  {
    names: ["بلبیس", "Phelbs"],
    country: "EG",
    lng: 31.566666666666666,
    lat: 30.416666666666668
  },
  {
    names: ["چکناغ", "Չքնաղ"],
    country: "AM",
    lng: 44.43388888888889,
    lat: 40.58416666666667
  },
  {
    names: ["هولیایپوله", "Huliaipole", "Гуляйполе"],
    country: "UA",
    lng: 36.266666666666666,
    lat: 47.65
  },
  { names: ["راسکیله"], country: "", lng: 12.083333333333334, lat: 55.65 },
  {
    names: ["سورابایا", ""],
    country: "ID",
    lng: 112.7425,
    lat: -7.2652777777777775
  },
  {
    names: ["سلامانکا، گوآناخوآتو", 'Xidoo "Place of Tepetate"'],
    country: "MX",
    lng: -101.19722222222222,
    lat: 20.57027777777778
  },
  {
    names: ["اسپوکن، واشینگتن", "اسپوکن", "City of Spokane"],
    country: "US",
    lng: -117.42500000000001,
    lat: 47.65888888888889
  },
  {
    names: ["بیسایو", "Bissau"],
    country: "GW",
    lng: -15.566666666666666,
    lat: 11.85
  },
  {
    names: ["سنت جانز", "سینت جانز", "St. John's"],
    country: "AG",
    lng: -61.85,
    lat: 17.116666666666667
  },
  {
    names: ["کاتناغبیور، آراگاتسوتن", "کاتناغبیور", "Կաթնաղբյուր"],
    country: "AM",
    lng: 43.93833333333333,
    lat: 40.37722222222222
  },
  { names: ["چیچک‌داغی", "Çiçekdağı"], country: "TR", lng: 34.4, lat: 39.6 },
  {
    names: ["ناها، اوکیناوا", "Naha", "那覇", "Naafa"],
    country: "JP",
    lng: 127.67916666666667,
    lat: 26.21222222222222
  },
  {
    names: ["ارکیپا", "Arequipa, Peru"],
    country: "PE",
    lng: -71.53688333333334,
    lat: -16.398822222222222
  },
  {
    names: ["کپنهاگ", "København"],
    country: "DK",
    lng: 12.568333333333333,
    lat: 55.67611111111111
  },
  {
    names: ["آیروم", "Այրում"],
    country: "AM",
    lng: 44.8925,
    lat: 41.19499999999999
  },
  {
    names: ["کوتاکان", "Կուտական"],
    country: "AM",
    lng: 45.83916666666667,
    lat: 40.26777777777777
  },
  {
    names: ["شسلیتس"],
    country: "DE",
    lng: 11.033888888888889,
    lat: 49.97666666666667
  },
  {
    names: ["سن لوییس ریو کلرادو"],
    country: "MX",
    lng: -114.7625,
    lat: 32.47666666666667
  },
  {
    names: ["آرابان"],
    country: "TR",
    lng: 37.69277777777778,
    lat: 37.42472222222222
  },
  {
    names: ["آرنیس (شهر)", "Arnis"],
    country: "DE",
    lng: 9.931388888888888,
    lat: 54.63
  },
  {
    names: ["سان مارینو (شهر)", "شهر سن مارینو", "Città di San Marino"],
    country: "SM",
    lng: 12.433333333333334,
    lat: 43.93333333333333
  },
  {
    names: ["ویاریکا", "Villarrica"],
    country: "PY",
    lng: -56.43333333333333,
    lat: -25.75
  },
  {
    names: ["چی‌واوا (ایالت چی‌واوا)", "چی‌واوا", "Chihuahua"],
    country: "MX",
    lng: -106.08,
    lat: 28.63
  },
  { names: ["مزاتلان، سینالوآ"], country: "MX", lng: -106.42, lat: 23.22 },
  {
    names: ["همپتون، ویرجینیا", "Hampton, Virginia"],
    country: "US",
    lng: -76.36,
    lat: 37.03472222222222
  },
  {
    names: ["سانتاندر", "(به اسپانیایی: Santander)"],
    country: "ES",
    lng: -3.8049999999999997,
    lat: 43.46277777777778
  },
  {
    names: ["کانگجو", "沧州市"],
    country: "CN",
    lng: 116.86666666666666,
    lat: 38.31666666666667
  },
  {
    names: ["وارداکار", "Վարդաքար"],
    country: "AM",
    lng: 43.916666666666664,
    lat: 40.666666666666664
  },
  { names: ["اشتات‌رودا"], country: "DE", lng: 11.733333333333333, lat: 50.85 },
  {
    names: ["والپارایسو", "Valparaíso, City, Port and Commune"],
    country: "CL",
    lng: -71.61666666666666,
    lat: -33.05
  },
  {
    names: ["لوساغبیور", "Լուսաղբյուր"],
    country: "AM",
    lng: 43.74944444444444,
    lat: 40.64555555555555
  },
  { names: ["بلاوبویرن"], country: "DE", lng: 9.785, lat: 48.411944444444444 },
  { names: ["زاهدان"], lng: 60.86277777777778, lat: 29.49638888888889 },
  {
    names: ["ویکتور ویل، کالیفرنیا", "نصرآباد"],
    country: "US",
    lng: -117.28833333333333,
    lat: 34.53611111111111
  },
  {
    names: ["هپنهایم"],
    country: "DE",
    lng: 8.63888888888889,
    lat: 49.643055555555556
  },
  {
    names: ["مینسک", "مینسْک", "Мінск"],
    country: "BY",
    lng: 27.566666666666666,
    lat: 53.9
  },
  {
    names: ["پرووو، یوتا", "پرووو", "Provo, Utah"],
    country: "US",
    lng: -111.66080277777779,
    lat: 40.24442222222223
  },
  {
    names: ["مالبرگ"],
    country: "DE",
    lng: 7.811388888888889,
    lat: 48.286944444444444
  },
  { names: ["کوریتیبا"], country: "BR", lng: -49.25, lat: -25.416666666666668 },
  {
    names: ["هارتفورد، کنتیکت", "Hartford, Connecticut"],
    country: "US",
    lng: -72.68333333333334,
    lat: 41.76583333333333
  },
  {
    names: ["تورشهلا", "Torshälla"],
    country: "SE",
    lng: 16.466666666666665,
    lat: 59.416666666666664
  },
  {
    names: ["لاوترباخ (هسن)", "Lauterbach"],
    country: "DE",
    lng: 9.394444444444444,
    lat: 50.63777777777778
  },
  {
    names: ["سیراکیوس، نیویورک", "سیراکیوس", "Syracuse"],
    country: "US",
    lng: -76.14416666666668,
    lat: 43.04694444444444
  },
  {
    names: [
      "سوق اهراس، الجزایر",
      "سوق اهراس",
      "سوق اهراس /طاغاست",
      "Suq Ahras / Tagast"
    ],
    country: "DZ",
    lng: 7.9511111111111115,
    lat: 36.28638888888889
  },
  {
    names: ["آپیا", "Apia"],
    country: "WS",
    lng: -171.76666666666668,
    lat: -13.833333333333334
  },
  { names: ["سیمریسهامن"], country: "SE", lng: 14.35, lat: 55.55 },
  {
    names: ["ناپرویل، ایلینوی"],
    country: "US",
    lng: -88.16555555555556,
    lat: 41.74805555555556
  },
  {
    names: ["پاراکار", "Փարաքար"],
    country: "AM",
    lng: 44.405833333333334,
    lat: 40.163888888888884
  },
  {
    names: ["لرنادزور", "Լեռնաձոր"],
    country: "AM",
    lng: 46.19972222222222,
    lat: 39.157222222222224
  },
  {
    names: ["روشلیتس"],
    country: "DE",
    lng: 12.79861111111111,
    lat: 51.04805555555556
  },
  {
    names: ["اکاتپک٬ استادو د مخیکو", "اکاتپک"],
    country: "MX",
    lng: -99.0525,
    lat: 19.600833333333334
  },
  {
    names: ["تورباکو", "Turbaco"],
    country: "CO",
    lng: -75.43333333333334,
    lat: 10.316666666666666
  },
  {
    names: [
      "کامیانتس-پودیلسکیی",
      "Kamianets-Podilskyi",
      "Кам'янець-Подільський"
    ],
    country: "UA",
    lng: 26.583333333333332,
    lat: 48.68333333333333
  },
  {
    names: ["رابنوا، زاکسن", "Rabenau"],
    country: "DE",
    lng: 13.633333333333333,
    lat: 50.96666666666667
  },
  {
    names: ["گوگارک (روستا)", "گوگارک", "Գուգարք"],
    country: "AM",
    lng: 44.53805555555555,
    lat: 40.80722222222222
  },
  {
    names: ["گیمبه", "Ghimbav"],
    country: "RO",
    lng: 25.50611111111111,
    lat: 45.66277777777778
  },
  {
    names: ["نویربورگ"],
    country: "DE",
    lng: 6.295833333333333,
    lat: 50.010555555555555
  },
  {
    names: ["ترگوویشته، رومانی", "ترگوویشته", "Târgovişte"],
    country: "RO",
    lng: 25.456666666666667,
    lat: 44.924166666666665
  },
  {
    names: ["هاردگسن", "Hardegsen"],
    country: "DE",
    lng: 9.829444444444444,
    lat: 51.65222222222222
  },
  {
    names: ["ترندلبورگ"],
    country: "DE",
    lng: 9.416666666666666,
    lat: 51.583333333333336
  },
  {
    names: ["درتیول"],
    country: "TR",
    lng: 36.224444444444444,
    lat: 36.84277777777778
  },
  { names: ["اربندورف"], country: "DE", lng: 12.05, lat: 49.833333333333336 },
  { names: ["آرن‌برگ"], country: "DE", lng: 12, lat: 52.666666666666664 },
  {
    names: ["مونروویا", "Monrovia"],
    country: "LR",
    lng: -10.801388888888889,
    lat: 6.3133333333333335
  },
  {
    names: ["دووغ", "Դովեղ"],
    country: "AM",
    lng: 45.03333333333333,
    lat: 41.18333333333333
  },
  {
    names: ["یافوروف", "Jaworów"],
    country: "UA",
    lng: 23.393055555555556,
    lat: 49.94694444444444
  },
  {
    names: ["آیش‌شتت"],
    country: "DE",
    lng: 11.18388888888889,
    lat: 48.89194444444444
  },
  {
    names: ["میتنوالده (مارک)", "Mittenwalde"],
    country: "DE",
    lng: 13.533333333333333,
    lat: 52.266666666666666
  },
  {
    names: ["کاتناجور", "Կաթնաջուր"],
    country: "AM",
    lng: 44.14138888888889,
    lat: 40.825
  },
  {
    names: ["قونیه"],
    country: "TR",
    lng: 32.483333333333334,
    lat: 37.86666666666667
  },
  {
    names: ["ماتا-اوتو", "Mata-Utu", "Matāʻutu"],
    country: "FR",
    lng: -176.18333333333334,
    lat: -13.283333333333333
  },
  {
    names: ["فردریکتون", "Fredericton"],
    country: "CA",
    lng: -66.647818,
    lat: 45.957319
  },
  {
    names: ["اشتوتگارت"],
    country: "DE",
    lng: 9.183333333333334,
    lat: 48.78333333333333
  },
  {
    names: ["آرگل، ارمنستان", "آرگل", "Արգել"],
    country: "AM",
    lng: 44.599444444444444,
    lat: 40.379444444444445
  },
  {
    names: ["ساراتاک", "Սարատակ"],
    country: "AM",
    lng: 43.86638888888889,
    lat: 40.669999999999995
  },
  {
    names: ["آجارلار", "Acarlar"],
    country: "TR",
    lng: 27.766666666666666,
    lat: 37.833333333333336
  },
  {
    names: ["مرگانوش", "Մրգանուշ"],
    country: "AM",
    lng: 44.558611111111105,
    lat: 40.02861111111111
  },
  {
    names: ["آرگوآ", "Areguá"],
    country: "PY",
    lng: -57.414722222222224,
    lat: -25.29527777777778
  },
  { names: ["پیلار", "Pilar"], country: "PY", lng: -58.3, lat: -26.87 },
  {
    names: ["چنگدو", "成都市"],
    country: "CN",
    lng: 104.06472222222222,
    lat: 30.65861111111111
  },
  {
    names: ["ولفنبوتل", "Wolfenbüttel"],
    country: "DE",
    lng: 10.536944444444444,
    lat: 52.16222222222222
  },
  {
    names: ["کلن", "Köln"],
    country: "DE",
    lng: 6.952777777777778,
    lat: 50.936388888888885
  },
  {
    names: ["سایوتومه", "São Tomé"],
    country: "ST",
    lng: 6.681388888888889,
    lat: 0.3361111111111111
  }
];
